!
function(global, factory) {
    if (typeof module === "object" && typeof module.exports === "object") {
        module.exports = factory(global)
    } else if (typeof define === "function") {
        define(factory())
    } else {
        window.VMUI_CITYS = factory()
    }
}(typeof window !== "undefined" ? window : this, function(window) {
var citys = [{
    "id": 1,
    "name": "北京",
    "child": [{
        "child": [{
            "id": 2,
            "name": "城区"
        },
        {
            "id": 3,
            "name": "城区以外"
        }],
        "id": 4,
        "name": "密云区"
    },
    {
        "child": [{
            "id": 5,
            "name": "三环到四环之间"
        },
        {
            "id": 6,
            "name": "四环到五环之间"
        },
        {
            "id": 7,
            "name": "五环到六环之间"
        },
        {
            "id": 8,
            "name": "管庄"
        },
        {
            "id": 9,
            "name": "北苑"
        },
        {
            "id": 10,
            "name": "定福庄"
        },
        {
            "id": 11,
            "name": "三环以内"
        }],
        "id": 12,
        "name": "朝阳区"
    },
    {
        "child": [{
            "id": 13,
            "name": "六环以内"
        },
        {
            "id": 14,
            "name": "城区"
        },
        {
            "id": 15,
            "name": "城区以外"
        }],
        "id": 16,
        "name": "昌平区"
    },
    {
        "child": [{
            "id": 17,
            "name": "城区"
        },
        {
            "id": 18,
            "name": "城区以外"
        }],
        "id": 19,
        "name": "平谷区"
    },
    {
        "child": [{
            "id": 20,
            "name": "三环以内"
        },
        {
            "id": 21,
            "name": "三环到四环之间"
        },
        {
            "id": 22,
            "name": "四环到五环之间"
        },
        {
            "id": 23,
            "name": "五环到六环之间"
        },
        {
            "id": 24,
            "name": "六环以外"
        },
        {
            "id": 25,
            "name": "西三旗"
        },
        {
            "id": 26,
            "name": "西二旗"
        }],
        "id": 27,
        "name": "海淀区"
    },
    {
        "child": [{
            "id": 28,
            "name": "内环到二环里"
        },
        {
            "id": 29,
            "name": "二环到三环"
        }],
        "id": 30,
        "name": "西城区"
    },
    {
        "child": [{
            "id": 31,
            "name": "内环到三环里"
        }],
        "id": 32,
        "name": "东城区"
    },
    {
        "child": [{
            "id": 33,
            "name": "一环到二环"
        },
        {
            "id": 34,
            "name": "二环到三环"
        }],
        "id": 35,
        "name": "崇文区"
    },
    {
        "child": [{
            "id": 36,
            "name": "内环到三环里"
        }],
        "id": 37,
        "name": "宣武区"
    },
    {
        "child": [{
            "id": 38,
            "name": "四环到五环之间"
        },
        {
            "id": 39,
            "name": "二环到三环"
        },
        {
            "id": 40,
            "name": "三环到四环之间"
        },
        {
            "id": 41,
            "name": "五环到六环之间"
        },
        {
            "id": 42,
            "name": "六环之外"
        }],
        "id": 43,
        "name": "丰台区"
    },
    {
        "child": [{
            "id": 44,
            "name": "四环到五环内"
        },
        {
            "id": 45,
            "name": "石景山城区"
        },
        {
            "id": 46,
            "name": "八大处科技园区"
        }],
        "id": 47,
        "name": "石景山区"
    },
    {
        "child": [{
            "id": 48,
            "name": "城区"
        },
        {
            "id": 49,
            "name": "龙泉镇"
        },
        {
            "id": 50,
            "name": "永定镇"
        },
        {
            "id": 51,
            "name": "大台镇"
        },
        {
            "id": 52,
            "name": "潭柘寺镇"
        },
        {
            "id": 53,
            "name": "王平镇"
        },
        {
            "id": 54,
            "name": "军庄镇"
        },
        {
            "id": 55,
            "name": "妙峰山镇"
        },
        {
            "id": 56,
            "name": "雁翅镇"
        },
        {
            "id": 57,
            "name": "斋堂镇"
        },
        {
            "id": 58,
            "name": "清水镇"
        }],
        "id": 59,
        "name": "门头沟"
    },
    {
        "child": [{
            "id": 60,
            "name": "城区"
        },
        {
            "id": 61,
            "name": "大安山乡"
        },
        {
            "id": 62,
            "name": "大石窝镇"
        },
        {
            "id": 63,
            "name": "窦店镇"
        },
        {
            "id": 64,
            "name": "佛子庄乡"
        },
        {
            "id": 65,
            "name": "韩村河镇"
        },
        {
            "id": 66,
            "name": "河北镇"
        },
        {
            "id": 67,
            "name": "良乡镇"
        },
        {
            "id": 68,
            "name": "琉璃河镇"
        },
        {
            "id": 69,
            "name": "南窖乡"
        },
        {
            "id": 70,
            "name": "蒲洼乡"
        },
        {
            "id": 71,
            "name": "青龙湖镇"
        },
        {
            "id": 72,
            "name": "十渡镇"
        },
        {
            "id": 73,
            "name": "石楼镇"
        },
        {
            "id": 74,
            "name": "史家营乡"
        },
        {
            "id": 75,
            "name": "霞云岭乡"
        },
        {
            "id": 76,
            "name": "新镇"
        },
        {
            "id": 77,
            "name": "阎村镇"
        },
        {
            "id": 78,
            "name": "燕山地区"
        },
        {
            "id": 79,
            "name": "张坊镇"
        },
        {
            "id": 80,
            "name": "长沟镇"
        },
        {
            "id": 81,
            "name": "长阳镇"
        },
        {
            "id": 82,
            "name": "周口店镇"
        }],
        "id": 83,
        "name": "房山区"
    },
    {
        "child": [{
            "id": 84,
            "name": "六环内（马驹桥镇）"
        },
        {
            "id": 85,
            "name": "中仓街道"
        },
        {
            "id": 86,
            "name": "新华街道"
        },
        {
            "id": 87,
            "name": "玉桥街道"
        },
        {
            "id": 88,
            "name": "北苑街道"
        },
        {
            "id": 89,
            "name": "六环外（马驹桥镇）"
        },
        {
            "id": 90,
            "name": "永顺镇"
        },
        {
            "id": 91,
            "name": "梨园镇"
        },
        {
            "id": 92,
            "name": "宋庄镇"
        },
        {
            "id": 93,
            "name": "漷县镇"
        },
        {
            "id": 94,
            "name": "张家湾镇"
        },
        {
            "id": 95,
            "name": "西集镇"
        },
        {
            "id": 96,
            "name": "永乐店镇"
        },
        {
            "id": 97,
            "name": "潞城镇"
        },
        {
            "id": 98,
            "name": "台湖镇"
        },
        {
            "id": 99,
            "name": "于家务乡"
        },
        {
            "id": 100,
            "name": "次渠镇"
        }],
        "id": 101,
        "name": "通州区"
    },
    {
        "child": [{
            "id": 102,
            "name": "延庆镇"
        },
        {
            "id": 103,
            "name": "城区"
        },
        {
            "id": 104,
            "name": "康庄镇"
        },
        {
            "id": 105,
            "name": "八达岭镇"
        },
        {
            "id": 106,
            "name": "永宁镇"
        },
        {
            "id": 107,
            "name": "旧县镇"
        },
        {
            "id": 108,
            "name": "张山营镇"
        },
        {
            "id": 109,
            "name": "四海镇"
        },
        {
            "id": 110,
            "name": "千家店镇"
        },
        {
            "id": 111,
            "name": "沈家营镇"
        },
        {
            "id": 112,
            "name": "大榆树镇"
        },
        {
            "id": 113,
            "name": "井庄镇"
        },
        {
            "id": 114,
            "name": "大庄科乡"
        },
        {
            "id": 115,
            "name": "刘斌堡乡"
        },
        {
            "id": 116,
            "name": "香营乡"
        },
        {
            "id": 117,
            "name": "珍珠泉乡"
        }],
        "id": 118,
        "name": "延庆县"
    },
    {
        "child": [{
            "id": 119,
            "name": "四环至五环之间"
        },
        {
            "id": 120,
            "name": "五环至六环之间"
        },
        {
            "id": 121,
            "name": "六环以外"
        },
        {
            "id": 122,
            "name": "亦庄经济开发区"
        }],
        "id": 123,
        "name": "大兴区"
    },
    {
        "child": [{
            "id": 124,
            "name": "北石槽镇"
        },
        {
            "id": 125,
            "name": "北务镇"
        },
        {
            "id": 126,
            "name": "北小营镇"
        },
        {
            "id": 127,
            "name": "大孙各庄镇"
        },
        {
            "id": 128,
            "name": "高丽营镇"
        },
        {
            "id": 129,
            "name": "光明街道"
        },
        {
            "id": 130,
            "name": "后沙峪地区"
        },
        {
            "id": 131,
            "name": "空港街道"
        },
        {
            "id": 132,
            "name": "李桥镇"
        },
        {
            "id": 133,
            "name": "李遂镇"
        },
        {
            "id": 134,
            "name": "龙湾屯镇"
        },
        {
            "id": 135,
            "name": "马坡地区"
        },
        {
            "id": 136,
            "name": "木林镇"
        },
        {
            "id": 137,
            "name": "南彩镇"
        },
        {
            "id": 138,
            "name": "南法信地区"
        },
        {
            "id": 139,
            "name": "牛栏山地区"
        },
        {
            "id": 140,
            "name": "仁和地区"
        },
        {
            "id": 141,
            "name": "胜利街道"
        },
        {
            "id": 142,
            "name": "石园街道"
        },
        {
            "id": 143,
            "name": "双丰街道"
        },
        {
            "id": 144,
            "name": "天竺地区"
        },
        {
            "id": 145,
            "name": "旺泉街道"
        },
        {
            "id": 146,
            "name": "杨镇地区"
        },
        {
            "id": 147,
            "name": "张镇"
        },
        {
            "id": 148,
            "name": "赵全营镇"
        }],
        "id": 149,
        "name": "顺义区"
    },
    {
        "child": [{
            "id": 150,
            "name": "城区以内"
        },
        {
            "id": 151,
            "name": "郊区"
        }],
        "id": 152,
        "name": "怀柔区"
    }]
},
{
    "id": 153,
    "name": "上海",
    "child": [{
        "child": [{
            "id": 154,
            "name": "城区"
        }],
        "id": 155,
        "name": "静安区"
    },
    {
        "child": [{
            "id": 156,
            "name": "城区"
        }],
        "id": 157,
        "name": "闸北区"
    },
    {
        "child": [{
            "id": 158,
            "name": "城区"
        }],
        "id": 159,
        "name": "虹口区"
    },
    {
        "child": [{
            "id": 160,
            "name": "城区"
        }],
        "id": 161,
        "name": "杨浦区"
    },
    {
        "child": [{
            "id": 162,
            "name": "罗店镇"
        },
        {
            "id": 163,
            "name": "城区"
        },
        {
            "id": 164,
            "name": "大场镇"
        },
        {
            "id": 165,
            "name": "杨行镇"
        },
        {
            "id": 166,
            "name": "月浦镇"
        },
        {
            "id": 167,
            "name": "罗泾镇"
        },
        {
            "id": 168,
            "name": "顾村镇"
        },
        {
            "id": 169,
            "name": "高境镇"
        },
        {
            "id": 170,
            "name": "庙行镇"
        },
        {
            "id": 171,
            "name": "淞南镇"
        },
        {
            "id": 172,
            "name": "宝山城市工业园区"
        }],
        "id": 173,
        "name": "宝山区"
    },
    {
        "child": [{
            "id": 174,
            "name": "城区"
        },
        {
            "id": 175,
            "name": "莘庄镇"
        },
        {
            "id": 176,
            "name": "七宝镇"
        },
        {
            "id": 177,
            "name": "浦江镇"
        },
        {
            "id": 178,
            "name": "梅陇镇"
        },
        {
            "id": 179,
            "name": "虹桥镇"
        },
        {
            "id": 180,
            "name": "马桥镇"
        },
        {
            "id": 181,
            "name": "吴泾镇"
        },
        {
            "id": 182,
            "name": "华漕镇"
        },
        {
            "id": 183,
            "name": "颛桥镇"
        }],
        "id": 184,
        "name": "闵行区"
    },
    {
        "child": [{
            "id": 185,
            "name": "城区"
        },
        {
            "id": 186,
            "name": "南翔镇"
        },
        {
            "id": 187,
            "name": "马陆镇"
        },
        {
            "id": 188,
            "name": "华亭镇"
        },
        {
            "id": 189,
            "name": "江桥镇"
        },
        {
            "id": 190,
            "name": "菊园新区"
        },
        {
            "id": 191,
            "name": "安亭镇"
        },
        {
            "id": 192,
            "name": "徐行镇"
        },
        {
            "id": 193,
            "name": "外冈镇"
        },
        {
            "id": 194,
            "name": "嘉定工业区"
        }],
        "id": 195,
        "name": "嘉定区"
    },
    {
        "child": [{
            "id": 196,
            "name": "城区"
        },
        {
            "id": 197,
            "name": "川沙新镇"
        },
        {
            "id": 198,
            "name": "祝桥镇"
        },
        {
            "id": 199,
            "name": "新场镇"
        },
        {
            "id": 200,
            "name": "高桥镇"
        },
        {
            "id": 201,
            "name": "惠南镇"
        },
        {
            "id": 202,
            "name": "北蔡镇"
        },
        {
            "id": 203,
            "name": "合庆镇"
        },
        {
            "id": 204,
            "name": "唐镇"
        },
        {
            "id": 205,
            "name": "曹路镇"
        },
        {
            "id": 206,
            "name": "金桥镇"
        },
        {
            "id": 207,
            "name": "高行镇"
        },
        {
            "id": 208,
            "name": "高东镇"
        },
        {
            "id": 209,
            "name": "张江镇"
        },
        {
            "id": 210,
            "name": "三林镇"
        },
        {
            "id": 211,
            "name": "南汇新城镇"
        },
        {
            "id": 212,
            "name": "康桥镇"
        },
        {
            "id": 213,
            "name": "宣桥镇"
        },
        {
            "id": 214,
            "name": "书院镇"
        },
        {
            "id": 215,
            "name": "大团镇"
        },
        {
            "id": 216,
            "name": "周浦镇"
        },
        {
            "id": 217,
            "name": "芦潮港镇"
        },
        {
            "id": 218,
            "name": "泥城镇"
        },
        {
            "id": 219,
            "name": "航头镇"
        },
        {
            "id": 220,
            "name": "万祥镇"
        },
        {
            "id": 221,
            "name": "老港镇"
        }],
        "id": 222,
        "name": "浦东新区"
    },
    {
        "child": [{
            "id": 223,
            "name": "城区"
        },
        {
            "id": 224,
            "name": "赵巷镇"
        },
        {
            "id": 225,
            "name": "徐泾镇"
        },
        {
            "id": 226,
            "name": "华新镇"
        },
        {
            "id": 227,
            "name": "重固镇"
        },
        {
            "id": 228,
            "name": "白鹤镇"
        },
        {
            "id": 229,
            "name": "练塘镇"
        },
        {
            "id": 230,
            "name": "金泽镇"
        },
        {
            "id": 231,
            "name": "朱家角镇"
        }],
        "id": 232,
        "name": "青浦区"
    },
    {
        "child": [{
            "id": 233,
            "name": "城区"
        },
        {
            "id": 234,
            "name": "泗泾镇"
        },
        {
            "id": 235,
            "name": "佘山镇"
        },
        {
            "id": 236,
            "name": "车墩镇"
        },
        {
            "id": 237,
            "name": "新桥镇"
        },
        {
            "id": 238,
            "name": "洞泾镇"
        },
        {
            "id": 239,
            "name": "九亭镇"
        },
        {
            "id": 240,
            "name": "泖港镇"
        },
        {
            "id": 241,
            "name": "石湖荡镇"
        },
        {
            "id": 242,
            "name": "新浜镇"
        },
        {
            "id": 243,
            "name": "叶榭镇"
        },
        {
            "id": 244,
            "name": "小昆山镇"
        }],
        "id": 245,
        "name": "松江区"
    },
    {
        "child": [{
            "id": 246,
            "name": "城区"
        },
        {
            "id": 247,
            "name": "金山工业区"
        },
        {
            "id": 248,
            "name": "朱泾镇"
        },
        {
            "id": 249,
            "name": "枫泾镇"
        },
        {
            "id": 250,
            "name": "张堰镇"
        },
        {
            "id": 251,
            "name": "亭林镇"
        },
        {
            "id": 252,
            "name": "吕巷镇"
        },
        {
            "id": 253,
            "name": "廊下镇"
        },
        {
            "id": 254,
            "name": "金山卫镇"
        },
        {
            "id": 255,
            "name": "漕泾镇"
        },
        {
            "id": 256,
            "name": "山阳镇"
        }],
        "id": 257,
        "name": "金山区"
    },
    {
        "child": [{
            "id": 258,
            "name": "南桥镇"
        },
        {
            "id": 259,
            "name": "奉城镇"
        },
        {
            "id": 260,
            "name": "四团镇"
        },
        {
            "id": 261,
            "name": "柘林镇"
        },
        {
            "id": 262,
            "name": "庄行镇"
        },
        {
            "id": 263,
            "name": "金汇镇"
        },
        {
            "id": 264,
            "name": "青村镇"
        },
        {
            "id": 265,
            "name": "海湾镇"
        }],
        "id": 266,
        "name": "奉贤区"
    },
    {
        "child": [{
            "id": 267,
            "name": "城区"
        }],
        "id": 268,
        "name": "普陀区"
    },
    {
        "child": [{
            "id": 269,
            "name": "城区"
        }],
        "id": 270,
        "name": "黄浦区"
    },
    {
        "child": [{
            "id": 271,
            "name": "堡镇"
        },
        {
            "id": 272,
            "name": "庙镇"
        },
        {
            "id": 273,
            "name": "陈家镇"
        },
        {
            "id": 274,
            "name": "城桥镇"
        },
        {
            "id": 275,
            "name": "东平镇"
        },
        {
            "id": 276,
            "name": "港西镇"
        },
        {
            "id": 277,
            "name": "港沿镇"
        },
        {
            "id": 278,
            "name": "建设镇"
        },
        {
            "id": 279,
            "name": "绿华镇"
        },
        {
            "id": 280,
            "name": "三星镇"
        },
        {
            "id": 281,
            "name": "竖新镇"
        },
        {
            "id": 282,
            "name": "向化镇"
        },
        {
            "id": 283,
            "name": "新海镇"
        },
        {
            "id": 284,
            "name": "新河镇"
        },
        {
            "id": 285,
            "name": "中兴镇"
        },
        {
            "id": 286,
            "name": "长兴乡"
        },
        {
            "id": 287,
            "name": "横沙乡"
        },
        {
            "id": 288,
            "name": "新村乡"
        }],
        "id": 289,
        "name": "崇明县"
    },
    {
        "child": [{
            "id": 290,
            "name": "城区"
        }],
        "id": 291,
        "name": "徐汇区"
    },
    {
        "child": [{
            "id": 292,
            "name": "城区"
        }],
        "id": 293,
        "name": "长宁区"
    }]
},
{
    "id": 294,
    "name": "天津",
    "child": [{
        "child": [{
            "id": 295,
            "name": "全境"
        }],
        "id": 296,
        "name": "东丽区"
    },
    {
        "child": [{
            "id": 297,
            "name": "全境"
        }],
        "id": 298,
        "name": "和平区"
    },
    {
        "child": [{
            "id": 299,
            "name": "全境"
        }],
        "id": 300,
        "name": "河北区"
    },
    {
        "child": [{
            "id": 301,
            "name": "全境"
        }],
        "id": 302,
        "name": "河东区"
    },
    {
        "child": [{
            "id": 303,
            "name": "全境"
        }],
        "id": 304,
        "name": "河西区"
    },
    {
        "child": [{
            "id": 305,
            "name": "全境"
        }],
        "id": 306,
        "name": "红桥区"
    },
    {
        "child": [{
            "id": 307,
            "name": "全境"
        }],
        "id": 308,
        "name": "蓟县"
    },
    {
        "child": [{
            "id": 309,
            "name": "全境"
        }],
        "id": 310,
        "name": "静海县"
    },
    {
        "child": [{
            "id": 311,
            "name": "全境"
        }],
        "id": 312,
        "name": "南开区"
    },
    {
        "child": [{
            "id": 313,
            "name": "全境"
        }],
        "id": 314,
        "name": "塘沽区"
    },
    {
        "child": [{
            "id": 315,
            "name": "杨柳青,中北,精武,大寺镇,环外海泰及外环内"
        },
        {
            "id": 316,
            "name": "其它地区"
        }],
        "id": 317,
        "name": "西青区"
    },
    {
        "child": [{
            "id": 318,
            "name": "杨村镇、下朱庄内"
        },
        {
            "id": 319,
            "name": "其它地区"
        }],
        "id": 320,
        "name": "武清区"
    },
    {
        "child": [{
            "id": 321,
            "name": "双港，辛庄"
        },
        {
            "id": 322,
            "name": "咸水沽镇、海河教育园，海河科技园"
        },
        {
            "id": 323,
            "name": "其他地区"
        }],
        "id": 324,
        "name": "津南区"
    },
    {
        "child": [{
            "id": 325,
            "name": "汉沽区街里、汉沽开发区"
        },
        {
            "id": 326,
            "name": "其它地区"
        }],
        "id": 327,
        "name": "汉沽区"
    },
    {
        "child": [{
            "id": 328,
            "name": "大港油田"
        },
        {
            "id": 329,
            "name": "主城区内"
        },
        {
            "id": 330,
            "name": "主城区外"
        }],
        "id": 331,
        "name": "大港区"
    },
    {
        "child": [{
            "id": 332,
            "name": "外环外双街镇，河北工大新校，屈店工业园"
        },
        {
            "id": 333,
            "name": "外环内"
        },
        {
            "id": 334,
            "name": "外环外其它地区"
        }],
        "id": 335,
        "name": "北辰区"
    },
    {
        "child": [{
            "id": 336,
            "name": "城关镇、马家店开发区、天宝工业园"
        },
        {
            "id": 337,
            "name": "其它地区"
        }],
        "id": 338,
        "name": "宝坻区"
    },
    {
        "child": [{
            "id": 339,
            "name": "芦台镇、经济开发区、贸易开发区"
        },
        {
            "id": 340,
            "name": "其它地区"
        }],
        "id": 341,
        "name": "宁河县"
    }]
},
{
    "id": 342,
    "name": "重庆",
    "child": [{
        "child": [{
            "id": 343,
            "name": "县城内"
        },
        {
            "id": 344,
            "name": "青杠镇"
        },
        {
            "id": 345,
            "name": "来凤镇"
        },
        {
            "id": 346,
            "name": "丁家镇"
        },
        {
            "id": 347,
            "name": "大路镇"
        },
        {
            "id": 348,
            "name": "八塘镇"
        },
        {
            "id": 349,
            "name": "七塘镇"
        },
        {
            "id": 350,
            "name": "河边镇"
        },
        {
            "id": 351,
            "name": "福禄镇"
        },
        {
            "id": 352,
            "name": "大兴镇"
        },
        {
            "id": 353,
            "name": "正兴镇"
        },
        {
            "id": 354,
            "name": "广普镇"
        },
        {
            "id": 355,
            "name": "三合镇"
        },
        {
            "id": 356,
            "name": "健龙镇"
        }],
        "id": 357,
        "name": "璧山县"
    },
    {
        "child": [{
            "id": 358,
            "name": "县城内"
        },
        {
            "id": 359,
            "name": "广顺镇"
        },
        {
            "id": 360,
            "name": "安富镇"
        },
        {
            "id": 361,
            "name": "峰高镇"
        },
        {
            "id": 362,
            "name": "双河镇"
        },
        {
            "id": 363,
            "name": "直升镇"
        },
        {
            "id": 364,
            "name": "路孔镇"
        },
        {
            "id": 365,
            "name": "清江镇"
        },
        {
            "id": 366,
            "name": "仁义镇"
        },
        {
            "id": 367,
            "name": "河包镇"
        },
        {
            "id": 368,
            "name": "古昌镇"
        },
        {
            "id": 369,
            "name": "吴家镇"
        },
        {
            "id": 370,
            "name": "观胜镇"
        },
        {
            "id": 371,
            "name": "铜鼓镇"
        },
        {
            "id": 372,
            "name": "清流镇"
        },
        {
            "id": 373,
            "name": "盘龙镇"
        },
        {
            "id": 374,
            "name": "远觉镇"
        },
        {
            "id": 375,
            "name": "清升镇"
        },
        {
            "id": 376,
            "name": "荣隆镇"
        },
        {
            "id": 377,
            "name": "龙集镇"
        }],
        "id": 378,
        "name": "荣昌县"
    },
    {
        "child": [{
            "id": 379,
            "name": "县城内"
        },
        {
            "id": 380,
            "name": "土桥镇"
        },
        {
            "id": 381,
            "name": "二坪镇"
        },
        {
            "id": 382,
            "name": "水口镇"
        },
        {
            "id": 383,
            "name": "安居镇"
        },
        {
            "id": 384,
            "name": "白羊镇"
        },
        {
            "id": 385,
            "name": "平滩镇"
        },
        {
            "id": 386,
            "name": "石鱼镇"
        },
        {
            "id": 387,
            "name": "福果镇"
        },
        {
            "id": 388,
            "name": "维新镇"
        },
        {
            "id": 389,
            "name": "高楼镇"
        },
        {
            "id": 390,
            "name": "大庙镇"
        },
        {
            "id": 391,
            "name": "围龙镇"
        },
        {
            "id": 392,
            "name": "华兴镇"
        },
        {
            "id": 393,
            "name": "永嘉镇"
        },
        {
            "id": 394,
            "name": "安溪镇"
        },
        {
            "id": 395,
            "name": "西河镇"
        },
        {
            "id": 396,
            "name": "太平镇"
        },
        {
            "id": 397,
            "name": "旧县镇"
        },
        {
            "id": 398,
            "name": "虎峰镇"
        },
        {
            "id": 399,
            "name": "少云镇"
        },
        {
            "id": 400,
            "name": "蒲吕镇"
        },
        {
            "id": 401,
            "name": "侣俸镇"
        },
        {
            "id": 402,
            "name": "小林乡"
        },
        {
            "id": 403,
            "name": "双山乡"
        },
        {
            "id": 404,
            "name": "庆隆乡"
        }],
        "id": 405,
        "name": "铜梁县"
    },
    {
        "child": [{
            "id": 406,
            "name": "内环以内"
        },
        {
            "id": 407,
            "name": "寸滩镇"
        },
        {
            "id": 408,
            "name": "郭家沱镇"
        },
        {
            "id": 409,
            "name": "铁山坪镇"
        },
        {
            "id": 410,
            "name": "鱼嘴镇"
        },
        {
            "id": 411,
            "name": "复盛镇"
        },
        {
            "id": 412,
            "name": "五宝镇"
        },
        {
            "id": 413,
            "name": "大石坝镇"
        }],
        "id": 414,
        "name": "江北区"
    },
    {
        "child": [{
            "id": 415,
            "name": "城区"
        },
        {
            "id": 416,
            "name": "内环以内"
        },
        {
            "id": 417,
            "name": "茶园新区"
        },
        {
            "id": 418,
            "name": "鸡冠石镇"
        },
        {
            "id": 419,
            "name": "长生桥镇"
        },
        {
            "id": 420,
            "name": "峡口镇"
        },
        {
            "id": 421,
            "name": "广阳镇"
        },
        {
            "id": 422,
            "name": "迎龙镇"
        }],
        "id": 423,
        "name": "南岸区"
    },
    {
        "child": [{
            "id": 424,
            "name": "内环以内"
        },
        {
            "id": 425,
            "name": "白市驿镇"
        },
        {
            "id": 426,
            "name": "铜罐驿镇"
        },
        {
            "id": 427,
            "name": "华岩镇"
        },
        {
            "id": 428,
            "name": "巴福镇"
        },
        {
            "id": 429,
            "name": "含谷镇"
        },
        {
            "id": 430,
            "name": "金凤镇"
        },
        {
            "id": 431,
            "name": "石板镇"
        },
        {
            "id": 432,
            "name": "陶家镇"
        },
        {
            "id": 433,
            "name": "西彭镇"
        },
        {
            "id": 434,
            "name": "走马镇"
        }],
        "id": 435,
        "name": "九龙坡区"
    },
    {
        "child": [{
            "id": 436,
            "name": "内环以内"
        },
        {
            "id": 437,
            "name": "陈家桥镇"
        },
        {
            "id": 438,
            "name": "歌乐山镇"
        },
        {
            "id": 439,
            "name": "青木关镇"
        },
        {
            "id": 440,
            "name": "回龙坝镇"
        },
        {
            "id": 441,
            "name": "大学城"
        },
        {
            "id": 442,
            "name": "虎溪镇"
        },
        {
            "id": 443,
            "name": "西永镇"
        },
        {
            "id": 444,
            "name": "土主镇"
        },
        {
            "id": 445,
            "name": "井口镇"
        },
        {
            "id": 446,
            "name": "曾家镇"
        },
        {
            "id": 447,
            "name": "凤凰镇"
        },
        {
            "id": 448,
            "name": "中梁镇"
        }],
        "id": 449,
        "name": "沙坪坝区"
    },
    {
        "child": [{
            "id": 450,
            "name": "茄子溪镇"
        },
        {
            "id": 451,
            "name": "建胜镇"
        },
        {
            "id": 452,
            "name": "跳磴镇"
        },
        {
            "id": 453,
            "name": "内环以内"
        }],
        "id": 454,
        "name": "大渡口区"
    },
    {
        "child": [{
            "id": 455,
            "name": "城区"
        },
        {
            "id": 456,
            "name": "三江镇"
        },
        {
            "id": 457,
            "name": "安稳镇"
        },
        {
            "id": 458,
            "name": "打通镇"
        },
        {
            "id": 459,
            "name": "丁山镇"
        },
        {
            "id": 460,
            "name": "东溪镇"
        },
        {
            "id": 461,
            "name": "扶欢镇"
        },
        {
            "id": 462,
            "name": "赶水镇"
        },
        {
            "id": 463,
            "name": "郭扶镇"
        },
        {
            "id": 464,
            "name": "横山镇"
        },
        {
            "id": 465,
            "name": "隆盛镇"
        },
        {
            "id": 466,
            "name": "三角镇"
        },
        {
            "id": 467,
            "name": "石壕镇"
        },
        {
            "id": 468,
            "name": "石角镇"
        },
        {
            "id": 469,
            "name": "新盛镇"
        },
        {
            "id": 470,
            "name": "永城镇"
        },
        {
            "id": 471,
            "name": "永新镇"
        },
        {
            "id": 472,
            "name": "中峰镇"
        },
        {
            "id": 473,
            "name": "篆塘镇"
        },
        {
            "id": 474,
            "name": "丛林镇"
        },
        {
            "id": 475,
            "name": "关坝镇"
        },
        {
            "id": 476,
            "name": "黑山镇"
        },
        {
            "id": 477,
            "name": "金桥镇"
        },
        {
            "id": 478,
            "name": "南桐镇"
        },
        {
            "id": 479,
            "name": "青年镇"
        },
        {
            "id": 480,
            "name": "石林镇"
        },
        {
            "id": 481,
            "name": "万东镇"
        }],
        "id": 482,
        "name": "綦江区"
    },
    {
        "child": [{
            "id": 483,
            "name": "城区"
        },
        {
            "id": 484,
            "name": "草街镇"
        },
        {
            "id": 485,
            "name": "盐井镇"
        },
        {
            "id": 486,
            "name": "云门镇"
        },
        {
            "id": 487,
            "name": "大石镇"
        },
        {
            "id": 488,
            "name": "沙鱼镇"
        },
        {
            "id": 489,
            "name": "官渡镇"
        },
        {
            "id": 490,
            "name": "涞滩镇"
        },
        {
            "id": 491,
            "name": "肖家镇"
        },
        {
            "id": 492,
            "name": "古楼镇"
        },
        {
            "id": 493,
            "name": "三庙镇"
        },
        {
            "id": 494,
            "name": "二郎镇"
        },
        {
            "id": 495,
            "name": "龙凤镇"
        },
        {
            "id": 496,
            "name": "隆兴镇"
        },
        {
            "id": 497,
            "name": "铜溪镇"
        },
        {
            "id": 498,
            "name": "双凤镇"
        },
        {
            "id": 499,
            "name": "狮滩镇"
        },
        {
            "id": 500,
            "name": "清平镇"
        },
        {
            "id": 501,
            "name": "土场镇"
        },
        {
            "id": 502,
            "name": "小沔镇"
        },
        {
            "id": 503,
            "name": "三汇镇"
        },
        {
            "id": 504,
            "name": "香龙镇"
        },
        {
            "id": 505,
            "name": "钱塘镇"
        },
        {
            "id": 506,
            "name": "龙市镇"
        },
        {
            "id": 507,
            "name": "燕窝镇"
        },
        {
            "id": 508,
            "name": "太和镇"
        },
        {
            "id": 509,
            "name": "渭沱镇"
        },
        {
            "id": 510,
            "name": "双槐镇"
        }],
        "id": 511,
        "name": "合川区"
    },
    {
        "child": [{
            "id": 512,
            "name": "城区"
        },
        {
            "id": 513,
            "name": "南泉镇"
        },
        {
            "id": 514,
            "name": "一品镇"
        },
        {
            "id": 515,
            "name": "南彭镇"
        },
        {
            "id": 516,
            "name": "惠民镇"
        },
        {
            "id": 517,
            "name": "麻柳嘴镇"
        },
        {
            "id": 518,
            "name": "天星寺镇"
        },
        {
            "id": 519,
            "name": "双河口镇"
        },
        {
            "id": 520,
            "name": "界石镇"
        },
        {
            "id": 521,
            "name": "安澜镇"
        },
        {
            "id": 522,
            "name": "跳石镇"
        },
        {
            "id": 523,
            "name": "木洞镇"
        },
        {
            "id": 524,
            "name": "丰盛镇"
        },
        {
            "id": 525,
            "name": "二圣镇"
        },
        {
            "id": 526,
            "name": "东泉镇"
        },
        {
            "id": 527,
            "name": "姜家镇"
        },
        {
            "id": 528,
            "name": "接龙镇"
        },
        {
            "id": 529,
            "name": "石滩镇"
        },
        {
            "id": 530,
            "name": "石龙镇"
        }],
        "id": 531,
        "name": "巴南区"
    },
    {
        "child": [{
            "id": 532,
            "name": "城区"
        },
        {
            "id": 533,
            "name": "东阳镇"
        },
        {
            "id": 534,
            "name": "蔡家岗镇"
        },
        {
            "id": 535,
            "name": "童家溪镇"
        },
        {
            "id": 536,
            "name": "施家梁镇"
        },
        {
            "id": 537,
            "name": "金刀峡镇"
        },
        {
            "id": 538,
            "name": "澄江镇"
        },
        {
            "id": 539,
            "name": "水土镇"
        },
        {
            "id": 540,
            "name": "歇马镇"
        },
        {
            "id": 541,
            "name": "天府镇"
        },
        {
            "id": 542,
            "name": "复兴镇"
        },
        {
            "id": 543,
            "name": "静观镇"
        },
        {
            "id": 544,
            "name": "柳荫镇"
        },
        {
            "id": 545,
            "name": "三圣镇"
        }],
        "id": 546,
        "name": "北碚区"
    },
    {
        "child": [{
            "id": 547,
            "name": "城区"
        },
        {
            "id": 548,
            "name": "四面山镇"
        },
        {
            "id": 549,
            "name": "支坪镇"
        },
        {
            "id": 550,
            "name": "白沙镇"
        },
        {
            "id": 551,
            "name": "珞璜镇"
        },
        {
            "id": 552,
            "name": "柏林镇"
        },
        {
            "id": 553,
            "name": "蔡家镇"
        },
        {
            "id": 554,
            "name": "慈云镇"
        },
        {
            "id": 555,
            "name": "杜市镇"
        },
        {
            "id": 556,
            "name": "广兴镇"
        },
        {
            "id": 557,
            "name": "嘉平镇"
        },
        {
            "id": 558,
            "name": "贾嗣镇"
        },
        {
            "id": 559,
            "name": "李市镇"
        },
        {
            "id": 560,
            "name": "龙华镇"
        },
        {
            "id": 561,
            "name": "石蟆镇"
        },
        {
            "id": 562,
            "name": "石门镇"
        },
        {
            "id": 563,
            "name": "塘河镇"
        },
        {
            "id": 564,
            "name": "吴滩镇"
        },
        {
            "id": 565,
            "name": "西湖镇"
        },
        {
            "id": 566,
            "name": "夏坝镇"
        },
        {
            "id": 567,
            "name": "先锋镇"
        },
        {
            "id": 568,
            "name": "永兴镇"
        },
        {
            "id": 569,
            "name": "油溪镇"
        },
        {
            "id": 570,
            "name": "中山镇"
        },
        {
            "id": 571,
            "name": "朱杨镇"
        }],
        "id": 572,
        "name": "江津区"
    },
    {
        "child": [{
            "id": 573,
            "name": "城区"
        },
        {
            "id": 574,
            "name": "礼嘉镇"
        },
        {
            "id": 575,
            "name": "两路镇"
        },
        {
            "id": 576,
            "name": "王家镇"
        },
        {
            "id": 577,
            "name": "悦来镇"
        },
        {
            "id": 578,
            "name": "玉峰山镇"
        },
        {
            "id": 579,
            "name": "茨竹镇"
        },
        {
            "id": 580,
            "name": "大盛镇"
        },
        {
            "id": 581,
            "name": "大塆镇"
        },
        {
            "id": 582,
            "name": "古路镇"
        },
        {
            "id": 583,
            "name": "龙兴镇"
        },
        {
            "id": 584,
            "name": "洛碛镇"
        },
        {
            "id": 585,
            "name": "木耳镇"
        },
        {
            "id": 586,
            "name": "石船镇"
        },
        {
            "id": 587,
            "name": "统景镇"
        },
        {
            "id": 588,
            "name": "兴隆镇"
        }],
        "id": 589,
        "name": "渝北区"
    },
    {
        "child": [{
            "id": 590,
            "name": "城区"
        },
        {
            "id": 591,
            "name": "长寿湖镇"
        },
        {
            "id": 592,
            "name": "邻封镇"
        },
        {
            "id": 593,
            "name": "但渡镇"
        },
        {
            "id": 594,
            "name": "云集镇"
        },
        {
            "id": 595,
            "name": "双龙镇"
        },
        {
            "id": 596,
            "name": "龙河镇"
        },
        {
            "id": 597,
            "name": "石堰镇"
        },
        {
            "id": 598,
            "name": "云台镇"
        },
        {
            "id": 599,
            "name": "海棠镇"
        },
        {
            "id": 600,
            "name": "葛兰镇"
        },
        {
            "id": 601,
            "name": "新市镇"
        },
        {
            "id": 602,
            "name": "八颗镇"
        },
        {
            "id": 603,
            "name": "洪湖镇"
        },
        {
            "id": 604,
            "name": "万顺镇"
        }],
        "id": 605,
        "name": "长寿区"
    },
    {
        "child": [{
            "id": 606,
            "name": "城区"
        },
        {
            "id": 607,
            "name": "双竹镇"
        },
        {
            "id": 608,
            "name": "三教镇"
        },
        {
            "id": 609,
            "name": "大安镇"
        },
        {
            "id": 610,
            "name": "陈食镇"
        },
        {
            "id": 611,
            "name": "板桥镇"
        },
        {
            "id": 612,
            "name": "宝峰镇"
        },
        {
            "id": 613,
            "name": "临江镇"
        },
        {
            "id": 614,
            "name": "红炉镇"
        },
        {
            "id": 615,
            "name": "吉安镇"
        },
        {
            "id": 616,
            "name": "金龙镇"
        },
        {
            "id": 617,
            "name": "来苏镇"
        },
        {
            "id": 618,
            "name": "青峰镇"
        },
        {
            "id": 619,
            "name": "双石镇"
        },
        {
            "id": 620,
            "name": "松溉镇"
        },
        {
            "id": 621,
            "name": "五间镇"
        },
        {
            "id": 622,
            "name": "仙龙镇"
        },
        {
            "id": 623,
            "name": "永荣镇"
        },
        {
            "id": 624,
            "name": "朱沱镇"
        },
        {
            "id": 625,
            "name": "何埂镇"
        }],
        "id": 626,
        "name": "永川区"
    },
    {
        "child": [{
            "id": 627,
            "name": "全境"
        }],
        "id": 628,
        "name": "渝中区"
    },
    {
        "child": [{
            "id": 629,
            "name": "全境"
        }],
        "id": 630,
        "name": "高新区"
    },
    {
        "child": [{
            "id": 631,
            "name": "全境"
        }],
        "id": 632,
        "name": "北部新区"
    },
    {
        "child": [{
            "id": 633,
            "name": "城区"
        },
        {
            "id": 634,
            "name": "龙滩子镇"
        },
        {
            "id": 635,
            "name": "龙水镇"
        },
        {
            "id": 636,
            "name": "智凤镇"
        },
        {
            "id": 637,
            "name": "宝顶镇"
        },
        {
            "id": 638,
            "name": "中敖镇"
        },
        {
            "id": 639,
            "name": "三驱镇"
        },
        {
            "id": 640,
            "name": "宝兴镇"
        },
        {
            "id": 641,
            "name": "玉龙镇"
        },
        {
            "id": 642,
            "name": "石马镇"
        },
        {
            "id": 643,
            "name": "拾万镇"
        },
        {
            "id": 644,
            "name": "回龙镇"
        },
        {
            "id": 645,
            "name": "金山镇"
        },
        {
            "id": 646,
            "name": "万古镇"
        },
        {
            "id": 647,
            "name": "国梁镇"
        },
        {
            "id": 648,
            "name": "雍溪镇"
        },
        {
            "id": 649,
            "name": "珠溪镇"
        },
        {
            "id": 650,
            "name": "龙石镇"
        },
        {
            "id": 651,
            "name": "邮亭镇"
        },
        {
            "id": 652,
            "name": "铁山镇"
        },
        {
            "id": 653,
            "name": "高升镇"
        },
        {
            "id": 654,
            "name": "季家镇"
        },
        {
            "id": 655,
            "name": "古龙镇"
        },
        {
            "id": 656,
            "name": "高坪镇"
        },
        {
            "id": 657,
            "name": "双路镇"
        },
        {
            "id": 658,
            "name": "通桥镇"
        }],
        "id": 659,
        "name": "大足区"
    },
    {
        "child": [{
            "id": 660,
            "name": "城区"
        },
        {
            "id": 661,
            "name": "白土镇"
        },
        {
            "id": 662,
            "name": "白羊镇"
        },
        {
            "id": 663,
            "name": "大周镇"
        },
        {
            "id": 664,
            "name": "弹子镇"
        },
        {
            "id": 665,
            "name": "分水镇"
        },
        {
            "id": 666,
            "name": "甘宁镇"
        },
        {
            "id": 667,
            "name": "高峰镇"
        },
        {
            "id": 668,
            "name": "高梁镇"
        },
        {
            "id": 669,
            "name": "后山镇"
        },
        {
            "id": 670,
            "name": "李河镇"
        },
        {
            "id": 671,
            "name": "龙驹镇"
        },
        {
            "id": 672,
            "name": "龙沙镇"
        },
        {
            "id": 673,
            "name": "罗田镇"
        },
        {
            "id": 674,
            "name": "孙家镇"
        },
        {
            "id": 675,
            "name": "太安镇"
        },
        {
            "id": 676,
            "name": "太龙镇"
        },
        {
            "id": 677,
            "name": "天城镇"
        },
        {
            "id": 678,
            "name": "武陵镇"
        },
        {
            "id": 679,
            "name": "响水镇"
        },
        {
            "id": 680,
            "name": "小周镇"
        },
        {
            "id": 681,
            "name": "新田镇"
        },
        {
            "id": 682,
            "name": "新乡镇"
        },
        {
            "id": 683,
            "name": "熊家镇"
        },
        {
            "id": 684,
            "name": "余家镇"
        },
        {
            "id": 685,
            "name": "长岭镇"
        },
        {
            "id": 686,
            "name": "长坪镇"
        },
        {
            "id": 687,
            "name": "长滩镇"
        },
        {
            "id": 688,
            "name": "走马镇"
        },
        {
            "id": 689,
            "name": "瀼渡镇"
        },
        {
            "id": 690,
            "name": "茨竹乡"
        },
        {
            "id": 691,
            "name": "柱山乡"
        },
        {
            "id": 692,
            "name": "燕山乡"
        },
        {
            "id": 693,
            "name": "溪口乡"
        },
        {
            "id": 694,
            "name": "普子乡"
        },
        {
            "id": 695,
            "name": "地宝乡"
        },
        {
            "id": 696,
            "name": "铁峰乡"
        },
        {
            "id": 697,
            "name": "黄柏乡"
        },
        {
            "id": 698,
            "name": "九池乡"
        },
        {
            "id": 699,
            "name": "梨树乡"
        },
        {
            "id": 700,
            "name": "郭村乡"
        },
        {
            "id": 701,
            "name": "恒合乡"
        }],
        "id": 702,
        "name": "万州区"
    },
    {
        "child": [{
            "id": 703,
            "name": "城区"
        },
        {
            "id": 704,
            "name": "李渡镇"
        },
        {
            "id": 705,
            "name": "白涛镇"
        },
        {
            "id": 706,
            "name": "百胜镇"
        },
        {
            "id": 707,
            "name": "堡子镇"
        },
        {
            "id": 708,
            "name": "焦石镇"
        },
        {
            "id": 709,
            "name": "蔺市镇"
        },
        {
            "id": 710,
            "name": "龙桥镇"
        },
        {
            "id": 711,
            "name": "龙潭镇"
        },
        {
            "id": 712,
            "name": "马武镇"
        },
        {
            "id": 713,
            "name": "南沱镇"
        },
        {
            "id": 714,
            "name": "青羊镇"
        },
        {
            "id": 715,
            "name": "清溪镇"
        },
        {
            "id": 716,
            "name": "石沱镇"
        },
        {
            "id": 717,
            "name": "新妙镇"
        },
        {
            "id": 718,
            "name": "义和镇"
        },
        {
            "id": 719,
            "name": "增福乡"
        },
        {
            "id": 720,
            "name": "珍溪镇"
        },
        {
            "id": 721,
            "name": "镇安镇"
        },
        {
            "id": 722,
            "name": "致韩镇"
        },
        {
            "id": 723,
            "name": "土地坡乡"
        },
        {
            "id": 724,
            "name": "武陵山乡"
        },
        {
            "id": 725,
            "name": "中峰乡"
        },
        {
            "id": 726,
            "name": "梓里乡"
        },
        {
            "id": 727,
            "name": "丛林乡"
        },
        {
            "id": 728,
            "name": "大木乡"
        },
        {
            "id": 729,
            "name": "惠民乡"
        },
        {
            "id": 730,
            "name": "酒店乡"
        },
        {
            "id": 731,
            "name": "聚宝乡"
        },
        {
            "id": 732,
            "name": "卷洞乡"
        },
        {
            "id": 733,
            "name": "两汇乡"
        },
        {
            "id": 734,
            "name": "罗云乡"
        },
        {
            "id": 735,
            "name": "明家乡"
        },
        {
            "id": 736,
            "name": "仁义乡"
        },
        {
            "id": 737,
            "name": "山窝乡"
        },
        {
            "id": 738,
            "name": "石和乡"
        },
        {
            "id": 739,
            "name": "石龙乡"
        },
        {
            "id": 740,
            "name": "太和乡"
        },
        {
            "id": 741,
            "name": "天台乡"
        },
        {
            "id": 742,
            "name": "同乐乡"
        },
        {
            "id": 743,
            "name": "新村乡"
        }],
        "id": 744,
        "name": "涪陵区"
    },
    {
        "child": [{
            "id": 745,
            "name": "县城内"
        },
        {
            "id": 746,
            "name": "梁山镇"
        },
        {
            "id": 747,
            "name": "柏家镇"
        },
        {
            "id": 748,
            "name": "碧山镇"
        },
        {
            "id": 749,
            "name": "大观镇"
        },
        {
            "id": 750,
            "name": "福禄镇"
        },
        {
            "id": 751,
            "name": "合兴镇"
        },
        {
            "id": 752,
            "name": "和林镇"
        },
        {
            "id": 753,
            "name": "虎城镇"
        },
        {
            "id": 754,
            "name": "回龙镇"
        },
        {
            "id": 755,
            "name": "金带镇"
        },
        {
            "id": 756,
            "name": "聚奎镇"
        },
        {
            "id": 757,
            "name": "礼让镇"
        },
        {
            "id": 758,
            "name": "龙门镇"
        },
        {
            "id": 759,
            "name": "明达镇"
        },
        {
            "id": 760,
            "name": "蟠龙镇"
        },
        {
            "id": 761,
            "name": "屏锦镇"
        },
        {
            "id": 762,
            "name": "仁贤镇"
        },
        {
            "id": 763,
            "name": "石安镇"
        },
        {
            "id": 764,
            "name": "文化镇"
        },
        {
            "id": 765,
            "name": "新盛镇"
        },
        {
            "id": 766,
            "name": "荫平镇"
        },
        {
            "id": 767,
            "name": "袁驿镇"
        },
        {
            "id": 768,
            "name": "云龙镇"
        },
        {
            "id": 769,
            "name": "竹山镇"
        },
        {
            "id": 770,
            "name": "安胜乡"
        },
        {
            "id": 771,
            "name": "铁门乡"
        },
        {
            "id": 772,
            "name": "紫照乡"
        },
        {
            "id": 773,
            "name": "曲水乡"
        },
        {
            "id": 774,
            "name": "龙胜乡"
        },
        {
            "id": 775,
            "name": "城北乡"
        },
        {
            "id": 776,
            "name": "城东乡"
        },
        {
            "id": 777,
            "name": "复平乡"
        }],
        "id": 778,
        "name": "梁平县"
    },
    {
        "child": [{
            "id": 779,
            "name": "城区"
        },
        {
            "id": 780,
            "name": "头渡镇"
        },
        {
            "id": 781,
            "name": "兴隆镇"
        },
        {
            "id": 782,
            "name": "冷水关乡"
        },
        {
            "id": 783,
            "name": "德隆乡"
        },
        {
            "id": 784,
            "name": "峰岩乡"
        },
        {
            "id": 785,
            "name": "福寿乡"
        },
        {
            "id": 786,
            "name": "古花乡"
        },
        {
            "id": 787,
            "name": "河图乡"
        },
        {
            "id": 788,
            "name": "民主乡"
        },
        {
            "id": 789,
            "name": "木凉乡"
        },
        {
            "id": 790,
            "name": "乾丰乡"
        },
        {
            "id": 791,
            "name": "庆元乡"
        },
        {
            "id": 792,
            "name": "石莲乡"
        },
        {
            "id": 793,
            "name": "石溪乡"
        },
        {
            "id": 794,
            "name": "铁村乡"
        },
        {
            "id": 795,
            "name": "土溪乡"
        },
        {
            "id": 796,
            "name": "鱼泉乡"
        },
        {
            "id": 797,
            "name": "中桥乡"
        },
        {
            "id": 798,
            "name": "太平场镇"
        },
        {
            "id": 799,
            "name": "大观镇"
        },
        {
            "id": 800,
            "name": "大有镇"
        },
        {
            "id": 801,
            "name": "合溪镇"
        },
        {
            "id": 802,
            "name": "金山镇"
        },
        {
            "id": 803,
            "name": "鸣玉镇"
        },
        {
            "id": 804,
            "name": "南平镇"
        },
        {
            "id": 805,
            "name": "三泉镇"
        },
        {
            "id": 806,
            "name": "神童镇"
        },
        {
            "id": 807,
            "name": "石墙镇"
        },
        {
            "id": 808,
            "name": "水江镇"
        }],
        "id": 809,
        "name": "南川区"
    },
    {
        "child": [{
            "id": 810,
            "name": "县城内"
        },
        {
            "id": 811,
            "name": "柏梓镇"
        },
        {
            "id": 812,
            "name": "宝龙镇"
        },
        {
            "id": 813,
            "name": "崇龛镇"
        },
        {
            "id": 814,
            "name": "古溪镇"
        },
        {
            "id": 815,
            "name": "龙形镇"
        },
        {
            "id": 816,
            "name": "米心镇"
        },
        {
            "id": 817,
            "name": "群力镇"
        },
        {
            "id": 818,
            "name": "上和镇"
        },
        {
            "id": 819,
            "name": "双江镇"
        },
        {
            "id": 820,
            "name": "太安镇"
        },
        {
            "id": 821,
            "name": "塘坝镇"
        },
        {
            "id": 822,
            "name": "卧佛镇"
        },
        {
            "id": 823,
            "name": "五桂镇"
        },
        {
            "id": 824,
            "name": "小渡镇"
        },
        {
            "id": 825,
            "name": "新胜镇"
        },
        {
            "id": 826,
            "name": "玉溪镇"
        },
        {
            "id": 827,
            "name": "别口乡"
        },
        {
            "id": 828,
            "name": "田家乡"
        },
        {
            "id": 829,
            "name": "寿桥乡"
        }],
        "id": 830,
        "name": "潼南县"
    },
    {
        "child": [{
            "id": 831,
            "name": "城区"
        },
        {
            "id": 832,
            "name": "正阳镇"
        },
        {
            "id": 833,
            "name": "舟白镇"
        },
        {
            "id": 834,
            "name": "阿蓬江镇"
        },
        {
            "id": 835,
            "name": "小南海镇"
        },
        {
            "id": 836,
            "name": "鹅池镇"
        },
        {
            "id": 837,
            "name": "冯家镇"
        },
        {
            "id": 838,
            "name": "黑溪镇"
        },
        {
            "id": 839,
            "name": "黄溪镇"
        },
        {
            "id": 840,
            "name": "金溪镇"
        },
        {
            "id": 841,
            "name": "黎水镇"
        },
        {
            "id": 842,
            "name": "邻鄂镇"
        },
        {
            "id": 843,
            "name": "马喇镇"
        },
        {
            "id": 844,
            "name": "石会镇"
        },
        {
            "id": 845,
            "name": "石家镇"
        },
        {
            "id": 846,
            "name": "濯水镇"
        },
        {
            "id": 847,
            "name": "白石乡"
        },
        {
            "id": 848,
            "name": "白土乡"
        },
        {
            "id": 849,
            "name": "金洞乡"
        },
        {
            "id": 850,
            "name": "蓬东乡"
        },
        {
            "id": 851,
            "name": "沙坝乡"
        },
        {
            "id": 852,
            "name": "杉岭乡"
        },
        {
            "id": 853,
            "name": "水市乡"
        },
        {
            "id": 854,
            "name": "水田乡"
        },
        {
            "id": 855,
            "name": "太极乡"
        },
        {
            "id": 856,
            "name": "五里乡"
        },
        {
            "id": 857,
            "name": "新华乡"
        },
        {
            "id": 858,
            "name": "中塘乡"
        }],
        "id": 859,
        "name": "黔江区"
    },
    {
        "child": [{
            "id": 860,
            "name": "白桥镇"
        },
        {
            "id": 861,
            "name": "大德镇"
        },
        {
            "id": 862,
            "name": "金峰镇"
        },
        {
            "id": 863,
            "name": "谭家镇"
        },
        {
            "id": 864,
            "name": "天和镇"
        },
        {
            "id": 865,
            "name": "白泉乡"
        },
        {
            "id": 866,
            "name": "县城内"
        },
        {
            "id": 867,
            "name": "九龙山镇"
        },
        {
            "id": 868,
            "name": "大进镇"
        },
        {
            "id": 869,
            "name": "敦好镇"
        },
        {
            "id": 870,
            "name": "高桥镇"
        },
        {
            "id": 871,
            "name": "郭家镇"
        },
        {
            "id": 872,
            "name": "和谦镇"
        },
        {
            "id": 873,
            "name": "河堰镇"
        },
        {
            "id": 874,
            "name": "厚坝镇"
        },
        {
            "id": 875,
            "name": "临江镇"
        },
        {
            "id": 876,
            "name": "南门镇"
        },
        {
            "id": 877,
            "name": "南雅镇"
        },
        {
            "id": 878,
            "name": "渠口镇"
        },
        {
            "id": 879,
            "name": "铁桥镇"
        },
        {
            "id": 880,
            "name": "岳溪镇"
        },
        {
            "id": 881,
            "name": "温泉镇"
        },
        {
            "id": 882,
            "name": "义和镇"
        },
        {
            "id": 883,
            "name": "长沙镇"
        },
        {
            "id": 884,
            "name": "赵家镇"
        },
        {
            "id": 885,
            "name": "镇安镇"
        },
        {
            "id": 886,
            "name": "中和镇"
        },
        {
            "id": 887,
            "name": "竹溪镇"
        },
        {
            "id": 888,
            "name": "三汇口乡"
        },
        {
            "id": 889,
            "name": "白桥乡"
        },
        {
            "id": 890,
            "name": "大德乡"
        },
        {
            "id": 891,
            "name": "关面乡"
        },
        {
            "id": 892,
            "name": "金峰乡"
        },
        {
            "id": 893,
            "name": "麻柳乡"
        },
        {
            "id": 894,
            "name": "满月乡"
        },
        {
            "id": 895,
            "name": "谭家乡"
        },
        {
            "id": 896,
            "name": "天和乡"
        },
        {
            "id": 897,
            "name": "巫山镇"
        },
        {
            "id": 898,
            "name": "五通乡"
        },
        {
            "id": 899,
            "name": "紫水乡"
        }],
        "id": 900,
        "name": "开县"
    },
    {
        "child": [{
            "id": 901,
            "name": "县城内"
        },
        {
            "id": 902,
            "name": "云阳镇"
        },
        {
            "id": 903,
            "name": "巴阳镇"
        },
        {
            "id": 904,
            "name": "凤鸣镇"
        },
        {
            "id": 905,
            "name": "高阳镇"
        },
        {
            "id": 906,
            "name": "故陵镇"
        },
        {
            "id": 907,
            "name": "红狮镇"
        },
        {
            "id": 908,
            "name": "黄石镇"
        },
        {
            "id": 909,
            "name": "江口镇"
        },
        {
            "id": 910,
            "name": "龙角镇"
        },
        {
            "id": 911,
            "name": "路阳镇"
        },
        {
            "id": 912,
            "name": "南溪镇"
        },
        {
            "id": 913,
            "name": "农坝镇"
        },
        {
            "id": 914,
            "name": "盘龙镇"
        },
        {
            "id": 915,
            "name": "平安镇"
        },
        {
            "id": 916,
            "name": "渠马镇"
        },
        {
            "id": 917,
            "name": "人和镇"
        },
        {
            "id": 918,
            "name": "桑坪镇"
        },
        {
            "id": 919,
            "name": "沙市镇"
        },
        {
            "id": 920,
            "name": "双土镇"
        },
        {
            "id": 921,
            "name": "鱼泉镇"
        },
        {
            "id": 922,
            "name": "云安镇"
        },
        {
            "id": 923,
            "name": "洞鹿乡"
        },
        {
            "id": 924,
            "name": "后叶乡"
        },
        {
            "id": 925,
            "name": "龙洞乡"
        },
        {
            "id": 926,
            "name": "毛坝乡"
        },
        {
            "id": 927,
            "name": "泥溪乡"
        },
        {
            "id": 928,
            "name": "票草乡"
        },
        {
            "id": 929,
            "name": "普安乡"
        },
        {
            "id": 930,
            "name": "栖霞乡"
        },
        {
            "id": 931,
            "name": "清水乡"
        },
        {
            "id": 932,
            "name": "上坝乡"
        },
        {
            "id": 933,
            "name": "石门乡"
        },
        {
            "id": 934,
            "name": "双龙乡"
        },
        {
            "id": 935,
            "name": "水口乡"
        },
        {
            "id": 936,
            "name": "外郎乡"
        },
        {
            "id": 937,
            "name": "新津乡"
        },
        {
            "id": 938,
            "name": "堰坪乡"
        },
        {
            "id": 939,
            "name": "养鹿乡"
        },
        {
            "id": 940,
            "name": "耀灵乡"
        },
        {
            "id": 941,
            "name": "云硐乡"
        }],
        "id": 942,
        "name": "云阳县"
    },
    {
        "child": [{
            "id": 943,
            "name": "县城内"
        },
        {
            "id": 944,
            "name": "忠州镇"
        },
        {
            "id": 945,
            "name": "拔山镇"
        },
        {
            "id": 946,
            "name": "白石镇"
        },
        {
            "id": 947,
            "name": "东溪镇"
        },
        {
            "id": 948,
            "name": "复兴镇"
        },
        {
            "id": 949,
            "name": "官坝镇"
        },
        {
            "id": 950,
            "name": "花桥镇"
        },
        {
            "id": 951,
            "name": "黄金镇"
        },
        {
            "id": 952,
            "name": "金鸡镇"
        },
        {
            "id": 953,
            "name": "马灌镇"
        },
        {
            "id": 954,
            "name": "任家镇"
        },
        {
            "id": 955,
            "name": "汝溪镇"
        },
        {
            "id": 956,
            "name": "三汇镇"
        },
        {
            "id": 957,
            "name": "石宝镇"
        },
        {
            "id": 958,
            "name": "石黄镇"
        },
        {
            "id": 959,
            "name": "双桂镇"
        },
        {
            "id": 960,
            "name": "乌杨镇"
        },
        {
            "id": 961,
            "name": "新生镇"
        },
        {
            "id": 962,
            "name": "洋渡镇"
        },
        {
            "id": 963,
            "name": "野鹤镇"
        },
        {
            "id": 964,
            "name": "永丰镇"
        },
        {
            "id": 965,
            "name": "金声乡"
        },
        {
            "id": 966,
            "name": "磨子乡"
        },
        {
            "id": 967,
            "name": "善广乡"
        },
        {
            "id": 968,
            "name": "石子乡"
        },
        {
            "id": 969,
            "name": "涂井乡"
        },
        {
            "id": 970,
            "name": "兴峰乡"
        },
        {
            "id": 971,
            "name": "新立镇"
        }],
        "id": 972,
        "name": "忠县"
    },
    {
        "child": [{
            "id": 973,
            "name": "县城内"
        },
        {
            "id": 974,
            "name": "桂溪镇"
        },
        {
            "id": 975,
            "name": "澄溪镇"
        },
        {
            "id": 976,
            "name": "高安镇"
        },
        {
            "id": 977,
            "name": "高峰镇"
        },
        {
            "id": 978,
            "name": "鹤游镇"
        },
        {
            "id": 979,
            "name": "普顺镇"
        },
        {
            "id": 980,
            "name": "沙坪镇"
        },
        {
            "id": 981,
            "name": "太平镇"
        },
        {
            "id": 982,
            "name": "五洞镇"
        },
        {
            "id": 983,
            "name": "新民镇"
        },
        {
            "id": 984,
            "name": "砚台镇"
        },
        {
            "id": 985,
            "name": "永安镇"
        },
        {
            "id": 986,
            "name": "周嘉镇"
        },
        {
            "id": 987,
            "name": "白家乡"
        },
        {
            "id": 988,
            "name": "包家乡"
        },
        {
            "id": 989,
            "name": "曹回乡"
        },
        {
            "id": 990,
            "name": "大石乡"
        },
        {
            "id": 991,
            "name": "杠家乡"
        },
        {
            "id": 992,
            "name": "坪山镇"
        },
        {
            "id": 993,
            "name": "黄沙乡"
        },
        {
            "id": 994,
            "name": "裴兴乡"
        },
        {
            "id": 995,
            "name": "三溪乡"
        },
        {
            "id": 996,
            "name": "沙河乡"
        },
        {
            "id": 997,
            "name": "永平乡"
        },
        {
            "id": 998,
            "name": "长龙乡"
        }],
        "id": 999,
        "name": "垫江县"
    },
    {
        "child": [{
            "id": 1000,
            "name": "县城内"
        },
        {
            "id": 1001,
            "name": "葛城镇"
        },
        {
            "id": 1002,
            "name": "巴山镇"
        },
        {
            "id": 1003,
            "name": "高观镇"
        },
        {
            "id": 1004,
            "name": "庙坝镇"
        },
        {
            "id": 1005,
            "name": "明通镇"
        },
        {
            "id": 1006,
            "name": "坪坝镇"
        },
        {
            "id": 1007,
            "name": "修齐镇"
        },
        {
            "id": 1008,
            "name": "北屏乡"
        },
        {
            "id": 1009,
            "name": "东安乡"
        },
        {
            "id": 1010,
            "name": "高楠乡"
        },
        {
            "id": 1011,
            "name": "高燕乡"
        },
        {
            "id": 1012,
            "name": "河鱼乡"
        },
        {
            "id": 1013,
            "name": "厚坪乡"
        },
        {
            "id": 1014,
            "name": "鸡鸣乡"
        },
        {
            "id": 1015,
            "name": "岚天乡"
        },
        {
            "id": 1016,
            "name": "蓼子乡"
        },
        {
            "id": 1017,
            "name": "龙田乡"
        },
        {
            "id": 1018,
            "name": "明中乡"
        },
        {
            "id": 1019,
            "name": "双河乡"
        },
        {
            "id": 1020,
            "name": "咸宜乡"
        },
        {
            "id": 1021,
            "name": "沿河乡"
        },
        {
            "id": 1022,
            "name": "治平乡"
        },
        {
            "id": 1023,
            "name": "周溪乡"
        },
        {
            "id": 1024,
            "name": "左岚乡"
        }],
        "id": 1025,
        "name": "城口县"
    },
    {
        "child": [{
            "id": 1026,
            "name": "县城内"
        },
        {
            "id": 1027,
            "name": "仙女山镇"
        },
        {
            "id": 1028,
            "name": "巷口镇"
        },
        {
            "id": 1029,
            "name": "白马镇"
        },
        {
            "id": 1030,
            "name": "火炉镇"
        },
        {
            "id": 1031,
            "name": "江口镇"
        },
        {
            "id": 1032,
            "name": "平桥镇"
        },
        {
            "id": 1033,
            "name": "桐梓镇"
        },
        {
            "id": 1034,
            "name": "土坎镇"
        },
        {
            "id": 1035,
            "name": "鸭江镇"
        },
        {
            "id": 1036,
            "name": "羊角镇"
        },
        {
            "id": 1037,
            "name": "长坝镇"
        },
        {
            "id": 1038,
            "name": "白云乡"
        },
        {
            "id": 1039,
            "name": "沧沟乡"
        },
        {
            "id": 1040,
            "name": "凤来乡"
        },
        {
            "id": 1041,
            "name": "浩口乡"
        },
        {
            "id": 1042,
            "name": "和顺乡"
        },
        {
            "id": 1043,
            "name": "后坪乡"
        },
        {
            "id": 1044,
            "name": "黄莺乡"
        },
        {
            "id": 1045,
            "name": "接龙乡"
        },
        {
            "id": 1046,
            "name": "庙垭乡"
        },
        {
            "id": 1047,
            "name": "石桥乡"
        },
        {
            "id": 1048,
            "name": "双河乡"
        },
        {
            "id": 1049,
            "name": "铁矿乡"
        },
        {
            "id": 1050,
            "name": "土地乡"
        },
        {
            "id": 1051,
            "name": "文复乡"
        },
        {
            "id": 1052,
            "name": "赵家乡"
        }],
        "id": 1053,
        "name": "武隆县"
    },
    {
        "child": [{
            "id": 1054,
            "name": "县城内"
        },
        {
            "id": 1055,
            "name": "南天湖镇"
        },
        {
            "id": 1056,
            "name": "许明寺镇"
        },
        {
            "id": 1057,
            "name": "包鸾镇"
        },
        {
            "id": 1058,
            "name": "董家镇"
        },
        {
            "id": 1059,
            "name": "高家镇"
        },
        {
            "id": 1060,
            "name": "虎威镇"
        },
        {
            "id": 1061,
            "name": "江池镇"
        },
        {
            "id": 1062,
            "name": "龙河镇"
        },
        {
            "id": 1063,
            "name": "名山镇"
        },
        {
            "id": 1064,
            "name": "三元镇"
        },
        {
            "id": 1065,
            "name": "社坛镇"
        },
        {
            "id": 1066,
            "name": "十直镇"
        },
        {
            "id": 1067,
            "name": "树人镇"
        },
        {
            "id": 1068,
            "name": "双路镇"
        },
        {
            "id": 1069,
            "name": "武平镇"
        },
        {
            "id": 1070,
            "name": "兴义镇"
        },
        {
            "id": 1071,
            "name": "湛普镇"
        },
        {
            "id": 1072,
            "name": "镇江镇"
        },
        {
            "id": 1073,
            "name": "太平坝乡"
        },
        {
            "id": 1074,
            "name": "双龙场乡"
        },
        {
            "id": 1075,
            "name": "保合乡"
        },
        {
            "id": 1076,
            "name": "崇兴乡"
        },
        {
            "id": 1077,
            "name": "都督乡"
        },
        {
            "id": 1078,
            "name": "暨龙乡"
        },
        {
            "id": 1079,
            "name": "栗子乡"
        },
        {
            "id": 1080,
            "name": "龙孔乡"
        },
        {
            "id": 1081,
            "name": "青龙乡"
        },
        {
            "id": 1082,
            "name": "仁沙乡"
        },
        {
            "id": 1083,
            "name": "三坝乡"
        },
        {
            "id": 1084,
            "name": "三建乡"
        }],
        "id": 1085,
        "name": "丰都县"
    },
    {
        "child": [{
            "id": 1086,
            "name": "永乐镇"
        },
        {
            "id": 1087,
            "name": "县城内"
        },
        {
            "id": 1088,
            "name": "永安镇"
        },
        {
            "id": 1089,
            "name": "白帝镇"
        },
        {
            "id": 1090,
            "name": "草堂镇"
        },
        {
            "id": 1091,
            "name": "大树镇"
        },
        {
            "id": 1092,
            "name": "汾河镇"
        },
        {
            "id": 1093,
            "name": "公平镇"
        },
        {
            "id": 1094,
            "name": "甲高镇"
        },
        {
            "id": 1095,
            "name": "康乐镇"
        },
        {
            "id": 1096,
            "name": "青龙镇"
        },
        {
            "id": 1097,
            "name": "吐祥镇"
        },
        {
            "id": 1098,
            "name": "新民镇"
        },
        {
            "id": 1099,
            "name": "兴隆镇"
        },
        {
            "id": 1100,
            "name": "羊市镇"
        },
        {
            "id": 1101,
            "name": "朱衣镇"
        },
        {
            "id": 1102,
            "name": "竹园镇"
        },
        {
            "id": 1103,
            "name": "安坪乡"
        },
        {
            "id": 1104,
            "name": "冯坪乡"
        },
        {
            "id": 1105,
            "name": "鹤峰乡"
        },
        {
            "id": 1106,
            "name": "红土乡"
        },
        {
            "id": 1107,
            "name": "康坪乡"
        },
        {
            "id": 1108,
            "name": "龙桥乡"
        },
        {
            "id": 1109,
            "name": "平安乡"
        },
        {
            "id": 1110,
            "name": "石岗乡"
        },
        {
            "id": 1111,
            "name": "太和乡"
        },
        {
            "id": 1112,
            "name": "五马乡"
        },
        {
            "id": 1113,
            "name": "新政乡"
        },
        {
            "id": 1114,
            "name": "岩湾乡"
        },
        {
            "id": 1115,
            "name": "云雾乡"
        },
        {
            "id": 1116,
            "name": "长安乡"
        }],
        "id": 1117,
        "name": "奉节县"
    },
    {
        "child": [{
            "id": 1118,
            "name": "县城内"
        },
        {
            "id": 1119,
            "name": "城厢镇"
        },
        {
            "id": 1120,
            "name": "凤凰镇"
        },
        {
            "id": 1121,
            "name": "古路镇"
        },
        {
            "id": 1122,
            "name": "尖山镇"
        },
        {
            "id": 1123,
            "name": "宁厂镇"
        },
        {
            "id": 1124,
            "name": "上磺镇"
        },
        {
            "id": 1125,
            "name": "文峰镇"
        },
        {
            "id": 1126,
            "name": "下堡镇"
        },
        {
            "id": 1127,
            "name": "徐家镇"
        },
        {
            "id": 1128,
            "name": "朝阳洞乡"
        },
        {
            "id": 1129,
            "name": "大河乡"
        },
        {
            "id": 1130,
            "name": "峰灵乡"
        },
        {
            "id": 1131,
            "name": "花台乡"
        },
        {
            "id": 1132,
            "name": "兰英乡"
        },
        {
            "id": 1133,
            "name": "菱角乡"
        },
        {
            "id": 1134,
            "name": "蒲莲乡"
        },
        {
            "id": 1135,
            "name": "胜利乡"
        },
        {
            "id": 1136,
            "name": "双阳乡"
        },
        {
            "id": 1137,
            "name": "塘坊乡"
        },
        {
            "id": 1138,
            "name": "天星乡"
        },
        {
            "id": 1139,
            "name": "天元乡"
        },
        {
            "id": 1140,
            "name": "田坝乡"
        },
        {
            "id": 1141,
            "name": "通城乡"
        },
        {
            "id": 1142,
            "name": "土城乡"
        },
        {
            "id": 1143,
            "name": "乌龙乡"
        },
        {
            "id": 1144,
            "name": "鱼鳞乡"
        },
        {
            "id": 1145,
            "name": "长桂乡"
        },
        {
            "id": 1146,
            "name": "中岗乡"
        },
        {
            "id": 1147,
            "name": "中梁乡"
        }],
        "id": 1148,
        "name": "巫溪县"
    },
    {
        "child": [{
            "id": 1149,
            "name": "县城内"
        },
        {
            "id": 1150,
            "name": "巫峡镇"
        },
        {
            "id": 1151,
            "name": "大昌镇"
        },
        {
            "id": 1152,
            "name": "福田镇"
        },
        {
            "id": 1153,
            "name": "官渡镇"
        },
        {
            "id": 1154,
            "name": "官阳镇"
        },
        {
            "id": 1155,
            "name": "龙溪镇"
        },
        {
            "id": 1156,
            "name": "骡坪镇"
        },
        {
            "id": 1157,
            "name": "庙堂乡"
        },
        {
            "id": 1158,
            "name": "庙宇镇"
        },
        {
            "id": 1159,
            "name": "双龙镇"
        },
        {
            "id": 1160,
            "name": "铜鼓镇"
        },
        {
            "id": 1161,
            "name": "抱龙镇"
        },
        {
            "id": 1162,
            "name": "大溪乡"
        },
        {
            "id": 1163,
            "name": "当阳乡"
        },
        {
            "id": 1164,
            "name": "邓家乡"
        },
        {
            "id": 1165,
            "name": "笃坪乡"
        },
        {
            "id": 1166,
            "name": "红椿乡"
        },
        {
            "id": 1167,
            "name": "建平乡"
        },
        {
            "id": 1168,
            "name": "金坪乡"
        },
        {
            "id": 1169,
            "name": "两坪乡"
        },
        {
            "id": 1170,
            "name": "龙井乡"
        },
        {
            "id": 1171,
            "name": "培石乡"
        },
        {
            "id": 1172,
            "name": "平河乡"
        },
        {
            "id": 1173,
            "name": "曲尺乡"
        },
        {
            "id": 1174,
            "name": "三溪乡"
        },
        {
            "id": 1175,
            "name": "竹贤乡"
        }],
        "id": 1176,
        "name": "巫山县"
    },
    {
        "child": [{
            "id": 1177,
            "name": "王家乡"
        },
        {
            "id": 1178,
            "name": "洗新乡"
        },
        {
            "id": 1179,
            "name": "新乐乡"
        },
        {
            "id": 1180,
            "name": "中益乡"
        },
        {
            "id": 1181,
            "name": "县城内"
        },
        {
            "id": 1182,
            "name": "南宾镇"
        },
        {
            "id": 1183,
            "name": "黄水镇"
        },
        {
            "id": 1184,
            "name": "临溪镇"
        },
        {
            "id": 1185,
            "name": "龙沙镇"
        },
        {
            "id": 1186,
            "name": "马武镇"
        },
        {
            "id": 1187,
            "name": "沙子镇"
        },
        {
            "id": 1188,
            "name": "王场镇"
        },
        {
            "id": 1189,
            "name": "西沱镇"
        },
        {
            "id": 1190,
            "name": "下路镇"
        },
        {
            "id": 1191,
            "name": "沿溪镇"
        },
        {
            "id": 1192,
            "name": "渔池镇"
        },
        {
            "id": 1193,
            "name": "悦崃镇"
        },
        {
            "id": 1194,
            "name": "大歇乡"
        },
        {
            "id": 1195,
            "name": "枫木乡"
        },
        {
            "id": 1196,
            "name": "河嘴乡"
        },
        {
            "id": 1197,
            "name": "黄鹤乡"
        },
        {
            "id": 1198,
            "name": "金铃乡"
        },
        {
            "id": 1199,
            "name": "金竹乡"
        },
        {
            "id": 1200,
            "name": "冷水乡"
        },
        {
            "id": 1201,
            "name": "黎场乡"
        },
        {
            "id": 1202,
            "name": "六塘乡"
        },
        {
            "id": 1203,
            "name": "龙潭乡"
        },
        {
            "id": 1204,
            "name": "桥头乡"
        },
        {
            "id": 1205,
            "name": "三河乡"
        },
        {
            "id": 1206,
            "name": "三益乡"
        },
        {
            "id": 1207,
            "name": "石家乡"
        },
        {
            "id": 1208,
            "name": "万朝乡"
        }],
        "id": 1209,
        "name": "石柱县"
    },
    {
        "child": [{
            "id": 1210,
            "name": "保家镇"
        },
        {
            "id": 1211,
            "name": "高谷镇"
        },
        {
            "id": 1212,
            "name": "黄家镇"
        },
        {
            "id": 1213,
            "name": "连湖镇"
        },
        {
            "id": 1214,
            "name": "龙射镇"
        },
        {
            "id": 1215,
            "name": "鹿角镇"
        },
        {
            "id": 1216,
            "name": "普子镇"
        },
        {
            "id": 1217,
            "name": "桑柘镇"
        },
        {
            "id": 1218,
            "name": "万足镇"
        },
        {
            "id": 1219,
            "name": "郁山镇"
        },
        {
            "id": 1220,
            "name": "梅子垭乡"
        },
        {
            "id": 1221,
            "name": "鞍子乡"
        },
        {
            "id": 1222,
            "name": "大垭乡"
        },
        {
            "id": 1223,
            "name": "棣棠乡"
        },
        {
            "id": 1224,
            "name": "靛水乡"
        },
        {
            "id": 1225,
            "name": "朗溪乡"
        },
        {
            "id": 1226,
            "name": "联合乡"
        },
        {
            "id": 1227,
            "name": "龙塘乡"
        },
        {
            "id": 1228,
            "name": "龙溪乡"
        },
        {
            "id": 1229,
            "name": "芦塘乡"
        },
        {
            "id": 1230,
            "name": "鹿鸣乡"
        },
        {
            "id": 1231,
            "name": "平安乡"
        },
        {
            "id": 1232,
            "name": "迁乔乡"
        },
        {
            "id": 1233,
            "name": "乔梓乡"
        },
        {
            "id": 1234,
            "name": "润溪乡"
        },
        {
            "id": 1235,
            "name": "三义乡"
        },
        {
            "id": 1236,
            "name": "善感乡"
        },
        {
            "id": 1237,
            "name": "县城内"
        },
        {
            "id": 1238,
            "name": "石柳乡"
        },
        {
            "id": 1239,
            "name": "石盘乡"
        },
        {
            "id": 1240,
            "name": "双龙乡"
        },
        {
            "id": 1241,
            "name": "太原乡"
        },
        {
            "id": 1242,
            "name": "桐楼乡"
        },
        {
            "id": 1243,
            "name": "小厂乡"
        },
        {
            "id": 1244,
            "name": "新田乡"
        },
        {
            "id": 1245,
            "name": "岩东乡"
        },
        {
            "id": 1246,
            "name": "长滩乡"
        },
        {
            "id": 1247,
            "name": "诸佛乡"
        },
        {
            "id": 1248,
            "name": "走马乡"
        }],
        "id": 1249,
        "name": "彭水县"
    },
    {
        "child": [{
            "id": 1250,
            "name": "县城内"
        },
        {
            "id": 1251,
            "name": "钟多镇"
        },
        {
            "id": 1252,
            "name": "苍岭镇"
        },
        {
            "id": 1253,
            "name": "车田乡"
        },
        {
            "id": 1254,
            "name": "大溪镇"
        },
        {
            "id": 1255,
            "name": "丁市镇"
        },
        {
            "id": 1256,
            "name": "泔溪镇"
        },
        {
            "id": 1257,
            "name": "龚滩镇"
        },
        {
            "id": 1258,
            "name": "黑水镇"
        },
        {
            "id": 1259,
            "name": "后溪镇"
        },
        {
            "id": 1260,
            "name": "李溪镇"
        },
        {
            "id": 1261,
            "name": "龙潭镇"
        },
        {
            "id": 1262,
            "name": "麻旺镇"
        },
        {
            "id": 1263,
            "name": "小河镇"
        },
        {
            "id": 1264,
            "name": "兴隆镇"
        },
        {
            "id": 1265,
            "name": "酉酬镇"
        },
        {
            "id": 1266,
            "name": "南腰界乡"
        },
        {
            "id": 1267,
            "name": "后坪坝乡"
        },
        {
            "id": 1268,
            "name": "板溪乡"
        },
        {
            "id": 1269,
            "name": "官清乡"
        },
        {
            "id": 1270,
            "name": "花田乡"
        },
        {
            "id": 1271,
            "name": "江丰乡"
        },
        {
            "id": 1272,
            "name": "可大乡"
        },
        {
            "id": 1273,
            "name": "浪坪乡"
        },
        {
            "id": 1274,
            "name": "两罾乡"
        },
        {
            "id": 1275,
            "name": "毛坝乡"
        },
        {
            "id": 1276,
            "name": "庙溪乡"
        },
        {
            "id": 1277,
            "name": "木叶乡"
        },
        {
            "id": 1278,
            "name": "楠木乡"
        },
        {
            "id": 1279,
            "name": "偏柏乡"
        },
        {
            "id": 1280,
            "name": "清泉乡"
        },
        {
            "id": 1281,
            "name": "双泉乡"
        },
        {
            "id": 1282,
            "name": "天馆乡"
        },
        {
            "id": 1283,
            "name": "铜鼓乡"
        },
        {
            "id": 1284,
            "name": "涂市乡"
        },
        {
            "id": 1285,
            "name": "万木乡"
        },
        {
            "id": 1286,
            "name": "五福乡"
        },
        {
            "id": 1287,
            "name": "宜居乡"
        },
        {
            "id": 1288,
            "name": "腴地乡"
        },
        {
            "id": 1289,
            "name": "板桥乡"
        }],
        "id": 1290,
        "name": "酉阳县"
    },
    {
        "child": [{
            "id": 1291,
            "name": "县城内"
        },
        {
            "id": 1292,
            "name": "清溪场镇"
        },
        {
            "id": 1293,
            "name": "中和镇"
        },
        {
            "id": 1294,
            "name": "隘口镇"
        },
        {
            "id": 1295,
            "name": "峨溶镇"
        },
        {
            "id": 1296,
            "name": "官庄镇"
        },
        {
            "id": 1297,
            "name": "洪安镇"
        },
        {
            "id": 1298,
            "name": "兰桥镇"
        },
        {
            "id": 1299,
            "name": "龙池镇"
        },
        {
            "id": 1300,
            "name": "梅江镇"
        },
        {
            "id": 1301,
            "name": "平凯镇"
        },
        {
            "id": 1302,
            "name": "溶溪镇"
        },
        {
            "id": 1303,
            "name": "石堤镇"
        },
        {
            "id": 1304,
            "name": "石耶镇"
        },
        {
            "id": 1305,
            "name": "雅江镇"
        },
        {
            "id": 1306,
            "name": "巴家乡"
        },
        {
            "id": 1307,
            "name": "保安乡"
        },
        {
            "id": 1308,
            "name": "岑溪乡"
        },
        {
            "id": 1309,
            "name": "大溪乡"
        },
        {
            "id": 1310,
            "name": "干川乡"
        },
        {
            "id": 1311,
            "name": "膏田乡"
        },
        {
            "id": 1312,
            "name": "官舟乡"
        },
        {
            "id": 1313,
            "name": "海洋乡"
        },
        {
            "id": 1314,
            "name": "里仁乡"
        },
        {
            "id": 1315,
            "name": "妙泉乡"
        },
        {
            "id": 1316,
            "name": "平马乡"
        },
        {
            "id": 1317,
            "name": "宋农乡"
        },
        {
            "id": 1318,
            "name": "溪口乡"
        },
        {
            "id": 1319,
            "name": "孝溪乡"
        },
        {
            "id": 1320,
            "name": "涌洞乡"
        },
        {
            "id": 1321,
            "name": "中平乡"
        },
        {
            "id": 1322,
            "name": "钟灵乡"
        }],
        "id": 1323,
        "name": "秀山县"
    }]
},
{
    "id": 1324,
    "name": "河北",
    "child": [{
        "child": [{
            "id": 1325,
            "name": "路北区"
        },
        {
            "id": 1326,
            "name": "路南区"
        },
        {
            "id": 1327,
            "name": "迁安市"
        },
        {
            "id": 1328,
            "name": "丰润区"
        },
        {
            "id": 1329,
            "name": "古冶区"
        },
        {
            "id": 1330,
            "name": "开平区"
        },
        {
            "id": 1331,
            "name": "遵化市"
        },
        {
            "id": 1332,
            "name": "丰南区"
        },
        {
            "id": 1333,
            "name": "迁西县"
        },
        {
            "id": 1334,
            "name": "滦南县"
        },
        {
            "id": 1335,
            "name": "玉田县"
        },
        {
            "id": 1336,
            "name": "曹妃甸区"
        },
        {
            "id": 1337,
            "name": "乐亭县"
        },
        {
            "id": 1338,
            "name": "滦县"
        }],
        "id": 1339,
        "name": "唐山市"
    },
    {
        "child": [{
            "id": 1340,
            "name": "沧县"
        },
        {
            "id": 1341,
            "name": "泊头市"
        },
        {
            "id": 1342,
            "name": "河间市"
        },
        {
            "id": 1343,
            "name": "献县"
        },
        {
            "id": 1344,
            "name": "肃宁县"
        },
        {
            "id": 1345,
            "name": "青县"
        },
        {
            "id": 1346,
            "name": "东光县"
        },
        {
            "id": 1347,
            "name": "吴桥县"
        },
        {
            "id": 1348,
            "name": "南皮县"
        },
        {
            "id": 1349,
            "name": "盐山县"
        },
        {
            "id": 1350,
            "name": "海兴县"
        },
        {
            "id": 1351,
            "name": "孟村县"
        },
        {
            "id": 1352,
            "name": "运河区"
        },
        {
            "id": 1353,
            "name": "新华区"
        },
        {
            "id": 1354,
            "name": "任丘市"
        },
        {
            "id": 1355,
            "name": "黄骅市"
        }],
        "id": 1356,
        "name": "沧州市"
    },
    {
        "child": [{
            "id": 1357,
            "name": "三河市"
        },
        {
            "id": 1358,
            "name": "广阳区"
        },
        {
            "id": 1359,
            "name": "开发区"
        },
        {
            "id": 1360,
            "name": "固安县"
        },
        {
            "id": 1361,
            "name": "安次区"
        },
        {
            "id": 1362,
            "name": "永清县"
        },
        {
            "id": 1363,
            "name": "香河县"
        },
        {
            "id": 1364,
            "name": "大城县"
        },
        {
            "id": 1365,
            "name": "文安县"
        },
        {
            "id": 1366,
            "name": "大厂县"
        },
        {
            "id": 1367,
            "name": "霸州市"
        }],
        "id": 1368,
        "name": "廊坊市"
    },
    {
        "child": [{
            "id": 1369,
            "name": "冀州市"
        },
        {
            "id": 1370,
            "name": "深州市"
        },
        {
            "id": 1371,
            "name": "饶阳县"
        },
        {
            "id": 1372,
            "name": "枣强县"
        },
        {
            "id": 1373,
            "name": "桃城区"
        },
        {
            "id": 1374,
            "name": "故城县"
        },
        {
            "id": 1375,
            "name": "阜城县"
        },
        {
            "id": 1376,
            "name": "安平县"
        },
        {
            "id": 1377,
            "name": "武邑县"
        },
        {
            "id": 1378,
            "name": "景县"
        },
        {
            "id": 1379,
            "name": "武强县"
        }],
        "id": 1380,
        "name": "衡水市"
    },
    {
        "child": [{
            "id": 1381,
            "name": "藁城市"
        },
        {
            "id": 1382,
            "name": "鹿泉市"
        },
        {
            "id": 1383,
            "name": "正定县"
        },
        {
            "id": 1384,
            "name": "新华区"
        },
        {
            "id": 1385,
            "name": "桥西区"
        },
        {
            "id": 1386,
            "name": "桥东区"
        },
        {
            "id": 1387,
            "name": "裕华区"
        },
        {
            "id": 1388,
            "name": "长安区"
        },
        {
            "id": 1389,
            "name": "辛集市"
        },
        {
            "id": 1390,
            "name": "晋州市"
        },
        {
            "id": 1391,
            "name": "新乐市"
        },
        {
            "id": 1392,
            "name": "平山县"
        },
        {
            "id": 1393,
            "name": "井陉矿区"
        },
        {
            "id": 1394,
            "name": "井陉县"
        },
        {
            "id": 1395,
            "name": "栾城县"
        },
        {
            "id": 1396,
            "name": "行唐县"
        },
        {
            "id": 1397,
            "name": "灵寿县"
        },
        {
            "id": 1398,
            "name": "高邑县"
        },
        {
            "id": 1399,
            "name": "赵县"
        },
        {
            "id": 1400,
            "name": "赞皇县"
        },
        {
            "id": 1401,
            "name": "深泽县"
        },
        {
            "id": 1402,
            "name": "无极县"
        },
        {
            "id": 1403,
            "name": "元氏县"
        }],
        "id": 1404,
        "name": "石家庄市"
    },
    {
        "child": [{
            "id": 1405,
            "name": "丛台区"
        },
        {
            "id": 1406,
            "name": "邯山区"
        },
        {
            "id": 1407,
            "name": "复兴区"
        },
        {
            "id": 1408,
            "name": "武安市"
        },
        {
            "id": 1409,
            "name": "临漳县"
        },
        {
            "id": 1410,
            "name": "永年县"
        },
        {
            "id": 1411,
            "name": "邯郸县"
        },
        {
            "id": 1412,
            "name": "峰峰矿区"
        },
        {
            "id": 1413,
            "name": "曲周县"
        },
        {
            "id": 1414,
            "name": "馆陶县"
        },
        {
            "id": 1415,
            "name": "魏县"
        },
        {
            "id": 1416,
            "name": "成安县"
        },
        {
            "id": 1417,
            "name": "大名县"
        },
        {
            "id": 1418,
            "name": "涉县"
        },
        {
            "id": 1419,
            "name": "鸡泽县"
        },
        {
            "id": 1420,
            "name": "邱县"
        },
        {
            "id": 1421,
            "name": "广平县"
        },
        {
            "id": 1422,
            "name": "肥乡县"
        },
        {
            "id": 1423,
            "name": "磁县"
        }],
        "id": 1424,
        "name": "邯郸市"
    },
    {
        "child": [{
            "id": 1425,
            "name": "宁晋县"
        },
        {
            "id": 1426,
            "name": "威县"
        },
        {
            "id": 1427,
            "name": "桥西区"
        },
        {
            "id": 1428,
            "name": "桥东区"
        },
        {
            "id": 1429,
            "name": "邢台县"
        },
        {
            "id": 1430,
            "name": "南宫市"
        },
        {
            "id": 1431,
            "name": "沙河市"
        },
        {
            "id": 1432,
            "name": "柏乡县"
        },
        {
            "id": 1433,
            "name": "任县"
        },
        {
            "id": 1434,
            "name": "清河县"
        },
        {
            "id": 1435,
            "name": "隆尧县"
        },
        {
            "id": 1436,
            "name": "临城县"
        },
        {
            "id": 1437,
            "name": "广宗县"
        },
        {
            "id": 1438,
            "name": "临西县"
        },
        {
            "id": 1439,
            "name": "内丘县"
        },
        {
            "id": 1440,
            "name": "平乡县"
        },
        {
            "id": 1441,
            "name": "巨鹿县"
        },
        {
            "id": 1442,
            "name": "新河县"
        },
        {
            "id": 1443,
            "name": "南和县"
        }],
        "id": 1444,
        "name": "邢台市"
    },
    {
        "child": [{
            "id": 1445,
            "name": "涿州市"
        },
        {
            "id": 1446,
            "name": "定州市"
        },
        {
            "id": 1447,
            "name": "徐水县"
        },
        {
            "id": 1448,
            "name": "高碑店市"
        },
        {
            "id": 1449,
            "name": "新市区"
        },
        {
            "id": 1450,
            "name": "北市区"
        },
        {
            "id": 1451,
            "name": "南市区"
        },
        {
            "id": 1452,
            "name": "安国市"
        },
        {
            "id": 1453,
            "name": "安新县"
        },
        {
            "id": 1454,
            "name": "满城县"
        },
        {
            "id": 1455,
            "name": "清苑县"
        },
        {
            "id": 1456,
            "name": "涞水县"
        },
        {
            "id": 1457,
            "name": "阜平县"
        },
        {
            "id": 1458,
            "name": "定兴县"
        },
        {
            "id": 1459,
            "name": "唐县"
        },
        {
            "id": 1460,
            "name": "高阳县"
        },
        {
            "id": 1461,
            "name": "容城县"
        },
        {
            "id": 1462,
            "name": "涞源县"
        },
        {
            "id": 1463,
            "name": "望都县"
        },
        {
            "id": 1464,
            "name": "易县"
        },
        {
            "id": 1465,
            "name": "曲阳县"
        },
        {
            "id": 1466,
            "name": "蠡县"
        },
        {
            "id": 1467,
            "name": "顺平县"
        },
        {
            "id": 1468,
            "name": "博野县"
        },
        {
            "id": 1469,
            "name": "雄县"
        }],
        "id": 1470,
        "name": "保定市"
    },
    {
        "child": [{
            "id": 1471,
            "name": "怀安县"
        },
        {
            "id": 1472,
            "name": "沽源县"
        },
        {
            "id": 1473,
            "name": "宣化区"
        },
        {
            "id": 1474,
            "name": "宣化县"
        },
        {
            "id": 1475,
            "name": "康保县"
        },
        {
            "id": 1476,
            "name": "张北县"
        },
        {
            "id": 1477,
            "name": "阳原县"
        },
        {
            "id": 1478,
            "name": "赤城县"
        },
        {
            "id": 1479,
            "name": "崇礼县"
        },
        {
            "id": 1480,
            "name": "尚义县"
        },
        {
            "id": 1481,
            "name": "蔚县"
        },
        {
            "id": 1482,
            "name": "涿鹿县"
        },
        {
            "id": 1483,
            "name": "万全县"
        },
        {
            "id": 1484,
            "name": "下花园区"
        },
        {
            "id": 1485,
            "name": "桥西区"
        },
        {
            "id": 1486,
            "name": "桥东区"
        },
        {
            "id": 1487,
            "name": "怀来县"
        }],
        "id": 1488,
        "name": "张家口市"
    },
    {
        "child": [{
            "id": 1489,
            "name": "双滦区"
        },
        {
            "id": 1490,
            "name": "鹰手营子矿区"
        },
        {
            "id": 1491,
            "name": "隆化县"
        },
        {
            "id": 1492,
            "name": "兴隆县"
        },
        {
            "id": 1493,
            "name": "平泉县"
        },
        {
            "id": 1494,
            "name": "滦平县"
        },
        {
            "id": 1495,
            "name": "丰宁县"
        },
        {
            "id": 1496,
            "name": "围场县"
        },
        {
            "id": 1497,
            "name": "宽城县"
        },
        {
            "id": 1498,
            "name": "双桥区"
        },
        {
            "id": 1499,
            "name": "承德县"
        }],
        "id": 1500,
        "name": "承德市"
    },
    {
        "child": [{
            "id": 1501,
            "name": "卢龙县"
        },
        {
            "id": 1502,
            "name": "青龙县"
        },
        {
            "id": 1503,
            "name": "昌黎县"
        },
        {
            "id": 1504,
            "name": "北戴河区"
        },
        {
            "id": 1505,
            "name": "海港区"
        },
        {
            "id": 1506,
            "name": "山海关区"
        },
        {
            "id": 1507,
            "name": "抚宁县"
        }],
        "id": 1508,
        "name": "秦皇岛市"
    }]
},
{
    "id": 1509,
    "name": "山西",
    "child": [{
        "child": [{
            "id": 1510,
            "name": "长治县"
        },
        {
            "id": 1511,
            "name": "潞城市"
        },
        {
            "id": 1512,
            "name": "郊区"
        },
        {
            "id": 1513,
            "name": "襄垣县"
        },
        {
            "id": 1514,
            "name": "屯留县"
        },
        {
            "id": 1515,
            "name": "平顺县"
        },
        {
            "id": 1516,
            "name": "黎城县"
        },
        {
            "id": 1517,
            "name": "壶关县"
        },
        {
            "id": 1518,
            "name": "长子县"
        },
        {
            "id": 1519,
            "name": "武乡县"
        },
        {
            "id": 1520,
            "name": "沁县"
        },
        {
            "id": 1521,
            "name": "沁源县"
        },
        {
            "id": 1522,
            "name": "城区"
        }],
        "id": 1523,
        "name": "长治市"
    },
    {
        "child": [{
            "id": 1524,
            "name": "小店区"
        },
        {
            "id": 1525,
            "name": "迎泽区"
        },
        {
            "id": 1526,
            "name": "晋源区"
        },
        {
            "id": 1527,
            "name": "万柏林区"
        },
        {
            "id": 1528,
            "name": "尖草坪区"
        },
        {
            "id": 1529,
            "name": "杏花岭区"
        },
        {
            "id": 1530,
            "name": "古交市"
        },
        {
            "id": 1531,
            "name": "阳曲县"
        },
        {
            "id": 1532,
            "name": "娄烦县"
        },
        {
            "id": 1533,
            "name": "清徐县"
        }],
        "id": 1534,
        "name": "太原市"
    },
    {
        "child": [{
            "id": 1535,
            "name": "大同县"
        },
        {
            "id": 1536,
            "name": "天镇县"
        },
        {
            "id": 1537,
            "name": "灵丘县"
        },
        {
            "id": 1538,
            "name": "阳高县"
        },
        {
            "id": 1539,
            "name": "左云县"
        },
        {
            "id": 1540,
            "name": "浑源县"
        },
        {
            "id": 1541,
            "name": "广灵县"
        },
        {
            "id": 1542,
            "name": "城区"
        },
        {
            "id": 1543,
            "name": "新荣区"
        },
        {
            "id": 1544,
            "name": "南郊区"
        },
        {
            "id": 1545,
            "name": "矿区"
        }],
        "id": 1546,
        "name": "大同市"
    },
    {
        "child": [{
            "id": 1547,
            "name": "盂县"
        },
        {
            "id": 1548,
            "name": "平定县"
        },
        {
            "id": 1549,
            "name": "郊区"
        },
        {
            "id": 1550,
            "name": "城区"
        },
        {
            "id": 1551,
            "name": "矿区"
        }],
        "id": 1552,
        "name": "阳泉市"
    },
    {
        "child": [{
            "id": 1553,
            "name": "城区"
        },
        {
            "id": 1554,
            "name": "高平市"
        },
        {
            "id": 1555,
            "name": "阳城县"
        },
        {
            "id": 1556,
            "name": "沁水县"
        },
        {
            "id": 1557,
            "name": "陵川县"
        },
        {
            "id": 1558,
            "name": "泽州县"
        }],
        "id": 1559,
        "name": "晋城市"
    },
    {
        "child": [{
            "id": 1560,
            "name": "平鲁区"
        },
        {
            "id": 1561,
            "name": "山阴县"
        },
        {
            "id": 1562,
            "name": "右玉县"
        },
        {
            "id": 1563,
            "name": "应县"
        },
        {
            "id": 1564,
            "name": "怀仁县"
        },
        {
            "id": 1565,
            "name": "朔城区"
        }],
        "id": 1566,
        "name": "朔州市"
    },
    {
        "child": [{
            "id": 1567,
            "name": "介休市"
        },
        {
            "id": 1568,
            "name": "昔阳县"
        },
        {
            "id": 1569,
            "name": "祁县"
        },
        {
            "id": 1570,
            "name": "左权县"
        },
        {
            "id": 1571,
            "name": "寿阳县"
        },
        {
            "id": 1572,
            "name": "太谷县"
        },
        {
            "id": 1573,
            "name": "和顺县"
        },
        {
            "id": 1574,
            "name": "灵石县"
        },
        {
            "id": 1575,
            "name": "平遥县"
        },
        {
            "id": 1576,
            "name": "榆社县"
        },
        {
            "id": 1577,
            "name": "榆次区"
        }],
        "id": 1578,
        "name": "晋中市"
    },
    {
        "child": [{
            "id": 1579,
            "name": "原平市"
        },
        {
            "id": 1580,
            "name": "代县"
        },
        {
            "id": 1581,
            "name": "神池县"
        },
        {
            "id": 1582,
            "name": "五寨县"
        },
        {
            "id": 1583,
            "name": "五台县"
        },
        {
            "id": 1584,
            "name": "偏关县"
        },
        {
            "id": 1585,
            "name": "宁武县"
        },
        {
            "id": 1586,
            "name": "静乐县"
        },
        {
            "id": 1587,
            "name": "繁峙县"
        },
        {
            "id": 1588,
            "name": "河曲县"
        },
        {
            "id": 1589,
            "name": "保德县"
        },
        {
            "id": 1590,
            "name": "定襄县"
        },
        {
            "id": 1591,
            "name": "忻府区"
        },
        {
            "id": 1592,
            "name": "岢岚县"
        }],
        "id": 1593,
        "name": "忻州市"
    },
    {
        "child": [{
            "id": 1594,
            "name": "离石区"
        },
        {
            "id": 1595,
            "name": "孝义市"
        },
        {
            "id": 1596,
            "name": "汾阳市"
        },
        {
            "id": 1597,
            "name": "文水县"
        },
        {
            "id": 1598,
            "name": "中阳县"
        },
        {
            "id": 1599,
            "name": "兴县"
        },
        {
            "id": 1600,
            "name": "临县"
        },
        {
            "id": 1601,
            "name": "方山县"
        },
        {
            "id": 1602,
            "name": "柳林县"
        },
        {
            "id": 1603,
            "name": "岚县"
        },
        {
            "id": 1604,
            "name": "交口县"
        },
        {
            "id": 1605,
            "name": "交城县"
        },
        {
            "id": 1606,
            "name": "石楼县"
        }],
        "id": 1607,
        "name": "吕梁市"
    },
    {
        "child": [{
            "id": 1608,
            "name": "曲沃县"
        },
        {
            "id": 1609,
            "name": "侯马市"
        },
        {
            "id": 1610,
            "name": "霍州市"
        },
        {
            "id": 1611,
            "name": "汾西县"
        },
        {
            "id": 1612,
            "name": "吉县"
        },
        {
            "id": 1613,
            "name": "安泽县"
        },
        {
            "id": 1614,
            "name": "浮山县"
        },
        {
            "id": 1615,
            "name": "大宁县"
        },
        {
            "id": 1616,
            "name": "古县"
        },
        {
            "id": 1617,
            "name": "隰县"
        },
        {
            "id": 1618,
            "name": "襄汾县"
        },
        {
            "id": 1619,
            "name": "翼城县"
        },
        {
            "id": 1620,
            "name": "永和县"
        },
        {
            "id": 1621,
            "name": "乡宁县"
        },
        {
            "id": 1622,
            "name": "洪洞县"
        },
        {
            "id": 1623,
            "name": "蒲县"
        },
        {
            "id": 1624,
            "name": "尧都区"
        }],
        "id": 1625,
        "name": "临汾市"
    },
    {
        "child": [{
            "id": 1626,
            "name": "盐湖区"
        },
        {
            "id": 1627,
            "name": "河津市"
        },
        {
            "id": 1628,
            "name": "永济市"
        },
        {
            "id": 1629,
            "name": "新绛县"
        },
        {
            "id": 1630,
            "name": "平陆县"
        },
        {
            "id": 1631,
            "name": "垣曲县"
        },
        {
            "id": 1632,
            "name": "绛县"
        },
        {
            "id": 1633,
            "name": "稷山县"
        },
        {
            "id": 1634,
            "name": "芮城县"
        },
        {
            "id": 1635,
            "name": "夏县"
        },
        {
            "id": 1636,
            "name": "临猗县"
        },
        {
            "id": 1637,
            "name": "万荣县"
        },
        {
            "id": 1638,
            "name": "闻喜县"
        }],
        "id": 1639,
        "name": "运城市"
    }]
},
{
    "id": 1640,
    "name": "河南",
    "child": [{
        "child": [{
            "id": 1641,
            "name": "永城市"
        },
        {
            "id": 1642,
            "name": "宁陵县"
        },
        {
            "id": 1643,
            "name": "虞城县"
        },
        {
            "id": 1644,
            "name": "民权县"
        },
        {
            "id": 1645,
            "name": "夏邑县"
        },
        {
            "id": 1646,
            "name": "柘城县"
        },
        {
            "id": 1647,
            "name": "睢县"
        },
        {
            "id": 1648,
            "name": "睢阳区"
        },
        {
            "id": 1649,
            "name": "梁园区"
        }],
        "id": 1650,
        "name": "商丘市"
    },
    {
        "child": [{
            "id": 1651,
            "name": "项城市"
        },
        {
            "id": 1652,
            "name": "商水县"
        },
        {
            "id": 1653,
            "name": "淮阳县"
        },
        {
            "id": 1654,
            "name": "太康县"
        },
        {
            "id": 1655,
            "name": "鹿邑县"
        },
        {
            "id": 1656,
            "name": "西华县"
        },
        {
            "id": 1657,
            "name": "扶沟县"
        },
        {
            "id": 1658,
            "name": "沈丘县"
        },
        {
            "id": 1659,
            "name": "郸城县"
        },
        {
            "id": 1660,
            "name": "川汇区"
        },
        {
            "id": 1661,
            "name": "东新区"
        },
        {
            "id": 1662,
            "name": "经济开发区"
        }],
        "id": 1663,
        "name": "周口市"
    },
    {
        "child": [{
            "id": 1664,
            "name": "确山县"
        },
        {
            "id": 1665,
            "name": "新蔡县"
        },
        {
            "id": 1666,
            "name": "上蔡县"
        },
        {
            "id": 1667,
            "name": "泌阳县"
        },
        {
            "id": 1668,
            "name": "西平县"
        },
        {
            "id": 1669,
            "name": "遂平县"
        },
        {
            "id": 1670,
            "name": "汝南县"
        },
        {
            "id": 1671,
            "name": "平舆县"
        },
        {
            "id": 1672,
            "name": "正阳县"
        },
        {
            "id": 1673,
            "name": "驿城区"
        }],
        "id": 1674,
        "name": "驻马店市"
    },
    {
        "child": [{
            "id": 1675,
            "name": "潢川县"
        },
        {
            "id": 1676,
            "name": "淮滨县"
        },
        {
            "id": 1677,
            "name": "息县"
        },
        {
            "id": 1678,
            "name": "新县"
        },
        {
            "id": 1679,
            "name": "固始县"
        },
        {
            "id": 1680,
            "name": "罗山县"
        },
        {
            "id": 1681,
            "name": "光山县"
        },
        {
            "id": 1682,
            "name": "商城县"
        },
        {
            "id": 1683,
            "name": "平桥区"
        },
        {
            "id": 1684,
            "name": "浉河区"
        }],
        "id": 1685,
        "name": "信阳市"
    },
    {
        "child": [{
            "id": 1686,
            "name": "二七区"
        },
        {
            "id": 1687,
            "name": "中原区"
        },
        {
            "id": 1688,
            "name": "郑东新区"
        },
        {
            "id": 1689,
            "name": "管城区"
        },
        {
            "id": 1690,
            "name": "金水区"
        },
        {
            "id": 1691,
            "name": "经济开发区"
        },
        {
            "id": 1692,
            "name": "高新技术开发区"
        },
        {
            "id": 1693,
            "name": "新郑市"
        },
        {
            "id": 1694,
            "name": "巩义市"
        },
        {
            "id": 1695,
            "name": "荥阳市"
        },
        {
            "id": 1696,
            "name": "中牟县"
        },
        {
            "id": 1697,
            "name": "新密市"
        },
        {
            "id": 1698,
            "name": "登封市"
        },
        {
            "id": 1699,
            "name": "惠济区"
        },
        {
            "id": 1700,
            "name": "上街区"
        }],
        "id": 1701,
        "name": "郑州市"
    },
    {
        "child": [{
            "id": 1702,
            "name": "金明区"
        },
        {
            "id": 1703,
            "name": "龙亭区"
        },
        {
            "id": 1704,
            "name": "顺河区"
        },
        {
            "id": 1705,
            "name": "鼓楼区"
        },
        {
            "id": 1706,
            "name": "禹王台区"
        },
        {
            "id": 1707,
            "name": "通许县"
        },
        {
            "id": 1708,
            "name": "开封县"
        },
        {
            "id": 1709,
            "name": "杞县"
        },
        {
            "id": 1710,
            "name": "兰考县"
        },
        {
            "id": 1711,
            "name": "尉氏县"
        }],
        "id": 1712,
        "name": "开封市"
    },
    {
        "child": [{
            "id": 1713,
            "name": "涧西区"
        },
        {
            "id": 1714,
            "name": "西工区"
        },
        {
            "id": 1715,
            "name": "洛龙区"
        },
        {
            "id": 1716,
            "name": "嵩县"
        },
        {
            "id": 1717,
            "name": "偃师市"
        },
        {
            "id": 1718,
            "name": "孟津县"
        },
        {
            "id": 1719,
            "name": "汝阳县"
        },
        {
            "id": 1720,
            "name": "伊川县"
        },
        {
            "id": 1721,
            "name": "洛宁县"
        },
        {
            "id": 1722,
            "name": "宜阳县"
        },
        {
            "id": 1723,
            "name": "栾川县"
        },
        {
            "id": 1724,
            "name": "新安县"
        },
        {
            "id": 1725,
            "name": "伊滨区"
        },
        {
            "id": 1726,
            "name": "吉利区"
        },
        {
            "id": 1727,
            "name": "瀍河区"
        },
        {
            "id": 1728,
            "name": "老城区"
        }],
        "id": 1729,
        "name": "洛阳市"
    },
    {
        "child": [{
            "id": 1730,
            "name": "湛河区"
        },
        {
            "id": 1731,
            "name": "卫东区"
        },
        {
            "id": 1732,
            "name": "新华区"
        },
        {
            "id": 1733,
            "name": "汝州市"
        },
        {
            "id": 1734,
            "name": "舞钢市"
        },
        {
            "id": 1735,
            "name": "郏县"
        },
        {
            "id": 1736,
            "name": "叶县"
        },
        {
            "id": 1737,
            "name": "鲁山县"
        },
        {
            "id": 1738,
            "name": "宝丰县"
        },
        {
            "id": 1739,
            "name": "石龙区"
        }],
        "id": 1740,
        "name": "平顶山市"
    },
    {
        "child": [{
            "id": 1741,
            "name": "沁阳市"
        },
        {
            "id": 1742,
            "name": "孟州市"
        },
        {
            "id": 1743,
            "name": "修武县"
        },
        {
            "id": 1744,
            "name": "温县"
        },
        {
            "id": 1745,
            "name": "武陟县"
        },
        {
            "id": 1746,
            "name": "博爱县"
        },
        {
            "id": 1747,
            "name": "山阳区"
        },
        {
            "id": 1748,
            "name": "解放区"
        },
        {
            "id": 1749,
            "name": "马村区"
        },
        {
            "id": 1750,
            "name": "中站区"
        }],
        "id": 1751,
        "name": "焦作市"
    },
    {
        "child": [{
            "id": 1752,
            "name": "淇滨区"
        },
        {
            "id": 1753,
            "name": "浚县"
        },
        {
            "id": 1754,
            "name": "淇县"
        },
        {
            "id": 1755,
            "name": "鹤山区"
        },
        {
            "id": 1756,
            "name": "山城区"
        }],
        "id": 1757,
        "name": "鹤壁市"
    },
    {
        "child": [{
            "id": 1758,
            "name": "牧野区"
        },
        {
            "id": 1759,
            "name": "红旗区"
        },
        {
            "id": 1760,
            "name": "卫滨区"
        },
        {
            "id": 1761,
            "name": "卫辉市"
        },
        {
            "id": 1762,
            "name": "辉县市"
        },
        {
            "id": 1763,
            "name": "新乡县"
        },
        {
            "id": 1764,
            "name": "获嘉县"
        },
        {
            "id": 1765,
            "name": "原阳县"
        },
        {
            "id": 1766,
            "name": "长垣县"
        },
        {
            "id": 1767,
            "name": "延津县"
        },
        {
            "id": 1768,
            "name": "封丘县"
        },
        {
            "id": 1769,
            "name": "凤泉区"
        }],
        "id": 1770,
        "name": "新乡市"
    },
    {
        "child": [{
            "id": 1771,
            "name": "龙安区"
        },
        {
            "id": 1772,
            "name": "殷都区"
        },
        {
            "id": 1773,
            "name": "文峰区"
        },
        {
            "id": 1774,
            "name": "开发区"
        },
        {
            "id": 1775,
            "name": "北关区"
        },
        {
            "id": 1776,
            "name": "林州市"
        },
        {
            "id": 1777,
            "name": "安阳县"
        },
        {
            "id": 1778,
            "name": "滑县"
        },
        {
            "id": 1779,
            "name": "汤阴县"
        },
        {
            "id": 1780,
            "name": "内黄县"
        }],
        "id": 1781,
        "name": "安阳市"
    },
    {
        "child": [{
            "id": 1782,
            "name": "濮阳县"
        },
        {
            "id": 1783,
            "name": "南乐县"
        },
        {
            "id": 1784,
            "name": "台前县"
        },
        {
            "id": 1785,
            "name": "清丰县"
        },
        {
            "id": 1786,
            "name": "范县"
        },
        {
            "id": 1787,
            "name": "华龙区"
        }],
        "id": 1788,
        "name": "濮阳市"
    },
    {
        "child": [{
            "id": 1789,
            "name": "城区"
        },
        {
            "id": 1790,
            "name": "五龙口镇"
        },
        {
            "id": 1791,
            "name": "下冶镇"
        },
        {
            "id": 1792,
            "name": "轵城镇"
        },
        {
            "id": 1793,
            "name": "王屋镇"
        },
        {
            "id": 1794,
            "name": "思礼镇"
        },
        {
            "id": 1795,
            "name": "邵原镇"
        },
        {
            "id": 1796,
            "name": "坡头镇"
        },
        {
            "id": 1797,
            "name": "梨林镇"
        },
        {
            "id": 1798,
            "name": "克井镇"
        },
        {
            "id": 1799,
            "name": "大峪镇"
        },
        {
            "id": 1800,
            "name": "承留镇"
        }],
        "id": 1801,
        "name": "济源市"
    },
    {
        "child": [{
            "id": 1802,
            "name": "魏都区"
        },
        {
            "id": 1803,
            "name": "禹州市"
        },
        {
            "id": 1804,
            "name": "长葛市"
        },
        {
            "id": 1805,
            "name": "许昌县"
        },
        {
            "id": 1806,
            "name": "鄢陵县"
        },
        {
            "id": 1807,
            "name": "襄城县"
        }],
        "id": 1808,
        "name": "许昌市"
    },
    {
        "child": [{
            "id": 1809,
            "name": "郾城区"
        },
        {
            "id": 1810,
            "name": "临颍县"
        },
        {
            "id": 1811,
            "name": "召陵区"
        },
        {
            "id": 1812,
            "name": "舞阳县"
        },
        {
            "id": 1813,
            "name": "源汇区"
        }],
        "id": 1814,
        "name": "漯河市"
    },
    {
        "child": [{
            "id": 1815,
            "name": "渑池县"
        },
        {
            "id": 1816,
            "name": "湖滨区"
        },
        {
            "id": 1817,
            "name": "义马市"
        },
        {
            "id": 1818,
            "name": "灵宝市"
        },
        {
            "id": 1819,
            "name": "陕县"
        },
        {
            "id": 1820,
            "name": "卢氏县"
        }],
        "id": 1821,
        "name": "三门峡市"
    },
    {
        "child": [{
            "id": 1822,
            "name": "社旗县"
        },
        {
            "id": 1823,
            "name": "西峡县"
        },
        {
            "id": 1824,
            "name": "卧龙区"
        },
        {
            "id": 1825,
            "name": "宛城区"
        },
        {
            "id": 1826,
            "name": "邓州市"
        },
        {
            "id": 1827,
            "name": "桐柏县"
        },
        {
            "id": 1828,
            "name": "方城县"
        },
        {
            "id": 1829,
            "name": "淅川县"
        },
        {
            "id": 1830,
            "name": "镇平县"
        },
        {
            "id": 1831,
            "name": "唐河县"
        },
        {
            "id": 1832,
            "name": "南召县"
        },
        {
            "id": 1833,
            "name": "内乡县"
        },
        {
            "id": 1834,
            "name": "新野县"
        }],
        "id": 1835,
        "name": "南阳市"
    }]
},
{
    "id": 1836,
    "name": "辽宁",
    "child": [{
        "child": [{
            "id": 1837,
            "name": "苏家屯区"
        },
        {
            "id": 1838,
            "name": "新民市"
        },
        {
            "id": 1839,
            "name": "法库县"
        },
        {
            "id": 1840,
            "name": "辽中县"
        },
        {
            "id": 1841,
            "name": "康平县"
        },
        {
            "id": 1842,
            "name": "皇姑区"
        },
        {
            "id": 1843,
            "name": "铁西区"
        },
        {
            "id": 1844,
            "name": "大东区"
        },
        {
            "id": 1845,
            "name": "沈河区"
        },
        {
            "id": 1846,
            "name": "东陵区"
        },
        {
            "id": 1847,
            "name": "于洪区"
        },
        {
            "id": 1848,
            "name": "和平区"
        },
        {
            "id": 1849,
            "name": "浑南新区"
        },
        {
            "id": 1850,
            "name": "沈北新区"
        }],
        "id": 1851,
        "name": "沈阳市"
    },
    {
        "child": [{
            "id": 1852,
            "name": "中山区"
        },
        {
            "id": 1853,
            "name": "沙河口区"
        },
        {
            "id": 1854,
            "name": "西岗区"
        },
        {
            "id": 1855,
            "name": "甘井子区"
        },
        {
            "id": 1856,
            "name": "高新园区"
        },
        {
            "id": 1857,
            "name": "大连开发区"
        },
        {
            "id": 1858,
            "name": "金州区"
        },
        {
            "id": 1859,
            "name": "旅顺口区"
        },
        {
            "id": 1860,
            "name": "普兰店市"
        },
        {
            "id": 1861,
            "name": "瓦房店市"
        },
        {
            "id": 1862,
            "name": "庄河市"
        },
        {
            "id": 1863,
            "name": "长海县"
        }],
        "id": 1864,
        "name": "大连市"
    },
    {
        "child": [{
            "id": 1865,
            "name": "铁东区"
        },
        {
            "id": 1866,
            "name": "立山区"
        },
        {
            "id": 1867,
            "name": "台安县"
        },
        {
            "id": 1868,
            "name": "海城市"
        },
        {
            "id": 1869,
            "name": "岫岩县"
        },
        {
            "id": 1870,
            "name": "铁西区"
        },
        {
            "id": 1871,
            "name": "千山区"
        }],
        "id": 1872,
        "name": "鞍山市"
    },
    {
        "child": [{
            "id": 1873,
            "name": "望花区"
        },
        {
            "id": 1874,
            "name": "东洲区"
        },
        {
            "id": 1875,
            "name": "新抚区"
        },
        {
            "id": 1876,
            "name": "顺城区"
        },
        {
            "id": 1877,
            "name": "抚顺县"
        },
        {
            "id": 1878,
            "name": "新宾县"
        },
        {
            "id": 1879,
            "name": "清原县"
        }],
        "id": 1880,
        "name": "抚顺市"
    },
    {
        "child": [{
            "id": 1881,
            "name": "桓仁县"
        },
        {
            "id": 1882,
            "name": "本溪县"
        },
        {
            "id": 1883,
            "name": "平山区"
        },
        {
            "id": 1884,
            "name": "溪湖区"
        },
        {
            "id": 1885,
            "name": "明山区"
        },
        {
            "id": 1886,
            "name": "南芬区"
        }],
        "id": 1887,
        "name": "本溪市"
    },
    {
        "child": [{
            "id": 1888,
            "name": "元宝区"
        },
        {
            "id": 1889,
            "name": "振兴区"
        },
        {
            "id": 1890,
            "name": "振安区"
        },
        {
            "id": 1891,
            "name": "东港市"
        },
        {
            "id": 1892,
            "name": "凤城市"
        },
        {
            "id": 1893,
            "name": "宽甸县"
        }],
        "id": 1894,
        "name": "丹东市"
    },
    {
        "child": [{
            "id": 1895,
            "name": "凌河区"
        },
        {
            "id": 1896,
            "name": "古塔区"
        },
        {
            "id": 1897,
            "name": "太和区"
        },
        {
            "id": 1898,
            "name": "义县"
        },
        {
            "id": 1899,
            "name": "凌海市"
        },
        {
            "id": 1900,
            "name": "北镇市"
        },
        {
            "id": 1901,
            "name": "黑山县"
        },
        {
            "id": 1902,
            "name": "经济技术开发区"
        }],
        "id": 1903,
        "name": "锦州市"
    },
    {
        "child": [{
            "id": 1904,
            "name": "龙港区"
        },
        {
            "id": 1905,
            "name": "连山区"
        },
        {
            "id": 1906,
            "name": "兴城市"
        },
        {
            "id": 1907,
            "name": "绥中县"
        },
        {
            "id": 1908,
            "name": "建昌县"
        },
        {
            "id": 1909,
            "name": "南票区"
        }],
        "id": 1910,
        "name": "葫芦岛市"
    },
    {
        "child": [{
            "id": 1911,
            "name": "西市区"
        },
        {
            "id": 1912,
            "name": "站前区"
        },
        {
            "id": 1913,
            "name": "大石桥市"
        },
        {
            "id": 1914,
            "name": "盖州市"
        },
        {
            "id": 1915,
            "name": "老边区"
        },
        {
            "id": 1916,
            "name": "鲅鱼圈区"
        }],
        "id": 1917,
        "name": "营口市"
    },
    {
        "child": [{
            "id": 1918,
            "name": "盘山县"
        },
        {
            "id": 1919,
            "name": "大洼县"
        },
        {
            "id": 1920,
            "name": "兴隆台区"
        },
        {
            "id": 1921,
            "name": "双台子区"
        }],
        "id": 1922,
        "name": "盘锦市"
    },
    {
        "child": [{
            "id": 1923,
            "name": "阜新县"
        },
        {
            "id": 1924,
            "name": "彰武县"
        },
        {
            "id": 1925,
            "name": "海州区"
        },
        {
            "id": 1926,
            "name": "太平区"
        },
        {
            "id": 1927,
            "name": "细河区"
        },
        {
            "id": 1928,
            "name": "清河门区"
        },
        {
            "id": 1929,
            "name": "新邱区"
        }],
        "id": 1930,
        "name": "阜新市"
    },
    {
        "child": [{
            "id": 1931,
            "name": "辽阳县"
        },
        {
            "id": 1932,
            "name": "白塔区"
        },
        {
            "id": 1933,
            "name": "文圣区"
        },
        {
            "id": 1934,
            "name": "灯塔市"
        },
        {
            "id": 1935,
            "name": "太子河区"
        },
        {
            "id": 1936,
            "name": "弓长岭区"
        },
        {
            "id": 1937,
            "name": "宏伟区"
        }],
        "id": 1938,
        "name": "辽阳市"
    },
    {
        "child": [{
            "id": 1939,
            "name": "凌源市"
        },
        {
            "id": 1940,
            "name": "北票市"
        },
        {
            "id": 1941,
            "name": "喀喇沁左翼县"
        },
        {
            "id": 1942,
            "name": "朝阳县"
        },
        {
            "id": 1943,
            "name": "双塔区"
        },
        {
            "id": 1944,
            "name": "建平县"
        },
        {
            "id": 1945,
            "name": "龙城区"
        }],
        "id": 1946,
        "name": "朝阳市"
    },
    {
        "child": [{
            "id": 1947,
            "name": "银州区"
        },
        {
            "id": 1948,
            "name": "清河区"
        },
        {
            "id": 1949,
            "name": "开原市"
        },
        {
            "id": 1950,
            "name": "铁岭县"
        },
        {
            "id": 1951,
            "name": "西丰县"
        },
        {
            "id": 1952,
            "name": "昌图县"
        },
        {
            "id": 1953,
            "name": "调兵山市"
        }],
        "id": 1954,
        "name": "铁岭市"
    }]
},
{
    "id": 1955,
    "name": "吉林",
    "child": [{
        "child": [{
            "id": 1956,
            "name": "德惠市"
        },
        {
            "id": 1957,
            "name": "榆树市"
        },
        {
            "id": 1958,
            "name": "九台市"
        },
        {
            "id": 1959,
            "name": "农安县"
        },
        {
            "id": 1960,
            "name": "朝阳区"
        },
        {
            "id": 1961,
            "name": "南关区"
        },
        {
            "id": 1962,
            "name": "宽城区"
        },
        {
            "id": 1963,
            "name": "二道区"
        },
        {
            "id": 1964,
            "name": "双阳区"
        },
        {
            "id": 1965,
            "name": "绿园区"
        },
        {
            "id": 1966,
            "name": "净月区"
        },
        {
            "id": 1967,
            "name": "汽车产业开发区"
        },
        {
            "id": 1968,
            "name": "高新技术开发区"
        },
        {
            "id": 1969,
            "name": "经济技术开发区"
        }],
        "id": 1970,
        "name": "长春市"
    },
    {
        "child": [{
            "id": 1971,
            "name": "昌邑区"
        },
        {
            "id": 1972,
            "name": "龙潭区"
        },
        {
            "id": 1973,
            "name": "船营区"
        },
        {
            "id": 1974,
            "name": "丰满区"
        },
        {
            "id": 1975,
            "name": "舒兰市"
        },
        {
            "id": 1976,
            "name": "桦甸市"
        },
        {
            "id": 1977,
            "name": "蛟河市"
        },
        {
            "id": 1978,
            "name": "磐石市"
        },
        {
            "id": 1979,
            "name": "永吉县"
        }],
        "id": 1980,
        "name": "吉林市"
    },
    {
        "child": [{
            "id": 1981,
            "name": "铁东区"
        },
        {
            "id": 1982,
            "name": "铁西区"
        },
        {
            "id": 1983,
            "name": "公主岭市"
        },
        {
            "id": 1984,
            "name": "双辽市"
        },
        {
            "id": 1985,
            "name": "梨树县"
        },
        {
            "id": 1986,
            "name": "伊通县"
        }],
        "id": 1987,
        "name": "四平市"
    },
    {
        "child": [{
            "id": 1988,
            "name": "东昌区"
        },
        {
            "id": 1989,
            "name": "梅河口市"
        },
        {
            "id": 1990,
            "name": "集安市"
        },
        {
            "id": 1991,
            "name": "通化县"
        },
        {
            "id": 1992,
            "name": "辉南县"
        },
        {
            "id": 1993,
            "name": "柳河县"
        },
        {
            "id": 1994,
            "name": "二道江区"
        }],
        "id": 1995,
        "name": "通化市"
    },
    {
        "child": [{
            "id": 1996,
            "name": "浑江区"
        },
        {
            "id": 1997,
            "name": "临江市"
        },
        {
            "id": 1998,
            "name": "江源区"
        },
        {
            "id": 1999,
            "name": "靖宇县"
        },
        {
            "id": 2000,
            "name": "抚松县"
        },
        {
            "id": 2001,
            "name": "长白县"
        }],
        "id": 2002,
        "name": "白山市"
    },
    {
        "child": [{
            "id": 2003,
            "name": "宁江区"
        },
        {
            "id": 2004,
            "name": "前郭县"
        },
        {
            "id": 2005,
            "name": "乾安县"
        },
        {
            "id": 2006,
            "name": "长岭县"
        },
        {
            "id": 2007,
            "name": "扶余县"
        }],
        "id": 2008,
        "name": "松原市"
    },
    {
        "child": [{
            "id": 2009,
            "name": "大安市"
        },
        {
            "id": 2010,
            "name": "洮南市"
        },
        {
            "id": 2011,
            "name": "通榆县"
        },
        {
            "id": 2012,
            "name": "镇赉县"
        },
        {
            "id": 2013,
            "name": "洮北区"
        }],
        "id": 2014,
        "name": "白城市"
    },
    {
        "child": [{
            "id": 2015,
            "name": "延吉市"
        },
        {
            "id": 2016,
            "name": "图们市"
        },
        {
            "id": 2017,
            "name": "敦化市"
        },
        {
            "id": 2018,
            "name": "珲春市"
        },
        {
            "id": 2019,
            "name": "龙井市"
        },
        {
            "id": 2020,
            "name": "和龙市"
        },
        {
            "id": 2021,
            "name": "汪清县"
        },
        {
            "id": 2022,
            "name": "安图县"
        }],
        "id": 2023,
        "name": "延边州"
    },
    {
        "child": [{
            "id": 2024,
            "name": "龙山区"
        },
        {
            "id": 2025,
            "name": "西安区"
        },
        {
            "id": 2026,
            "name": "东丰县"
        },
        {
            "id": 2027,
            "name": "东辽县"
        }],
        "id": 2028,
        "name": "辽源市"
    }]
},
{
    "id": 2029,
    "name": "黑龙江",
    "child": [{
        "child": [{
            "id": 2030,
            "name": "勃利县"
        },
        {
            "id": 2031,
            "name": "桃山区"
        },
        {
            "id": 2032,
            "name": "新兴区"
        },
        {
            "id": 2033,
            "name": "茄子河区"
        }],
        "id": 2034,
        "name": "七台河市"
    },
    {
        "child": [{
            "id": 2035,
            "name": "北安市"
        },
        {
            "id": 2036,
            "name": "五大连池市"
        },
        {
            "id": 2037,
            "name": "逊克县"
        },
        {
            "id": 2038,
            "name": "孙吴县"
        },
        {
            "id": 2039,
            "name": "嫩江县"
        },
        {
            "id": 2040,
            "name": "爱辉区"
        }],
        "id": 2041,
        "name": "黑河市"
    },
    {
        "child": [{
            "id": 2042,
            "name": "北林区"
        },
        {
            "id": 2043,
            "name": "安达市"
        },
        {
            "id": 2044,
            "name": "肇东市"
        },
        {
            "id": 2045,
            "name": "海伦市"
        },
        {
            "id": 2046,
            "name": "绥棱县"
        },
        {
            "id": 2047,
            "name": "兰西县"
        },
        {
            "id": 2048,
            "name": "明水县"
        },
        {
            "id": 2049,
            "name": "青冈县"
        },
        {
            "id": 2050,
            "name": "庆安县"
        },
        {
            "id": 2051,
            "name": "望奎县"
        }],
        "id": 2052,
        "name": "绥化市"
    },
    {
        "child": [{
            "id": 2053,
            "name": "加格达奇区"
        },
        {
            "id": 2054,
            "name": "松岭区"
        },
        {
            "id": 2055,
            "name": "呼中区"
        },
        {
            "id": 2056,
            "name": "呼玛县"
        },
        {
            "id": 2057,
            "name": "塔河县"
        },
        {
            "id": 2058,
            "name": "漠河县"
        },
        {
            "id": 2059,
            "name": "新林区"
        }],
        "id": 2060,
        "name": "大兴安岭地区"
    },
    {
        "child": [{
            "id": 2061,
            "name": "阿城区"
        },
        {
            "id": 2062,
            "name": "尚志市"
        },
        {
            "id": 2063,
            "name": "双城市"
        },
        {
            "id": 2064,
            "name": "五常市"
        },
        {
            "id": 2065,
            "name": "方正县"
        },
        {
            "id": 2066,
            "name": "宾县"
        },
        {
            "id": 2067,
            "name": "依兰县"
        },
        {
            "id": 2068,
            "name": "巴彦县"
        },
        {
            "id": 2069,
            "name": "通河县"
        },
        {
            "id": 2070,
            "name": "木兰县"
        },
        {
            "id": 2071,
            "name": "延寿县"
        },
        {
            "id": 2072,
            "name": "呼兰区"
        },
        {
            "id": 2073,
            "name": "松北区"
        },
        {
            "id": 2074,
            "name": "道里区"
        },
        {
            "id": 2075,
            "name": "南岗区"
        },
        {
            "id": 2076,
            "name": "道外区"
        },
        {
            "id": 2077,
            "name": "香坊区"
        },
        {
            "id": 2078,
            "name": "平房区"
        }],
        "id": 2079,
        "name": "哈尔滨市"
    },
    {
        "child": [{
            "id": 2080,
            "name": "建华区"
        },
        {
            "id": 2081,
            "name": "龙沙区"
        },
        {
            "id": 2082,
            "name": "铁锋区"
        },
        {
            "id": 2083,
            "name": "梅里斯区"
        },
        {
            "id": 2084,
            "name": "昂昂溪区"
        },
        {
            "id": 2085,
            "name": "富拉尔基区"
        },
        {
            "id": 2086,
            "name": "碾子山区"
        },
        {
            "id": 2087,
            "name": "讷河市"
        },
        {
            "id": 2088,
            "name": "富裕县"
        },
        {
            "id": 2089,
            "name": "拜泉县"
        },
        {
            "id": 2090,
            "name": "甘南县"
        },
        {
            "id": 2091,
            "name": "依安县"
        },
        {
            "id": 2092,
            "name": "克山县"
        },
        {
            "id": 2093,
            "name": "龙江县"
        },
        {
            "id": 2094,
            "name": "克东县"
        },
        {
            "id": 2095,
            "name": "泰来县"
        }],
        "id": 2096,
        "name": "齐齐哈尔市"
    },
    {
        "child": [{
            "id": 2097,
            "name": "兴山区"
        },
        {
            "id": 2098,
            "name": "向阳区"
        },
        {
            "id": 2099,
            "name": "工农区"
        },
        {
            "id": 2100,
            "name": "南山区"
        },
        {
            "id": 2101,
            "name": "兴安区"
        },
        {
            "id": 2102,
            "name": "东山区"
        },
        {
            "id": 2103,
            "name": "萝北县"
        },
        {
            "id": 2104,
            "name": "绥滨县"
        }],
        "id": 2105,
        "name": "鹤岗市"
    },
    {
        "child": [{
            "id": 2106,
            "name": "尖山区"
        },
        {
            "id": 2107,
            "name": "岭东区"
        },
        {
            "id": 2108,
            "name": "四方台区"
        },
        {
            "id": 2109,
            "name": "宝山区"
        },
        {
            "id": 2110,
            "name": "集贤县"
        },
        {
            "id": 2111,
            "name": "宝清县"
        },
        {
            "id": 2112,
            "name": "友谊县"
        },
        {
            "id": 2113,
            "name": "饶河县"
        }],
        "id": 2114,
        "name": "双鸭山市"
    },
    {
        "child": [{
            "id": 2115,
            "name": "恒山区"
        },
        {
            "id": 2116,
            "name": "滴道区"
        },
        {
            "id": 2117,
            "name": "梨树区"
        },
        {
            "id": 2118,
            "name": "城子河区"
        },
        {
            "id": 2119,
            "name": "麻山区"
        },
        {
            "id": 2120,
            "name": "鸡冠区"
        },
        {
            "id": 2121,
            "name": "密山市"
        },
        {
            "id": 2122,
            "name": "虎林市"
        },
        {
            "id": 2123,
            "name": "鸡东县"
        }],
        "id": 2124,
        "name": "鸡西市"
    },
    {
        "child": [{
            "id": 2125,
            "name": "萨尔图区"
        },
        {
            "id": 2126,
            "name": "龙凤区"
        },
        {
            "id": 2127,
            "name": "让胡路区"
        },
        {
            "id": 2128,
            "name": "红岗区"
        },
        {
            "id": 2129,
            "name": "大同区"
        },
        {
            "id": 2130,
            "name": "林甸县"
        },
        {
            "id": 2131,
            "name": "肇州县"
        },
        {
            "id": 2132,
            "name": "肇源县"
        },
        {
            "id": 2133,
            "name": "杜尔伯特县"
        }],
        "id": 2134,
        "name": "大庆市"
    },
    {
        "child": [{
            "id": 2135,
            "name": "伊春区"
        },
        {
            "id": 2136,
            "name": "南岔区"
        },
        {
            "id": 2137,
            "name": "友好区"
        },
        {
            "id": 2138,
            "name": "西林区"
        },
        {
            "id": 2139,
            "name": "翠峦区"
        },
        {
            "id": 2140,
            "name": "新青区"
        },
        {
            "id": 2141,
            "name": "美溪区"
        },
        {
            "id": 2142,
            "name": "金山屯区"
        },
        {
            "id": 2143,
            "name": "五营区"
        },
        {
            "id": 2144,
            "name": "乌马河区"
        },
        {
            "id": 2145,
            "name": "汤旺河区"
        },
        {
            "id": 2146,
            "name": "带岭区"
        },
        {
            "id": 2147,
            "name": "乌伊岭区"
        },
        {
            "id": 2148,
            "name": "红星区"
        },
        {
            "id": 2149,
            "name": "上甘岭区"
        },
        {
            "id": 2150,
            "name": "铁力市"
        },
        {
            "id": 2151,
            "name": "嘉荫县"
        }],
        "id": 2152,
        "name": "伊春市"
    },
    {
        "child": [{
            "id": 2153,
            "name": "爱民区"
        },
        {
            "id": 2154,
            "name": "东安区"
        },
        {
            "id": 2155,
            "name": "阳明区"
        },
        {
            "id": 2156,
            "name": "西安区"
        },
        {
            "id": 2157,
            "name": "绥芬河市"
        },
        {
            "id": 2158,
            "name": "海林市"
        },
        {
            "id": 2159,
            "name": "宁安市"
        },
        {
            "id": 2160,
            "name": "穆棱市"
        },
        {
            "id": 2161,
            "name": "林口县"
        },
        {
            "id": 2162,
            "name": "东宁县"
        }],
        "id": 2163,
        "name": "牡丹江市"
    },
    {
        "child": [{
            "id": 2164,
            "name": "桦川县"
        },
        {
            "id": 2165,
            "name": "抚远县"
        },
        {
            "id": 2166,
            "name": "桦南县"
        },
        {
            "id": 2167,
            "name": "汤原县"
        },
        {
            "id": 2168,
            "name": "前进区"
        },
        {
            "id": 2169,
            "name": "向阳区"
        },
        {
            "id": 2170,
            "name": "东风区"
        },
        {
            "id": 2171,
            "name": "郊区"
        },
        {
            "id": 2172,
            "name": "同江市"
        },
        {
            "id": 2173,
            "name": "富锦市"
        }],
        "id": 2174,
        "name": "佳木斯市"
    }]
},
{
    "id": 2175,
    "name": "内蒙古",
    "child": [{
        "child": [{
            "id": 2176,
            "name": "玉泉区"
        },
        {
            "id": 2177,
            "name": "赛罕区"
        },
        {
            "id": 2178,
            "name": "土默特左旗"
        },
        {
            "id": 2179,
            "name": "和林格尔县"
        },
        {
            "id": 2180,
            "name": "武川县"
        },
        {
            "id": 2181,
            "name": "托克托县"
        },
        {
            "id": 2182,
            "name": "清水河县"
        },
        {
            "id": 2183,
            "name": "回民区"
        },
        {
            "id": 2184,
            "name": "新城区"
        }],
        "id": 2185,
        "name": "呼和浩特市"
    },
    {
        "child": [{
            "id": 2186,
            "name": "固阳县"
        },
        {
            "id": 2187,
            "name": "土默特右旗"
        },
        {
            "id": 2188,
            "name": "达茂联合旗"
        },
        {
            "id": 2189,
            "name": "东河区"
        },
        {
            "id": 2190,
            "name": "九原区"
        },
        {
            "id": 2191,
            "name": "青山区"
        },
        {
            "id": 2192,
            "name": "昆都仑区"
        },
        {
            "id": 2193,
            "name": "石拐区"
        },
        {
            "id": 2194,
            "name": "白云矿区"
        }],
        "id": 2195,
        "name": "包头市"
    },
    {
        "child": [{
            "id": 2196,
            "name": "海勃湾区"
        },
        {
            "id": 2197,
            "name": "海南区"
        },
        {
            "id": 2198,
            "name": "乌达区"
        }],
        "id": 2199,
        "name": "乌海市"
    },
    {
        "child": [{
            "id": 2200,
            "name": "宁城县"
        },
        {
            "id": 2201,
            "name": "敖汉旗"
        },
        {
            "id": 2202,
            "name": "喀喇沁旗"
        },
        {
            "id": 2203,
            "name": "翁牛特旗"
        },
        {
            "id": 2204,
            "name": "巴林右旗"
        },
        {
            "id": 2205,
            "name": "林西县"
        },
        {
            "id": 2206,
            "name": "克什克腾旗"
        },
        {
            "id": 2207,
            "name": "巴林左旗"
        },
        {
            "id": 2208,
            "name": "阿鲁科尔沁旗"
        },
        {
            "id": 2209,
            "name": "元宝山区"
        },
        {
            "id": 2210,
            "name": "红山区"
        },
        {
            "id": 2211,
            "name": "松山区"
        }],
        "id": 2212,
        "name": "赤峰市"
    },
    {
        "child": [{
            "id": 2213,
            "name": "集宁区"
        },
        {
            "id": 2214,
            "name": "丰镇市"
        },
        {
            "id": 2215,
            "name": "兴和县"
        },
        {
            "id": 2216,
            "name": "卓资县"
        },
        {
            "id": 2217,
            "name": "商都县"
        },
        {
            "id": 2218,
            "name": "凉城县"
        },
        {
            "id": 2219,
            "name": "化德县"
        },
        {
            "id": 2220,
            "name": "察哈尔右翼前旗"
        },
        {
            "id": 2221,
            "name": "察哈尔右翼中旗"
        },
        {
            "id": 2222,
            "name": "察哈尔右翼后旗"
        },
        {
            "id": 2223,
            "name": "四子王旗"
        }],
        "id": 2224,
        "name": "乌兰察布市"
    },
    {
        "child": [{
            "id": 2225,
            "name": "锡林浩特市"
        },
        {
            "id": 2226,
            "name": "二连浩特市"
        },
        {
            "id": 2227,
            "name": "多伦县"
        },
        {
            "id": 2228,
            "name": "阿巴嘎旗"
        },
        {
            "id": 2229,
            "name": "西乌珠穆沁旗"
        },
        {
            "id": 2230,
            "name": "东乌珠穆沁旗"
        },
        {
            "id": 2231,
            "name": "苏尼特右旗"
        },
        {
            "id": 2232,
            "name": "苏尼特左旗"
        },
        {
            "id": 2233,
            "name": "太仆寺旗"
        },
        {
            "id": 2234,
            "name": "正镶白旗"
        },
        {
            "id": 2235,
            "name": "正蓝旗"
        },
        {
            "id": 2236,
            "name": "镶黄旗"
        }],
        "id": 2237,
        "name": "锡林郭勒盟"
    },
    {
        "child": [{
            "id": 2238,
            "name": "海拉尔区"
        },
        {
            "id": 2239,
            "name": "满洲里市"
        },
        {
            "id": 2240,
            "name": "牙克石市"
        },
        {
            "id": 2241,
            "name": "扎兰屯市"
        },
        {
            "id": 2242,
            "name": "根河市"
        },
        {
            "id": 2243,
            "name": "额尔古纳市"
        },
        {
            "id": 2244,
            "name": "陈巴尔虎旗"
        },
        {
            "id": 2245,
            "name": "阿荣旗"
        },
        {
            "id": 2246,
            "name": "新巴尔虎左旗"
        },
        {
            "id": 2247,
            "name": "新巴尔虎右旗"
        },
        {
            "id": 2248,
            "name": "鄂伦春旗"
        },
        {
            "id": 2249,
            "name": "莫力达瓦旗"
        },
        {
            "id": 2250,
            "name": "鄂温克族旗"
        }],
        "id": 2251,
        "name": "呼伦贝尔市"
    },
    {
        "child": [{
            "id": 2252,
            "name": "东胜区"
        },
        {
            "id": 2253,
            "name": "准格尔旗"
        },
        {
            "id": 2254,
            "name": "伊金霍洛旗"
        },
        {
            "id": 2255,
            "name": "乌审旗"
        },
        {
            "id": 2256,
            "name": "杭锦旗"
        },
        {
            "id": 2257,
            "name": "鄂托克旗"
        },
        {
            "id": 2258,
            "name": "鄂托克前旗"
        },
        {
            "id": 2259,
            "name": "达拉特旗"
        },
        {
            "id": 2260,
            "name": "康巴什新区"
        }],
        "id": 2261,
        "name": "鄂尔多斯市"
    },
    {
        "child": [{
            "id": 2262,
            "name": "临河区"
        },
        {
            "id": 2263,
            "name": "五原县"
        },
        {
            "id": 2264,
            "name": "磴口县"
        },
        {
            "id": 2265,
            "name": "杭锦后旗"
        },
        {
            "id": 2266,
            "name": "乌拉特中旗"
        },
        {
            "id": 2267,
            "name": "乌拉特后旗 "
        },
        {
            "id": 2268,
            "name": "乌拉特前旗"
        }],
        "id": 2269,
        "name": "巴彦淖尔市"
    },
    {
        "child": [{
            "id": 2270,
            "name": "阿拉善右旗"
        },
        {
            "id": 2271,
            "name": "阿拉善左旗"
        },
        {
            "id": 2272,
            "name": "额济纳旗"
        }],
        "id": 2273,
        "name": "阿拉善盟"
    },
    {
        "child": [{
            "id": 2274,
            "name": "乌兰浩特市"
        },
        {
            "id": 2275,
            "name": "阿尔山市"
        },
        {
            "id": 2276,
            "name": "突泉县"
        },
        {
            "id": 2277,
            "name": "扎赉特旗"
        },
        {
            "id": 2278,
            "name": "科尔沁右翼前旗"
        },
        {
            "id": 2279,
            "name": "科尔沁右翼中旗"
        }],
        "id": 2280,
        "name": "兴安盟"
    },
    {
        "child": [{
            "id": 2281,
            "name": "科尔沁区"
        },
        {
            "id": 2282,
            "name": "霍林郭勒市"
        },
        {
            "id": 2283,
            "name": "开鲁县"
        },
        {
            "id": 2284,
            "name": "库伦旗"
        },
        {
            "id": 2285,
            "name": "奈曼旗"
        },
        {
            "id": 2286,
            "name": "扎鲁特旗"
        },
        {
            "id": 2287,
            "name": "科尔沁左翼中旗"
        },
        {
            "id": 2288,
            "name": "科尔沁左翼后旗"
        }],
        "id": 2289,
        "name": "通辽市"
    }]
},
{
    "id": 2290,
    "name": "江苏",
    "child": [{
        "child": [{
            "id": 2291,
            "name": "玄武区"
        },
        {
            "id": 2292,
            "name": "秦淮区"
        },
        {
            "id": 2293,
            "name": "建邺区"
        },
        {
            "id": 2294,
            "name": "鼓楼区"
        },
        {
            "id": 2295,
            "name": "栖霞区"
        },
        {
            "id": 2296,
            "name": "江宁区"
        },
        {
            "id": 2297,
            "name": "六合区"
        },
        {
            "id": 2298,
            "name": "雨花台区"
        },
        {
            "id": 2299,
            "name": "高淳区"
        },
        {
            "id": 2300,
            "name": "溧水区"
        },
        {
            "id": 2301,
            "name": "浦口区"
        }],
        "id": 2302,
        "name": "南京市"
    },
    {
        "child": [{
            "id": 2303,
            "name": "贾汪区"
        },
        {
            "id": 2304,
            "name": "金山桥开发区"
        },
        {
            "id": 2305,
            "name": "铜山经济技术开发区"
        },
        {
            "id": 2306,
            "name": "八段工业园区"
        },
        {
            "id": 2307,
            "name": "鼓楼区"
        },
        {
            "id": 2308,
            "name": "邳州市"
        },
        {
            "id": 2309,
            "name": "泉山区"
        },
        {
            "id": 2310,
            "name": "新沂市"
        },
        {
            "id": 2311,
            "name": "云龙区"
        },
        {
            "id": 2312,
            "name": "铜山区"
        },
        {
            "id": 2313,
            "name": "睢宁县"
        },
        {
            "id": 2314,
            "name": "沛县"
        },
        {
            "id": 2315,
            "name": "丰县"
        }],
        "id": 2316,
        "name": "徐州市"
    },
    {
        "child": [{
            "id": 2317,
            "name": "海州区"
        },
        {
            "id": 2318,
            "name": "赣榆区"
        },
        {
            "id": 2319,
            "name": "连云区"
        },
        {
            "id": 2320,
            "name": "灌云县"
        },
        {
            "id": 2321,
            "name": "东海县"
        },
        {
            "id": 2322,
            "name": "灌南县"
        }],
        "id": 2323,
        "name": "连云港市"
    },
    {
        "child": [{
            "id": 2324,
            "name": "经济开发区"
        },
        {
            "id": 2325,
            "name": "楚州区"
        },
        {
            "id": 2326,
            "name": "洪泽县"
        },
        {
            "id": 2327,
            "name": "金湖县"
        },
        {
            "id": 2328,
            "name": "盱眙县"
        },
        {
            "id": 2329,
            "name": "清河区"
        },
        {
            "id": 2330,
            "name": "淮阴区"
        },
        {
            "id": 2331,
            "name": "清浦区"
        },
        {
            "id": 2332,
            "name": "涟水县"
        }],
        "id": 2333,
        "name": "淮安市"
    },
    {
        "child": [{
            "id": 2334,
            "name": "宿城区"
        },
        {
            "id": 2335,
            "name": "沭阳县"
        },
        {
            "id": 2336,
            "name": "泗阳县"
        },
        {
            "id": 2337,
            "name": "宿豫区"
        },
        {
            "id": 2338,
            "name": "泗洪县"
        },
        {
            "id": 2339,
            "name": "宿迁经济开发区"
        }],
        "id": 2340,
        "name": "宿迁市"
    },
    {
        "child": [{
            "id": 2341,
            "name": "射阳县"
        },
        {
            "id": 2342,
            "name": "亭湖区"
        },
        {
            "id": 2343,
            "name": "盐都区"
        },
        {
            "id": 2344,
            "name": "东台市"
        },
        {
            "id": 2345,
            "name": "大丰区"
        },
        {
            "id": 2346,
            "name": "建湖县"
        },
        {
            "id": 2347,
            "name": "响水县"
        },
        {
            "id": 2348,
            "name": "阜宁县"
        },
        {
            "id": 2349,
            "name": "滨海县"
        }],
        "id": 2350,
        "name": "盐城市"
    },
    {
        "child": [{
            "id": 2351,
            "name": "广陵区"
        },
        {
            "id": 2352,
            "name": "邗江区"
        },
        {
            "id": 2353,
            "name": "宝应县"
        },
        {
            "id": 2354,
            "name": "仪征市"
        },
        {
            "id": 2355,
            "name": "高邮市"
        },
        {
            "id": 2356,
            "name": "江都区"
        }],
        "id": 2357,
        "name": "扬州市"
    },
    {
        "child": [{
            "id": 2358,
            "name": "海陵区"
        },
        {
            "id": 2359,
            "name": "高港区"
        },
        {
            "id": 2360,
            "name": "泰兴市"
        },
        {
            "id": 2361,
            "name": "靖江市"
        },
        {
            "id": 2362,
            "name": "兴化市"
        },
        {
            "id": 2363,
            "name": "姜堰区"
        }],
        "id": 2364,
        "name": "泰州市"
    },
    {
        "child": [{
            "id": 2365,
            "name": "港闸区"
        },
        {
            "id": 2366,
            "name": "崇川区"
        },
        {
            "id": 2367,
            "name": "通州区"
        },
        {
            "id": 2368,
            "name": "南通经济技术开发区"
        },
        {
            "id": 2369,
            "name": "如东县"
        },
        {
            "id": 2370,
            "name": "海安县"
        },
        {
            "id": 2371,
            "name": "如皋市"
        },
        {
            "id": 2372,
            "name": "海门市"
        },
        {
            "id": 2373,
            "name": "启东市"
        }],
        "id": 2374,
        "name": "南通市"
    },
    {
        "child": [{
            "id": 2375,
            "name": "润州区"
        },
        {
            "id": 2376,
            "name": "京口区"
        },
        {
            "id": 2377,
            "name": "丹徒区"
        },
        {
            "id": 2378,
            "name": "镇江新区"
        },
        {
            "id": 2379,
            "name": "丹阳市"
        },
        {
            "id": 2380,
            "name": "句容市"
        },
        {
            "id": 2381,
            "name": "扬中市"
        },
        {
            "id": 2382,
            "name": "丹徒新区"
        }],
        "id": 2383,
        "name": "镇江市"
    },
    {
        "child": [{
            "id": 2384,
            "name": "钟楼区"
        },
        {
            "id": 2385,
            "name": "天宁区"
        },
        {
            "id": 2386,
            "name": "武进区"
        },
        {
            "id": 2387,
            "name": "新北区"
        },
        {
            "id": 2388,
            "name": "金坛区"
        },
        {
            "id": 2389,
            "name": "溧阳市"
        }],
        "id": 2390,
        "name": "常州市"
    },
    {
        "child": [{
            "id": 2391,
            "name": "崇安区"
        },
        {
            "id": 2392,
            "name": "南长区"
        },
        {
            "id": 2393,
            "name": "北塘区"
        },
        {
            "id": 2394,
            "name": "锡山区"
        },
        {
            "id": 2395,
            "name": "惠山区"
        },
        {
            "id": 2396,
            "name": "新区"
        },
        {
            "id": 2397,
            "name": "江阴市"
        },
        {
            "id": 2398,
            "name": "宜兴市"
        },
        {
            "id": 2399,
            "name": "滨湖区"
        }],
        "id": 2400,
        "name": "无锡市"
    },
    {
        "child": [{
            "id": 2401,
            "name": "常熟市"
        },
        {
            "id": 2402,
            "name": "张家港市"
        },
        {
            "id": 2403,
            "name": "太仓市"
        },
        {
            "id": 2404,
            "name": "相城区"
        },
        {
            "id": 2405,
            "name": "金阊区"
        },
        {
            "id": 2406,
            "name": "虎丘区"
        },
        {
            "id": 2407,
            "name": "平江区"
        },
        {
            "id": 2408,
            "name": "沧浪区"
        },
        {
            "id": 2409,
            "name": "工业园区"
        },
        {
            "id": 2410,
            "name": "高新区"
        },
        {
            "id": 2411,
            "name": "吴江区"
        },
        {
            "id": 2412,
            "name": "吴中区"
        },
        {
            "id": 2413,
            "name": "昆山市"
        }],
        "id": 2414,
        "name": "苏州市"
    }]
},
{
    "id": 2415,
    "name": "山东",
    "child": [{
        "child": [{
            "id": 2416,
            "name": "河口区"
        },
        {
            "id": 2417,
            "name": "广饶县"
        },
        {
            "id": 2418,
            "name": "利津县"
        },
        {
            "id": 2419,
            "name": "垦利区"
        },
        {
            "id": 2420,
            "name": "东营区"
        }],
        "id": 2421,
        "name": "东营市"
    },
    {
        "child": [{
            "id": 2422,
            "name": "潍城区"
        },
        {
            "id": 2423,
            "name": "奎文区"
        },
        {
            "id": 2424,
            "name": "高新区"
        },
        {
            "id": 2425,
            "name": "寒亭区"
        },
        {
            "id": 2426,
            "name": "寿光市"
        },
        {
            "id": 2427,
            "name": "青州市"
        },
        {
            "id": 2428,
            "name": "诸城市"
        },
        {
            "id": 2429,
            "name": "安丘市"
        },
        {
            "id": 2430,
            "name": "高密市"
        },
        {
            "id": 2431,
            "name": "昌邑市"
        },
        {
            "id": 2432,
            "name": "昌乐县"
        },
        {
            "id": 2433,
            "name": "临朐县"
        },
        {
            "id": 2434,
            "name": "坊子区"
        }],
        "id": 2435,
        "name": "潍坊市"
    },
    {
        "child": [{
            "id": 2436,
            "name": "莱山区"
        },
        {
            "id": 2437,
            "name": "芝罘区"
        },
        {
            "id": 2438,
            "name": "开发区"
        },
        {
            "id": 2439,
            "name": "福山区"
        },
        {
            "id": 2440,
            "name": "牟平区"
        },
        {
            "id": 2441,
            "name": "龙口市"
        },
        {
            "id": 2442,
            "name": "莱州市"
        },
        {
            "id": 2443,
            "name": "莱阳市"
        },
        {
            "id": 2444,
            "name": "招远市"
        },
        {
            "id": 2445,
            "name": "蓬莱市"
        },
        {
            "id": 2446,
            "name": "栖霞市"
        },
        {
            "id": 2447,
            "name": "海阳市"
        },
        {
            "id": 2448,
            "name": "长岛县"
        }],
        "id": 2449,
        "name": "烟台市"
    },
    {
        "child": [{
            "id": 2450,
            "name": "荣成市"
        },
        {
            "id": 2451,
            "name": "文登市"
        },
        {
            "id": 2452,
            "name": "乳山市"
        },
        {
            "id": 2453,
            "name": "环翠区"
        }],
        "id": 2454,
        "name": "威海市"
    },
    {
        "child": [{
            "id": 2455,
            "name": "莱城区"
        },
        {
            "id": 2456,
            "name": "钢城区"
        }],
        "id": 2457,
        "name": "莱芜市"
    },
    {
        "child": [{
            "id": 2458,
            "name": "德城区"
        },
        {
            "id": 2459,
            "name": "临邑县"
        },
        {
            "id": 2460,
            "name": "齐河县"
        },
        {
            "id": 2461,
            "name": "乐陵市"
        },
        {
            "id": 2462,
            "name": "禹城市"
        },
        {
            "id": 2463,
            "name": "陵县"
        },
        {
            "id": 2464,
            "name": "宁津县"
        },
        {
            "id": 2465,
            "name": "武城县"
        },
        {
            "id": 2466,
            "name": "庆云县"
        },
        {
            "id": 2467,
            "name": "平原县"
        },
        {
            "id": 2468,
            "name": "夏津县"
        }],
        "id": 2469,
        "name": "德州市"
    },
    {
        "child": [{
            "id": 2470,
            "name": "兰陵县"
        },
        {
            "id": 2471,
            "name": "兰山区"
        },
        {
            "id": 2472,
            "name": "河东区"
        },
        {
            "id": 2473,
            "name": "沂南县"
        },
        {
            "id": 2474,
            "name": "沂水县"
        },
        {
            "id": 2475,
            "name": "费县"
        },
        {
            "id": 2476,
            "name": "平邑县"
        },
        {
            "id": 2477,
            "name": "蒙阴县"
        },
        {
            "id": 2478,
            "name": "临沭县"
        },
        {
            "id": 2479,
            "name": "莒南县"
        },
        {
            "id": 2480,
            "name": "郯城县"
        },
        {
            "id": 2481,
            "name": "罗庄区"
        }],
        "id": 2482,
        "name": "临沂市"
    },
    {
        "child": [{
            "id": 2483,
            "name": "东昌府区"
        },
        {
            "id": 2484,
            "name": "临清市"
        },
        {
            "id": 2485,
            "name": "阳谷县"
        },
        {
            "id": 2486,
            "name": "茌平县"
        },
        {
            "id": 2487,
            "name": "莘县"
        },
        {
            "id": 2488,
            "name": "东阿县"
        },
        {
            "id": 2489,
            "name": "冠县"
        },
        {
            "id": 2490,
            "name": "高唐县"
        }],
        "id": 2491,
        "name": "聊城市"
    },
    {
        "child": [{
            "id": 2492,
            "name": "北海新区"
        },
        {
            "id": 2493,
            "name": "滨城区"
        },
        {
            "id": 2494,
            "name": "邹平县"
        },
        {
            "id": 2495,
            "name": "沾化县"
        },
        {
            "id": 2496,
            "name": "惠民县"
        },
        {
            "id": 2497,
            "name": "博兴县"
        },
        {
            "id": 2498,
            "name": "阳信县"
        },
        {
            "id": 2499,
            "name": "无棣县"
        }],
        "id": 2500,
        "name": "滨州市"
    },
    {
        "child": [{
            "id": 2501,
            "name": "牡丹区"
        },
        {
            "id": 2502,
            "name": "单县"
        },
        {
            "id": 2503,
            "name": "曹县"
        },
        {
            "id": 2504,
            "name": "定陶县"
        },
        {
            "id": 2505,
            "name": "巨野县"
        },
        {
            "id": 2506,
            "name": "成武县"
        },
        {
            "id": 2507,
            "name": "东明县"
        },
        {
            "id": 2508,
            "name": "郓城县"
        },
        {
            "id": 2509,
            "name": "鄄城县"
        }],
        "id": 2510,
        "name": "菏泽市"
    },
    {
        "child": [{
            "id": 2511,
            "name": "岚山区"
        },
        {
            "id": 2512,
            "name": "新市区"
        },
        {
            "id": 2513,
            "name": "五莲县"
        },
        {
            "id": 2514,
            "name": "东港区"
        },
        {
            "id": 2515,
            "name": "莒县"
        }],
        "id": 2516,
        "name": "日照市"
    },
    {
        "child": [{
            "id": 2517,
            "name": "梁山县"
        },
        {
            "id": 2518,
            "name": "兖州市"
        },
        {
            "id": 2519,
            "name": "微山县"
        },
        {
            "id": 2520,
            "name": "汶上县"
        },
        {
            "id": 2521,
            "name": "泗水县"
        },
        {
            "id": 2522,
            "name": "嘉祥县"
        },
        {
            "id": 2523,
            "name": "鱼台县"
        },
        {
            "id": 2524,
            "name": "金乡县"
        },
        {
            "id": 2525,
            "name": "邹城市"
        },
        {
            "id": 2526,
            "name": "市中区"
        },
        {
            "id": 2527,
            "name": "曲阜市"
        },
        {
            "id": 2528,
            "name": "高新区"
        },
        {
            "id": 2529,
            "name": "任城区"
        }],
        "id": 2530,
        "name": "济宁市"
    },
    {
        "child": [{
            "id": 2531,
            "name": "东平县"
        },
        {
            "id": 2532,
            "name": "岱岳区"
        },
        {
            "id": 2533,
            "name": "泰山区"
        },
        {
            "id": 2534,
            "name": "肥城市"
        },
        {
            "id": 2535,
            "name": "新泰市"
        },
        {
            "id": 2536,
            "name": "宁阳县"
        }],
        "id": 2537,
        "name": "泰安市"
    },
    {
        "child": [{
            "id": 2538,
            "name": "高新区"
        },
        {
            "id": 2539,
            "name": "长清区"
        },
        {
            "id": 2540,
            "name": "历城区"
        },
        {
            "id": 2541,
            "name": "天桥区"
        },
        {
            "id": 2542,
            "name": "槐荫区"
        },
        {
            "id": 2543,
            "name": "历下区"
        },
        {
            "id": 2544,
            "name": "市中区"
        },
        {
            "id": 2545,
            "name": "章丘市"
        },
        {
            "id": 2546,
            "name": "平阴县"
        },
        {
            "id": 2547,
            "name": "济阳县"
        },
        {
            "id": 2548,
            "name": "商河县"
        }],
        "id": 2549,
        "name": "济南市"
    },
    {
        "child": [{
            "id": 2550,
            "name": "四方区"
        },
        {
            "id": 2551,
            "name": "市北区"
        },
        {
            "id": 2552,
            "name": "市南区"
        },
        {
            "id": 2553,
            "name": "黄岛区"
        },
        {
            "id": 2554,
            "name": "李沧区"
        },
        {
            "id": 2555,
            "name": "即墨市"
        },
        {
            "id": 2556,
            "name": "城阳区"
        },
        {
            "id": 2557,
            "name": "崂山区"
        },
        {
            "id": 2558,
            "name": "胶州市"
        },
        {
            "id": 2559,
            "name": "平度市"
        },
        {
            "id": 2560,
            "name": "莱西市"
        }],
        "id": 2561,
        "name": "青岛市"
    },
    {
        "child": [{
            "id": 2562,
            "name": "临淄区"
        },
        {
            "id": 2563,
            "name": "张店区"
        },
        {
            "id": 2564,
            "name": "周村区"
        },
        {
            "id": 2565,
            "name": "淄川区"
        },
        {
            "id": 2566,
            "name": "博山区"
        },
        {
            "id": 2567,
            "name": "高青县"
        },
        {
            "id": 2568,
            "name": "沂源县"
        },
        {
            "id": 2569,
            "name": "桓台县"
        }],
        "id": 2570,
        "name": "淄博市"
    },
    {
        "child": [{
            "id": 2571,
            "name": "滕州市"
        },
        {
            "id": 2572,
            "name": "山亭区"
        },
        {
            "id": 2573,
            "name": "台儿庄区"
        },
        {
            "id": 2574,
            "name": "峄城区"
        },
        {
            "id": 2575,
            "name": "薛城区"
        },
        {
            "id": 2576,
            "name": "市中区"
        }],
        "id": 2577,
        "name": "枣庄市"
    }]
},
{
    "id": 2578,
    "name": "安徽",
    "child": [{
        "child": [{
            "id": 2579,
            "name": "铜官区"
        },
        {
            "id": 2580,
            "name": "枞阳县"
        },
        {
            "id": 2581,
            "name": "郊区"
        },
        {
            "id": 2582,
            "name": "义安区"
        }],
        "id": 2583,
        "name": "铜陵市"
    },
    {
        "child": [{
            "id": 2584,
            "name": "包河区"
        },
        {
            "id": 2585,
            "name": "蜀山区"
        },
        {
            "id": 2586,
            "name": "瑶海区"
        },
        {
            "id": 2587,
            "name": "庐阳区"
        },
        {
            "id": 2588,
            "name": "滨湖新区"
        },
        {
            "id": 2589,
            "name": "经济技术开发区"
        },
        {
            "id": 2590,
            "name": "高新技术开发区"
        },
        {
            "id": 2591,
            "name": "新站综合开发试验区"
        },
        {
            "id": 2592,
            "name": "肥西县"
        },
        {
            "id": 2593,
            "name": "政务文化新区"
        },
        {
            "id": 2594,
            "name": "巢湖市"
        },
        {
            "id": 2595,
            "name": "长丰县"
        },
        {
            "id": 2596,
            "name": "肥东县"
        },
        {
            "id": 2597,
            "name": "庐江县"
        },
        {
            "id": 2598,
            "name": "北城新区"
        }],
        "id": 2599,
        "name": "合肥市"
    },
    {
        "child": [{
            "id": 2600,
            "name": "淮南高新技术开发区"
        },
        {
            "id": 2601,
            "name": "田家庵区"
        },
        {
            "id": 2602,
            "name": "大通区"
        },
        {
            "id": 2603,
            "name": "谢家集区"
        },
        {
            "id": 2604,
            "name": "八公山区"
        },
        {
            "id": 2605,
            "name": "寿县"
        },
        {
            "id": 2606,
            "name": "凤台县"
        },
        {
            "id": 2607,
            "name": "潘集区"
        }],
        "id": 2608,
        "name": "淮南市"
    },
    {
        "child": [{
            "id": 2609,
            "name": "杜集区"
        },
        {
            "id": 2610,
            "name": "烈山区"
        },
        {
            "id": 2611,
            "name": "濉溪县"
        },
        {
            "id": 2612,
            "name": "相山区"
        }],
        "id": 2613,
        "name": "淮北市"
    },
    {
        "child": [{
            "id": 2614,
            "name": "镜湖区"
        },
        {
            "id": 2615,
            "name": "弋江区"
        },
        {
            "id": 2616,
            "name": "无为县"
        },
        {
            "id": 2617,
            "name": "芜湖县"
        },
        {
            "id": 2618,
            "name": "繁昌县"
        },
        {
            "id": 2619,
            "name": "南陵县"
        },
        {
            "id": 2620,
            "name": "鸠江区"
        },
        {
            "id": 2621,
            "name": "三山区"
        }],
        "id": 2622,
        "name": "芜湖市"
    },
    {
        "child": [{
            "id": 2623,
            "name": "蚌山区"
        },
        {
            "id": 2624,
            "name": "怀远县"
        },
        {
            "id": 2625,
            "name": "固镇县"
        },
        {
            "id": 2626,
            "name": "五河县"
        },
        {
            "id": 2627,
            "name": "淮上区"
        },
        {
            "id": 2628,
            "name": "龙子湖区"
        },
        {
            "id": 2629,
            "name": "禹会区"
        }],
        "id": 2630,
        "name": "蚌埠市"
    },
    {
        "child": [{
            "id": 2631,
            "name": "博望区"
        },
        {
            "id": 2632,
            "name": "花山区"
        },
        {
            "id": 2633,
            "name": "雨山区"
        },
        {
            "id": 2634,
            "name": "当涂县"
        },
        {
            "id": 2635,
            "name": "含山县"
        },
        {
            "id": 2636,
            "name": "和县"
        }],
        "id": 2637,
        "name": "马鞍山市"
    },
    {
        "child": [{
            "id": 2638,
            "name": "桐城市"
        },
        {
            "id": 2639,
            "name": "宿松县"
        },
        {
            "id": 2640,
            "name": "太湖县"
        },
        {
            "id": 2641,
            "name": "怀宁县"
        },
        {
            "id": 2642,
            "name": "岳西县"
        },
        {
            "id": 2643,
            "name": "望江县"
        },
        {
            "id": 2644,
            "name": "潜山县"
        },
        {
            "id": 2645,
            "name": "大观区"
        },
        {
            "id": 2646,
            "name": "宜秀区"
        },
        {
            "id": 2647,
            "name": "迎江区"
        }],
        "id": 2648,
        "name": "安庆市"
    },
    {
        "child": [{
            "id": 2649,
            "name": "徽州区"
        },
        {
            "id": 2650,
            "name": "屯溪区"
        },
        {
            "id": 2651,
            "name": "休宁县"
        },
        {
            "id": 2652,
            "name": "歙县"
        },
        {
            "id": 2653,
            "name": "黟县"
        },
        {
            "id": 2654,
            "name": "祁门县"
        },
        {
            "id": 2655,
            "name": "黄山区"
        }],
        "id": 2656,
        "name": "黄山市"
    },
    {
        "child": [{
            "id": 2657,
            "name": "琅琊区"
        },
        {
            "id": 2658,
            "name": "天长市"
        },
        {
            "id": 2659,
            "name": "明光市"
        },
        {
            "id": 2660,
            "name": "全椒县"
        },
        {
            "id": 2661,
            "name": "来安县"
        },
        {
            "id": 2662,
            "name": "南谯区"
        },
        {
            "id": 2663,
            "name": "定远县"
        },
        {
            "id": 2664,
            "name": "凤阳县"
        }],
        "id": 2665,
        "name": "滁州市"
    },
    {
        "child": [{
            "id": 2666,
            "name": "经济开发区"
        },
        {
            "id": 2667,
            "name": "界首市"
        },
        {
            "id": 2668,
            "name": "太和县"
        },
        {
            "id": 2669,
            "name": "阜南县"
        },
        {
            "id": 2670,
            "name": "颍上县"
        },
        {
            "id": 2671,
            "name": "临泉县"
        },
        {
            "id": 2672,
            "name": "颍泉区"
        },
        {
            "id": 2673,
            "name": "颍州区"
        },
        {
            "id": 2674,
            "name": "颍东区"
        }],
        "id": 2675,
        "name": "阜阳市"
    },
    {
        "child": [{
            "id": 2676,
            "name": "利辛县"
        },
        {
            "id": 2677,
            "name": "蒙城县"
        },
        {
            "id": 2678,
            "name": "涡阳县"
        },
        {
            "id": 2679,
            "name": "谯城区"
        }],
        "id": 2680,
        "name": "亳州市"
    },
    {
        "child": [{
            "id": 2681,
            "name": "旌德县"
        },
        {
            "id": 2682,
            "name": "宁国市"
        },
        {
            "id": 2683,
            "name": "郎溪县"
        },
        {
            "id": 2684,
            "name": "广德县"
        },
        {
            "id": 2685,
            "name": "绩溪县"
        },
        {
            "id": 2686,
            "name": "泾县"
        },
        {
            "id": 2687,
            "name": "宣州区"
        }],
        "id": 2688,
        "name": "宣城市"
    },
    {
        "child": [{
            "id": 2689,
            "name": "经济开发区"
        },
        {
            "id": 2690,
            "name": "埇桥区"
        },
        {
            "id": 2691,
            "name": "灵璧县"
        },
        {
            "id": 2692,
            "name": "泗县"
        },
        {
            "id": 2693,
            "name": "萧县"
        },
        {
            "id": 2694,
            "name": "砀山县"
        }],
        "id": 2695,
        "name": "宿州市"
    },
    {
        "child": [{
            "id": 2696,
            "name": "贵池区"
        },
        {
            "id": 2697,
            "name": "东至县"
        },
        {
            "id": 2698,
            "name": "石台县"
        },
        {
            "id": 2699,
            "name": "青阳县"
        }],
        "id": 2700,
        "name": "池州市"
    },
    {
        "child": [{
            "id": 2701,
            "name": "霍山县"
        },
        {
            "id": 2702,
            "name": "金寨县"
        },
        {
            "id": 2703,
            "name": "霍邱县"
        },
        {
            "id": 2704,
            "name": "舒城县"
        },
        {
            "id": 2705,
            "name": "金安区"
        },
        {
            "id": 2706,
            "name": "裕安区"
        }],
        "id": 2707,
        "name": "六安市"
    }]
},
{
    "id": 2708,
    "name": "浙江",
    "child": [{
        "child": [{
            "id": 2709,
            "name": "龙泉市"
        },
        {
            "id": 2710,
            "name": "缙云县"
        },
        {
            "id": 2711,
            "name": "遂昌县"
        },
        {
            "id": 2712,
            "name": "松阳县"
        },
        {
            "id": 2713,
            "name": "景宁县"
        },
        {
            "id": 2714,
            "name": "云和县"
        },
        {
            "id": 2715,
            "name": "青田县"
        },
        {
            "id": 2716,
            "name": "莲都区"
        },
        {
            "id": 2717,
            "name": "庆元县"
        }],
        "id": 2718,
        "name": "丽水市"
    },
    {
        "child": [{
            "id": 2719,
            "name": "临海市"
        },
        {
            "id": 2720,
            "name": "三门县"
        },
        {
            "id": 2721,
            "name": "天台县"
        },
        {
            "id": 2722,
            "name": "仙居县"
        },
        {
            "id": 2723,
            "name": "黄岩区"
        },
        {
            "id": 2724,
            "name": "椒江区"
        },
        {
            "id": 2725,
            "name": "路桥区"
        },
        {
            "id": 2726,
            "name": "温岭市"
        },
        {
            "id": 2727,
            "name": "玉环县"
        }],
        "id": 2728,
        "name": "台州市"
    },
    {
        "child": [{
            "id": 2729,
            "name": "岱山县"
        },
        {
            "id": 2730,
            "name": "嵊泗县"
        },
        {
            "id": 2731,
            "name": "普陀区"
        },
        {
            "id": 2732,
            "name": "定海区"
        }],
        "id": 2733,
        "name": "舟山市"
    },
    {
        "child": [{
            "id": 2734,
            "name": "海曙区"
        },
        {
            "id": 2735,
            "name": "江东区"
        },
        {
            "id": 2736,
            "name": "高新科技开发区"
        },
        {
            "id": 2737,
            "name": "慈溪市"
        },
        {
            "id": 2738,
            "name": "北仑区"
        },
        {
            "id": 2739,
            "name": "镇海区"
        },
        {
            "id": 2740,
            "name": "鄞州区"
        },
        {
            "id": 2741,
            "name": "江北区"
        },
        {
            "id": 2742,
            "name": "余姚市"
        },
        {
            "id": 2743,
            "name": "奉化市"
        },
        {
            "id": 2744,
            "name": "宁海县"
        },
        {
            "id": 2745,
            "name": "象山县"
        }],
        "id": 2746,
        "name": "宁波市"
    },
    {
        "child": [{
            "id": 2747,
            "name": "上城区"
        },
        {
            "id": 2748,
            "name": "下城区"
        },
        {
            "id": 2749,
            "name": "拱墅区"
        },
        {
            "id": 2750,
            "name": "西湖区"
        },
        {
            "id": 2751,
            "name": "江干区"
        },
        {
            "id": 2752,
            "name": "下沙区"
        },
        {
            "id": 2753,
            "name": "余杭区"
        },
        {
            "id": 2754,
            "name": "萧山区"
        },
        {
            "id": 2755,
            "name": "滨江区"
        },
        {
            "id": 2756,
            "name": "临安市"
        },
        {
            "id": 2757,
            "name": "富阳区"
        },
        {
            "id": 2758,
            "name": "桐庐县"
        },
        {
            "id": 2759,
            "name": "建德市"
        },
        {
            "id": 2760,
            "name": "淳安县"
        }],
        "id": 2761,
        "name": "杭州市"
    },
    {
        "child": [{
            "id": 2762,
            "name": "龙湾区"
        },
        {
            "id": 2763,
            "name": "茶山高教园区"
        },
        {
            "id": 2764,
            "name": "瑞安市"
        },
        {
            "id": 2765,
            "name": "乐清市"
        },
        {
            "id": 2766,
            "name": "鹿城区"
        },
        {
            "id": 2767,
            "name": "瓯海区"
        },
        {
            "id": 2768,
            "name": "永嘉县"
        },
        {
            "id": 2769,
            "name": "文成县"
        },
        {
            "id": 2770,
            "name": "平阳县"
        },
        {
            "id": 2771,
            "name": "泰顺县"
        },
        {
            "id": 2772,
            "name": "洞头区"
        },
        {
            "id": 2773,
            "name": "苍南县"
        }],
        "id": 2774,
        "name": "温州市"
    },
    {
        "child": [{
            "id": 2775,
            "name": "桐乡市"
        },
        {
            "id": 2776,
            "name": "平湖市"
        },
        {
            "id": 2777,
            "name": "嘉善县"
        },
        {
            "id": 2778,
            "name": "南湖区"
        },
        {
            "id": 2779,
            "name": "秀洲区"
        },
        {
            "id": 2780,
            "name": "海宁市"
        },
        {
            "id": 2781,
            "name": "海盐县"
        }],
        "id": 2782,
        "name": "嘉兴市"
    },
    {
        "child": [{
            "id": 2783,
            "name": "南浔区"
        },
        {
            "id": 2784,
            "name": "吴兴区"
        },
        {
            "id": 2785,
            "name": "长兴县"
        },
        {
            "id": 2786,
            "name": "德清县"
        },
        {
            "id": 2787,
            "name": "安吉县"
        }],
        "id": 2788,
        "name": "湖州市"
    },
    {
        "child": [{
            "id": 2789,
            "name": "柯桥区"
        },
        {
            "id": 2790,
            "name": "越城区"
        },
        {
            "id": 2791,
            "name": "诸暨市"
        },
        {
            "id": 2792,
            "name": "上虞区"
        },
        {
            "id": 2793,
            "name": "嵊州市"
        },
        {
            "id": 2794,
            "name": "新昌县"
        }],
        "id": 2795,
        "name": "绍兴市"
    },
    {
        "child": [{
            "id": 2796,
            "name": "金东区"
        },
        {
            "id": 2797,
            "name": "婺城区"
        },
        {
            "id": 2798,
            "name": "兰溪市"
        },
        {
            "id": 2799,
            "name": "武义县"
        },
        {
            "id": 2800,
            "name": "浦江县"
        },
        {
            "id": 2801,
            "name": "磐安县"
        },
        {
            "id": 2802,
            "name": "义乌市"
        },
        {
            "id": 2803,
            "name": "永康市"
        },
        {
            "id": 2804,
            "name": "东阳市"
        }],
        "id": 2805,
        "name": "金华市"
    },
    {
        "child": [{
            "id": 2806,
            "name": "柯城区"
        },
        {
            "id": 2807,
            "name": "衢江区"
        },
        {
            "id": 2808,
            "name": "江山市"
        },
        {
            "id": 2809,
            "name": "常山县"
        },
        {
            "id": 2810,
            "name": "开化县"
        },
        {
            "id": 2811,
            "name": "龙游县"
        }],
        "id": 2812,
        "name": "衢州市"
    }]
},
{
    "id": 2813,
    "name": "福建",
    "child": [{
        "child": [{
            "id": 2814,
            "name": "台江区"
        },
        {
            "id": 2815,
            "name": "鼓楼区"
        },
        {
            "id": 2816,
            "name": "晋安区"
        },
        {
            "id": 2817,
            "name": "仓山区"
        },
        {
            "id": 2818,
            "name": "马尾区"
        },
        {
            "id": 2819,
            "name": "福清市"
        },
        {
            "id": 2820,
            "name": "闽侯县"
        },
        {
            "id": 2821,
            "name": "长乐市"
        },
        {
            "id": 2822,
            "name": "平潭县"
        },
        {
            "id": 2823,
            "name": "连江县"
        },
        {
            "id": 2824,
            "name": "罗源县"
        },
        {
            "id": 2825,
            "name": "永泰县"
        },
        {
            "id": 2826,
            "name": "闽清县"
        }],
        "id": 2827,
        "name": "福州市"
    },
    {
        "child": [{
            "id": 2828,
            "name": "思明区"
        },
        {
            "id": 2829,
            "name": "湖里区"
        },
        {
            "id": 2830,
            "name": "翔安区"
        },
        {
            "id": 2831,
            "name": "海沧区"
        },
        {
            "id": 2832,
            "name": "集美区"
        },
        {
            "id": 2833,
            "name": "同安区"
        }],
        "id": 2834,
        "name": "厦门市"
    },
    {
        "child": [{
            "id": 2835,
            "name": "永安市"
        },
        {
            "id": 2836,
            "name": "明溪县"
        },
        {
            "id": 2837,
            "name": "将乐县"
        },
        {
            "id": 2838,
            "name": "大田县"
        },
        {
            "id": 2839,
            "name": "宁化县"
        },
        {
            "id": 2840,
            "name": "建宁县"
        },
        {
            "id": 2841,
            "name": "沙县"
        },
        {
            "id": 2842,
            "name": "尤溪县"
        },
        {
            "id": 2843,
            "name": "清流县"
        },
        {
            "id": 2844,
            "name": "泰宁县"
        },
        {
            "id": 2845,
            "name": "梅列区"
        },
        {
            "id": 2846,
            "name": "三元区"
        }],
        "id": 2847,
        "name": "三明市"
    },
    {
        "child": [{
            "id": 2848,
            "name": "仙游县"
        },
        {
            "id": 2849,
            "name": "城厢区"
        },
        {
            "id": 2850,
            "name": "荔城区"
        },
        {
            "id": 2851,
            "name": "秀屿区"
        },
        {
            "id": 2852,
            "name": "涵江区"
        }],
        "id": 2853,
        "name": "莆田市"
    },
    {
        "child": [{
            "id": 2854,
            "name": "泉港区"
        },
        {
            "id": 2855,
            "name": "石狮市"
        },
        {
            "id": 2856,
            "name": "南安市"
        },
        {
            "id": 2857,
            "name": "惠安县"
        },
        {
            "id": 2858,
            "name": "安溪县"
        },
        {
            "id": 2859,
            "name": "德化县"
        },
        {
            "id": 2860,
            "name": "永春县"
        },
        {
            "id": 2861,
            "name": "金门县"
        },
        {
            "id": 2862,
            "name": "洛江区"
        },
        {
            "id": 2863,
            "name": "鲤城区"
        },
        {
            "id": 2864,
            "name": "丰泽区"
        },
        {
            "id": 2865,
            "name": "晋江市"
        }],
        "id": 2866,
        "name": "泉州市"
    },
    {
        "child": [{
            "id": 2867,
            "name": "芗城区"
        },
        {
            "id": 2868,
            "name": "龙文区"
        },
        {
            "id": 2869,
            "name": "龙海市"
        },
        {
            "id": 2870,
            "name": "平和县"
        },
        {
            "id": 2871,
            "name": "南靖县"
        },
        {
            "id": 2872,
            "name": "诏安县"
        },
        {
            "id": 2873,
            "name": "漳浦县"
        },
        {
            "id": 2874,
            "name": "华安县"
        },
        {
            "id": 2875,
            "name": "云霄县"
        },
        {
            "id": 2876,
            "name": "东山县"
        },
        {
            "id": 2877,
            "name": "长泰县"
        }],
        "id": 2878,
        "name": "漳州市"
    },
    {
        "child": [{
            "id": 2879,
            "name": "建瓯市"
        },
        {
            "id": 2880,
            "name": "邵武市"
        },
        {
            "id": 2881,
            "name": "武夷山市"
        },
        {
            "id": 2882,
            "name": "建阳市"
        },
        {
            "id": 2883,
            "name": "松溪县"
        },
        {
            "id": 2884,
            "name": "顺昌县"
        },
        {
            "id": 2885,
            "name": "浦城县"
        },
        {
            "id": 2886,
            "name": "政和县"
        },
        {
            "id": 2887,
            "name": "光泽县"
        },
        {
            "id": 2888,
            "name": "延平区"
        }],
        "id": 2889,
        "name": "南平市"
    },
    {
        "child": [{
            "id": 2890,
            "name": "新罗区"
        },
        {
            "id": 2891,
            "name": "漳平市"
        },
        {
            "id": 2892,
            "name": "长汀县"
        },
        {
            "id": 2893,
            "name": "武平县"
        },
        {
            "id": 2894,
            "name": "永定县"
        },
        {
            "id": 2895,
            "name": "上杭县"
        },
        {
            "id": 2896,
            "name": "连城县"
        }],
        "id": 2897,
        "name": "龙岩市"
    },
    {
        "child": [{
            "id": 2898,
            "name": "蕉城区"
        },
        {
            "id": 2899,
            "name": "东侨开发区"
        },
        {
            "id": 2900,
            "name": "福安市"
        },
        {
            "id": 2901,
            "name": "福鼎市"
        },
        {
            "id": 2902,
            "name": "寿宁县"
        },
        {
            "id": 2903,
            "name": "霞浦县"
        },
        {
            "id": 2904,
            "name": "柘荣县"
        },
        {
            "id": 2905,
            "name": "屏南县"
        },
        {
            "id": 2906,
            "name": "古田县"
        },
        {
            "id": 2907,
            "name": "周宁县"
        }],
        "id": 2908,
        "name": "宁德市"
    }]
},
{
    "id": 2909,
    "name": "湖北",
    "child": [{
        "child": [{
            "id": 2910,
            "name": "松柏镇"
        },
        {
            "id": 2911,
            "name": "阳日镇"
        },
        {
            "id": 2912,
            "name": "木鱼镇"
        },
        {
            "id": 2913,
            "name": "红坪镇"
        },
        {
            "id": 2914,
            "name": "新华镇"
        },
        {
            "id": 2915,
            "name": "宋洛乡"
        },
        {
            "id": 2916,
            "name": "九湖乡"
        },
        {
            "id": 2917,
            "name": "下谷坪乡"
        }],
        "id": 2918,
        "name": "神农架林区"
    },
    {
        "child": [{
            "id": 2919,
            "name": "硚口区"
        },
        {
            "id": 2920,
            "name": "武昌区"
        },
        {
            "id": 2921,
            "name": "武汉经济技术开发区"
        },
        {
            "id": 2922,
            "name": "江岸区"
        },
        {
            "id": 2923,
            "name": "江汉区"
        },
        {
            "id": 2924,
            "name": "蔡甸区"
        },
        {
            "id": 2925,
            "name": "江夏区"
        },
        {
            "id": 2926,
            "name": "新洲区"
        },
        {
            "id": 2927,
            "name": "黄陂区"
        },
        {
            "id": 2928,
            "name": "汉阳区"
        },
        {
            "id": 2929,
            "name": "青山区"
        },
        {
            "id": 2930,
            "name": "洪山区"
        },
        {
            "id": 2931,
            "name": "汉南区"
        },
        {
            "id": 2932,
            "name": "东西湖区"
        }],
        "id": 2933,
        "name": "武汉市"
    },
    {
        "child": [{
            "id": 2934,
            "name": "园林"
        },
        {
            "id": 2935,
            "name": "杨市"
        },
        {
            "id": 2936,
            "name": "周矶"
        },
        {
            "id": 2937,
            "name": "广华"
        },
        {
            "id": 2938,
            "name": "泰丰"
        },
        {
            "id": 2939,
            "name": "竹根滩镇"
        },
        {
            "id": 2940,
            "name": "高石碑镇"
        },
        {
            "id": 2941,
            "name": "积玉口镇"
        },
        {
            "id": 2942,
            "name": "渔洋镇"
        },
        {
            "id": 2943,
            "name": "王场镇"
        },
        {
            "id": 2944,
            "name": "熊口镇"
        },
        {
            "id": 2945,
            "name": "老新镇"
        },
        {
            "id": 2946,
            "name": "浩口镇"
        },
        {
            "id": 2947,
            "name": "张金镇"
        },
        {
            "id": 2948,
            "name": "龙湾镇"
        },
        {
            "id": 2949,
            "name": "江汉石油管理局"
        },
        {
            "id": 2950,
            "name": "潜江经济开发区"
        },
        {
            "id": 2951,
            "name": "西大垸管理区"
        },
        {
            "id": 2952,
            "name": "运粮湖管理区"
        },
        {
            "id": 2953,
            "name": "周矶管理区"
        },
        {
            "id": 2954,
            "name": "后湖管理区"
        },
        {
            "id": 2955,
            "name": "熊口管理区"
        },
        {
            "id": 2956,
            "name": "总口管理区"
        },
        {
            "id": 2957,
            "name": "高场原种场"
        },
        {
            "id": 2958,
            "name": "浩口原种场"
        }],
        "id": 2959,
        "name": "潜江市"
    },
    {
        "child": [{
            "id": 2960,
            "name": "黄石港区"
        },
        {
            "id": 2961,
            "name": "下陆区"
        },
        {
            "id": 2962,
            "name": "西塞山区"
        },
        {
            "id": 2963,
            "name": "铁山区"
        },
        {
            "id": 2964,
            "name": "大冶市"
        },
        {
            "id": 2965,
            "name": "阳新县"
        },
        {
            "id": 2966,
            "name": "经济技术开发区"
        }],
        "id": 2967,
        "name": "黄石市"
    },
    {
        "child": [{
            "id": 2968,
            "name": "老河口市"
        },
        {
            "id": 2969,
            "name": "枣阳市"
        },
        {
            "id": 2970,
            "name": "宜城市"
        },
        {
            "id": 2971,
            "name": "南漳县"
        },
        {
            "id": 2972,
            "name": "保康县"
        },
        {
            "id": 2973,
            "name": "谷城县"
        },
        {
            "id": 2974,
            "name": "樊城区"
        },
        {
            "id": 2975,
            "name": "襄城区"
        },
        {
            "id": 2976,
            "name": "襄州区"
        }],
        "id": 2977,
        "name": "襄阳市"
    },
    {
        "child": [{
            "id": 2978,
            "name": "丹江口市"
        },
        {
            "id": 2979,
            "name": "房县"
        },
        {
            "id": 2980,
            "name": "竹山县"
        },
        {
            "id": 2981,
            "name": "竹溪县"
        },
        {
            "id": 2982,
            "name": "郧县"
        },
        {
            "id": 2983,
            "name": "郧西县"
        },
        {
            "id": 2984,
            "name": "茅箭区"
        },
        {
            "id": 2985,
            "name": "张湾区"
        }],
        "id": 2986,
        "name": "十堰市"
    },
    {
        "child": [{
            "id": 2987,
            "name": "沙市区"
        },
        {
            "id": 2988,
            "name": "荆州区"
        },
        {
            "id": 2989,
            "name": "江陵县"
        },
        {
            "id": 2990,
            "name": "洪湖市"
        },
        {
            "id": 2991,
            "name": "石首市"
        },
        {
            "id": 2992,
            "name": "松滋市"
        },
        {
            "id": 2993,
            "name": "监利县"
        },
        {
            "id": 2994,
            "name": "公安县"
        }],
        "id": 2995,
        "name": "荆州市"
    },
    {
        "child": [{
            "id": 2996,
            "name": "伍家岗区"
        },
        {
            "id": 2997,
            "name": "西陵区"
        },
        {
            "id": 2998,
            "name": "宜都市"
        },
        {
            "id": 2999,
            "name": "猇亭区"
        },
        {
            "id": 3000,
            "name": "点军区"
        },
        {
            "id": 3001,
            "name": "当阳市"
        },
        {
            "id": 3002,
            "name": "枝江市"
        },
        {
            "id": 3003,
            "name": "夷陵区"
        },
        {
            "id": 3004,
            "name": "秭归县"
        },
        {
            "id": 3005,
            "name": "兴山县"
        },
        {
            "id": 3006,
            "name": "远安县"
        },
        {
            "id": 3007,
            "name": "五峰土家族自治县"
        },
        {
            "id": 3008,
            "name": "长阳土家族自治县"
        }],
        "id": 3009,
        "name": "宜昌市"
    },
    {
        "child": [{
            "id": 3010,
            "name": "汉川市"
        },
        {
            "id": 3011,
            "name": "云梦县"
        },
        {
            "id": 3012,
            "name": "大悟县"
        },
        {
            "id": 3013,
            "name": "孝昌县"
        },
        {
            "id": 3014,
            "name": "孝南区"
        },
        {
            "id": 3015,
            "name": "应城市"
        },
        {
            "id": 3016,
            "name": "安陆市"
        }],
        "id": 3017,
        "name": "孝感市"
    },
    {
        "child": [{
            "id": 3018,
            "name": "黄州区"
        },
        {
            "id": 3019,
            "name": "蕲春县"
        },
        {
            "id": 3020,
            "name": "麻城市"
        },
        {
            "id": 3021,
            "name": "武穴市"
        },
        {
            "id": 3022,
            "name": "浠水县"
        },
        {
            "id": 3023,
            "name": "红安县"
        },
        {
            "id": 3024,
            "name": "罗田县"
        },
        {
            "id": 3025,
            "name": "黄梅县"
        },
        {
            "id": 3026,
            "name": "英山县"
        },
        {
            "id": 3027,
            "name": "团风县"
        }],
        "id": 3028,
        "name": "黄冈市"
    },
    {
        "child": [{
            "id": 3029,
            "name": "侨乡街道开发区"
        },
        {
            "id": 3030,
            "name": "竟陵街道"
        },
        {
            "id": 3031,
            "name": "杨林街道"
        },
        {
            "id": 3032,
            "name": "佛子山镇"
        },
        {
            "id": 3033,
            "name": "多宝镇"
        },
        {
            "id": 3034,
            "name": "拖市镇"
        },
        {
            "id": 3035,
            "name": "张港镇"
        },
        {
            "id": 3036,
            "name": "蒋场镇"
        },
        {
            "id": 3037,
            "name": "汪场镇"
        },
        {
            "id": 3038,
            "name": "渔薪镇"
        },
        {
            "id": 3039,
            "name": "黄潭镇"
        },
        {
            "id": 3040,
            "name": "岳口镇"
        },
        {
            "id": 3041,
            "name": "横林镇"
        },
        {
            "id": 3042,
            "name": "彭市镇"
        },
        {
            "id": 3043,
            "name": "麻洋镇"
        },
        {
            "id": 3044,
            "name": "多祥镇"
        },
        {
            "id": 3045,
            "name": "干驿镇"
        },
        {
            "id": 3046,
            "name": "马湾镇"
        },
        {
            "id": 3047,
            "name": "卢市镇"
        },
        {
            "id": 3048,
            "name": "小板镇"
        },
        {
            "id": 3049,
            "name": "九真镇"
        },
        {
            "id": 3050,
            "name": "皂市镇"
        },
        {
            "id": 3051,
            "name": "胡市镇"
        },
        {
            "id": 3052,
            "name": "石河镇"
        },
        {
            "id": 3053,
            "name": "净潭乡"
        },
        {
            "id": 3054,
            "name": "蒋湖农场"
        },
        {
            "id": 3055,
            "name": "白茅湖农场"
        },
        {
            "id": 3056,
            "name": "沉湖管委会"
        }],
        "id": 3057,
        "name": "天门市"
    },
    {
        "child": [{
            "id": 3058,
            "name": "城区"
        },
        {
            "id": 3059,
            "name": "郑场镇"
        },
        {
            "id": 3060,
            "name": "毛嘴镇"
        },
        {
            "id": 3061,
            "name": "豆河镇"
        },
        {
            "id": 3062,
            "name": "三伏潭镇"
        },
        {
            "id": 3063,
            "name": "胡场镇"
        },
        {
            "id": 3064,
            "name": "长埫口镇"
        },
        {
            "id": 3065,
            "name": "西流河镇"
        },
        {
            "id": 3066,
            "name": "沙湖镇"
        },
        {
            "id": 3067,
            "name": "杨林尾镇"
        },
        {
            "id": 3068,
            "name": "彭场镇"
        },
        {
            "id": 3069,
            "name": "张沟镇"
        },
        {
            "id": 3070,
            "name": "郭河镇"
        },
        {
            "id": 3071,
            "name": "沔城镇"
        },
        {
            "id": 3072,
            "name": "通海口镇"
        },
        {
            "id": 3073,
            "name": "陈场镇"
        },
        {
            "id": 3074,
            "name": "工业园区"
        },
        {
            "id": 3075,
            "name": "九合垸原种场"
        },
        {
            "id": 3076,
            "name": "沙湖原种场"
        },
        {
            "id": 3077,
            "name": "排湖渔场"
        },
        {
            "id": 3078,
            "name": "五湖渔场"
        },
        {
            "id": 3079,
            "name": "赵西垸林场"
        },
        {
            "id": 3080,
            "name": "刘家垸林场"
        },
        {
            "id": 3081,
            "name": "畜禽良种场"
        }],
        "id": 3082,
        "name": "仙桃市"
    },
    {
        "child": [{
            "id": 3083,
            "name": "咸安区"
        },
        {
            "id": 3084,
            "name": "赤壁市"
        },
        {
            "id": 3085,
            "name": "嘉鱼县"
        },
        {
            "id": 3086,
            "name": "通山县"
        },
        {
            "id": 3087,
            "name": "崇阳县"
        },
        {
            "id": 3088,
            "name": "通城县"
        }],
        "id": 3089,
        "name": "咸宁市"
    },
    {
        "child": [{
            "id": 3090,
            "name": "恩施市"
        },
        {
            "id": 3091,
            "name": "利川市"
        },
        {
            "id": 3092,
            "name": "建始县"
        },
        {
            "id": 3093,
            "name": "来凤县"
        },
        {
            "id": 3094,
            "name": "巴东县"
        },
        {
            "id": 3095,
            "name": "鹤峰县"
        },
        {
            "id": 3096,
            "name": "宣恩县"
        },
        {
            "id": 3097,
            "name": "咸丰县"
        }],
        "id": 3098,
        "name": "恩施州"
    },
    {
        "child": [{
            "id": 3099,
            "name": "梁子湖区"
        },
        {
            "id": 3100,
            "name": "华容区"
        },
        {
            "id": 3101,
            "name": "鄂城区"
        }],
        "id": 3102,
        "name": "鄂州市"
    },
    {
        "child": [{
            "id": 3103,
            "name": "东宝区"
        },
        {
            "id": 3104,
            "name": "掇刀区"
        },
        {
            "id": 3105,
            "name": "钟祥市"
        },
        {
            "id": 3106,
            "name": "京山县"
        },
        {
            "id": 3107,
            "name": "沙洋县"
        }],
        "id": 3108,
        "name": "荆门市"
    },
    {
        "child": [{
            "id": 3109,
            "name": "曾都区"
        },
        {
            "id": 3110,
            "name": "广水市"
        },
        {
            "id": 3111,
            "name": "随县"
        }],
        "id": 3112,
        "name": "随州市"
    }]
},
{
    "id": 3113,
    "name": "湖南",
    "child": [{
        "child": [{
            "id": 3114,
            "name": "慈利县"
        },
        {
            "id": 3115,
            "name": "桑植县"
        },
        {
            "id": 3116,
            "name": "武陵源区"
        },
        {
            "id": 3117,
            "name": "永定区"
        }],
        "id": 3118,
        "name": "张家界市"
    },
    {
        "child": [{
            "id": 3119,
            "name": "资兴市"
        },
        {
            "id": 3120,
            "name": "宜章县"
        },
        {
            "id": 3121,
            "name": "安仁县"
        },
        {
            "id": 3122,
            "name": "汝城县"
        },
        {
            "id": 3123,
            "name": "嘉禾县"
        },
        {
            "id": 3124,
            "name": "临武县"
        },
        {
            "id": 3125,
            "name": "桂东县"
        },
        {
            "id": 3126,
            "name": "永兴县"
        },
        {
            "id": 3127,
            "name": "桂阳县"
        },
        {
            "id": 3128,
            "name": "北湖区"
        },
        {
            "id": 3129,
            "name": "苏仙区"
        }],
        "id": 3130,
        "name": "郴州市"
    },
    {
        "child": [{
            "id": 3131,
            "name": "南县"
        },
        {
            "id": 3132,
            "name": "桃江县"
        },
        {
            "id": 3133,
            "name": "安化县"
        },
        {
            "id": 3134,
            "name": "赫山区"
        },
        {
            "id": 3135,
            "name": "资阳区"
        },
        {
            "id": 3136,
            "name": "沅江市"
        }],
        "id": 3137,
        "name": "益阳市"
    },
    {
        "child": [{
            "id": 3138,
            "name": "冷水滩区"
        },
        {
            "id": 3139,
            "name": "祁阳县"
        },
        {
            "id": 3140,
            "name": "双牌县"
        },
        {
            "id": 3141,
            "name": "道县"
        },
        {
            "id": 3142,
            "name": "江永县"
        },
        {
            "id": 3143,
            "name": "江华县"
        },
        {
            "id": 3144,
            "name": "宁远县"
        },
        {
            "id": 3145,
            "name": "新田县"
        },
        {
            "id": 3146,
            "name": "蓝山县"
        },
        {
            "id": 3147,
            "name": "东安县"
        },
        {
            "id": 3148,
            "name": "零陵区"
        }],
        "id": 3149,
        "name": "永州市"
    },
    {
        "child": [{
            "id": 3150,
            "name": "鹤城区"
        },
        {
            "id": 3151,
            "name": "洪江市"
        },
        {
            "id": 3152,
            "name": "会同县"
        },
        {
            "id": 3153,
            "name": "溆浦县"
        },
        {
            "id": 3154,
            "name": "中方县"
        },
        {
            "id": 3155,
            "name": "辰溪县"
        },
        {
            "id": 3156,
            "name": "靖州县"
        },
        {
            "id": 3157,
            "name": "通道县"
        },
        {
            "id": 3158,
            "name": "芷江县"
        },
        {
            "id": 3159,
            "name": "新晃县"
        },
        {
            "id": 3160,
            "name": "麻阳县"
        },
        {
            "id": 3161,
            "name": "沅陵县"
        }],
        "id": 3162,
        "name": "怀化市"
    },
    {
        "child": [{
            "id": 3163,
            "name": "娄星区"
        },
        {
            "id": 3164,
            "name": "冷水江市"
        },
        {
            "id": 3165,
            "name": "涟源市"
        },
        {
            "id": 3166,
            "name": "新化县"
        },
        {
            "id": 3167,
            "name": "双峰县"
        }],
        "id": 3168,
        "name": "娄底市"
    },
    {
        "child": [{
            "id": 3169,
            "name": "吉首市"
        },
        {
            "id": 3170,
            "name": "古丈县"
        },
        {
            "id": 3171,
            "name": "龙山县"
        },
        {
            "id": 3172,
            "name": "永顺县"
        },
        {
            "id": 3173,
            "name": "泸溪县"
        },
        {
            "id": 3174,
            "name": "凤凰县"
        },
        {
            "id": 3175,
            "name": "花垣县"
        },
        {
            "id": 3176,
            "name": "保靖县"
        }],
        "id": 3177,
        "name": "湘西州"
    },
    {
        "child": [{
            "id": 3178,
            "name": "芙蓉区"
        },
        {
            "id": 3179,
            "name": "岳麓区"
        },
        {
            "id": 3180,
            "name": "雨花区"
        },
        {
            "id": 3181,
            "name": "开福区"
        },
        {
            "id": 3182,
            "name": "天心区"
        },
        {
            "id": 3183,
            "name": "浏阳市"
        },
        {
            "id": 3184,
            "name": "长沙县"
        },
        {
            "id": 3185,
            "name": "宁乡县"
        },
        {
            "id": 3186,
            "name": "望城区"
        }],
        "id": 3187,
        "name": "长沙市"
    },
    {
        "child": [{
            "id": 3188,
            "name": "天元区"
        },
        {
            "id": 3189,
            "name": "石峰区"
        },
        {
            "id": 3190,
            "name": "芦淞区"
        },
        {
            "id": 3191,
            "name": "荷塘区"
        },
        {
            "id": 3192,
            "name": "醴陵市"
        },
        {
            "id": 3193,
            "name": "株洲县"
        },
        {
            "id": 3194,
            "name": "攸县"
        },
        {
            "id": 3195,
            "name": "茶陵县"
        },
        {
            "id": 3196,
            "name": "炎陵县"
        }],
        "id": 3197,
        "name": "株洲市"
    },
    {
        "child": [{
            "id": 3198,
            "name": "雨湖区"
        },
        {
            "id": 3199,
            "name": "岳塘区"
        },
        {
            "id": 3200,
            "name": "湘乡市"
        },
        {
            "id": 3201,
            "name": "湘潭县"
        },
        {
            "id": 3202,
            "name": "韶山市"
        }],
        "id": 3203,
        "name": "湘潭市"
    },
    {
        "child": [{
            "id": 3204,
            "name": "蒸湘区"
        },
        {
            "id": 3205,
            "name": "石鼓区"
        },
        {
            "id": 3206,
            "name": "珠晖区"
        },
        {
            "id": 3207,
            "name": "雁峰区"
        },
        {
            "id": 3208,
            "name": "常宁市"
        },
        {
            "id": 3209,
            "name": "衡阳县"
        },
        {
            "id": 3210,
            "name": "耒阳市"
        },
        {
            "id": 3211,
            "name": "衡东县"
        },
        {
            "id": 3212,
            "name": "衡南县"
        },
        {
            "id": 3213,
            "name": "衡山县"
        },
        {
            "id": 3214,
            "name": "祁东县"
        },
        {
            "id": 3215,
            "name": "南岳区"
        }],
        "id": 3216,
        "name": "衡阳市"
    },
    {
        "child": [{
            "id": 3217,
            "name": "大祥区"
        },
        {
            "id": 3218,
            "name": "双清区"
        },
        {
            "id": 3219,
            "name": "北塔区"
        },
        {
            "id": 3220,
            "name": "武冈市"
        },
        {
            "id": 3221,
            "name": "邵东县"
        },
        {
            "id": 3222,
            "name": "洞口县"
        },
        {
            "id": 3223,
            "name": "新邵县"
        },
        {
            "id": 3224,
            "name": "绥宁县"
        },
        {
            "id": 3225,
            "name": "新宁县"
        },
        {
            "id": 3226,
            "name": "邵阳县"
        },
        {
            "id": 3227,
            "name": "隆回县"
        },
        {
            "id": 3228,
            "name": "城步县"
        }],
        "id": 3229,
        "name": "邵阳市"
    },
    {
        "child": [{
            "id": 3230,
            "name": "岳阳楼区"
        },
        {
            "id": 3231,
            "name": "君山区"
        },
        {
            "id": 3232,
            "name": "云溪区"
        },
        {
            "id": 3233,
            "name": "临湘市"
        },
        {
            "id": 3234,
            "name": "汨罗市"
        },
        {
            "id": 3235,
            "name": "岳阳县"
        },
        {
            "id": 3236,
            "name": "湘阴县"
        },
        {
            "id": 3237,
            "name": "华容县"
        },
        {
            "id": 3238,
            "name": "平江县"
        }],
        "id": 3239,
        "name": "岳阳市"
    },
    {
        "child": [{
            "id": 3240,
            "name": "汉寿县"
        },
        {
            "id": 3241,
            "name": "石门县"
        },
        {
            "id": 3242,
            "name": "安乡县"
        },
        {
            "id": 3243,
            "name": "鼎城区"
        },
        {
            "id": 3244,
            "name": "武陵区"
        },
        {
            "id": 3245,
            "name": "津市市"
        },
        {
            "id": 3246,
            "name": "澧县"
        },
        {
            "id": 3247,
            "name": "临澧县"
        },
        {
            "id": 3248,
            "name": "桃源县"
        }],
        "id": 3249,
        "name": "常德市"
    }]
},
{
    "id": 3250,
    "name": "广东",
    "child": [{
        "child": [{
            "id": 3251,
            "name": "天河区"
        },
        {
            "id": 3252,
            "name": "海珠区"
        },
        {
            "id": 3253,
            "name": "荔湾区"
        },
        {
            "id": 3254,
            "name": "越秀区"
        },
        {
            "id": 3255,
            "name": "番禺区"
        },
        {
            "id": 3256,
            "name": "花都区"
        },
        {
            "id": 3257,
            "name": "萝岗区"
        },
        {
            "id": 3258,
            "name": "白云区"
        },
        {
            "id": 3259,
            "name": "南沙区"
        },
        {
            "id": 3260,
            "name": "黄埔区"
        },
        {
            "id": 3261,
            "name": "增城区"
        },
        {
            "id": 3262,
            "name": "从化区"
        },
        {
            "id": 3263,
            "name": "广州大学城"
        }],
        "id": 3264,
        "name": "广州市"
    },
    {
        "child": [{
            "id": 3265,
            "name": "罗湖区"
        },
        {
            "id": 3266,
            "name": "福田区"
        },
        {
            "id": 3267,
            "name": "南山区"
        },
        {
            "id": 3268,
            "name": "宝安区"
        },
        {
            "id": 3269,
            "name": "光明新区"
        },
        {
            "id": 3270,
            "name": "龙岗区"
        },
        {
            "id": 3271,
            "name": "坪山新区"
        },
        {
            "id": 3272,
            "name": "盐田区"
        },
        {
            "id": 3273,
            "name": "龙华新区"
        },
        {
            "id": 3274,
            "name": "大鹏新区"
        }],
        "id": 3275,
        "name": "深圳市"
    },
    {
        "child": [{
            "id": 3276,
            "name": "斗门区"
        },
        {
            "id": 3277,
            "name": "金湾区"
        },
        {
            "id": 3278,
            "name": "香洲区"
        }],
        "id": 3279,
        "name": "珠海市"
    },
    {
        "child": [{
            "id": 3280,
            "name": "龙湖区"
        },
        {
            "id": 3281,
            "name": "金平区"
        },
        {
            "id": 3282,
            "name": "澄海区"
        },
        {
            "id": 3283,
            "name": "潮阳区"
        },
        {
            "id": 3284,
            "name": "潮南区"
        },
        {
            "id": 3285,
            "name": "濠江区"
        },
        {
            "id": 3286,
            "name": "南澳县"
        }],
        "id": 3287,
        "name": "汕头市"
    },
    {
        "child": [{
            "id": 3288,
            "name": "武江区"
        },
        {
            "id": 3289,
            "name": "浈江区"
        },
        {
            "id": 3290,
            "name": "南雄市"
        },
        {
            "id": 3291,
            "name": "乐昌市"
        },
        {
            "id": 3292,
            "name": "仁化县"
        },
        {
            "id": 3293,
            "name": "始兴县"
        },
        {
            "id": 3294,
            "name": "翁源县"
        },
        {
            "id": 3295,
            "name": "新丰县"
        },
        {
            "id": 3296,
            "name": "乳源瑶族自治县"
        },
        {
            "id": 3297,
            "name": "曲江区"
        }],
        "id": 3298,
        "name": "韶关市"
    },
    {
        "child": [{
            "id": 3299,
            "name": "和平县"
        },
        {
            "id": 3300,
            "name": "龙川县"
        },
        {
            "id": 3301,
            "name": "紫金县"
        },
        {
            "id": 3302,
            "name": "连平县"
        },
        {
            "id": 3303,
            "name": "源城区"
        },
        {
            "id": 3304,
            "name": "东源县"
        }],
        "id": 3305,
        "name": "河源市"
    },
    {
        "child": [{
            "id": 3306,
            "name": "梅江区"
        },
        {
            "id": 3307,
            "name": "兴宁市"
        },
        {
            "id": 3308,
            "name": "梅县"
        },
        {
            "id": 3309,
            "name": "蕉岭县"
        },
        {
            "id": 3310,
            "name": "大埔县"
        },
        {
            "id": 3311,
            "name": "丰顺县"
        },
        {
            "id": 3312,
            "name": "五华县"
        },
        {
            "id": 3313,
            "name": "平远县"
        }],
        "id": 3314,
        "name": "梅州市"
    },
    {
        "child": [{
            "id": 3315,
            "name": "惠阳区"
        },
        {
            "id": 3316,
            "name": "大亚湾区"
        },
        {
            "id": 3317,
            "name": "惠城区"
        },
        {
            "id": 3318,
            "name": "惠东县"
        },
        {
            "id": 3319,
            "name": "博罗县"
        },
        {
            "id": 3320,
            "name": "龙门县"
        }],
        "id": 3321,
        "name": "惠州市"
    },
    {
        "child": [{
            "id": 3322,
            "name": "城区"
        },
        {
            "id": 3323,
            "name": "陆丰市"
        },
        {
            "id": 3324,
            "name": "陆河县"
        },
        {
            "id": 3325,
            "name": "海丰县"
        }],
        "id": 3326,
        "name": "汕尾市"
    },
    {
        "child": [{
            "id": 3327,
            "name": "长安镇"
        },
        {
            "id": 3328,
            "name": "莞城区"
        },
        {
            "id": 3329,
            "name": "南城区"
        },
        {
            "id": 3330,
            "name": "寮步镇"
        },
        {
            "id": 3331,
            "name": "大岭山镇"
        },
        {
            "id": 3332,
            "name": "横沥镇"
        },
        {
            "id": 3333,
            "name": "常平镇"
        },
        {
            "id": 3334,
            "name": "厚街镇"
        },
        {
            "id": 3335,
            "name": "万江区"
        },
        {
            "id": 3336,
            "name": "樟木头镇"
        },
        {
            "id": 3337,
            "name": "塘厦镇"
        },
        {
            "id": 3338,
            "name": "凤岗镇"
        },
        {
            "id": 3339,
            "name": "大朗镇"
        },
        {
            "id": 3340,
            "name": "东坑镇"
        },
        {
            "id": 3341,
            "name": "清溪镇"
        },
        {
            "id": 3342,
            "name": "企石镇"
        },
        {
            "id": 3343,
            "name": "茶山镇"
        },
        {
            "id": 3344,
            "name": "东城区"
        },
        {
            "id": 3345,
            "name": "虎门镇"
        },
        {
            "id": 3346,
            "name": "黄江镇"
        },
        {
            "id": 3347,
            "name": "石排镇"
        },
        {
            "id": 3348,
            "name": "道滘镇"
        },
        {
            "id": 3349,
            "name": "沙田镇"
        },
        {
            "id": 3350,
            "name": "高埗镇"
        },
        {
            "id": 3351,
            "name": "石龙镇"
        },
        {
            "id": 3352,
            "name": "石碣镇"
        },
        {
            "id": 3353,
            "name": "洪梅镇"
        },
        {
            "id": 3354,
            "name": "麻涌镇"
        },
        {
            "id": 3355,
            "name": "松山湖"
        },
        {
            "id": 3356,
            "name": "桥头镇"
        },
        {
            "id": 3357,
            "name": "望牛墩镇"
        },
        {
            "id": 3358,
            "name": "中堂镇"
        },
        {
            "id": 3359,
            "name": "谢岗镇"
        }],
        "id": 3360,
        "name": "东莞市"
    },
    {
        "child": [{
            "id": 3361,
            "name": "城区"
        },
        {
            "id": 3362,
            "name": "火炬开发区"
        },
        {
            "id": 3363,
            "name": "小榄镇"
        },
        {
            "id": 3364,
            "name": "古镇"
        },
        {
            "id": 3365,
            "name": "三乡镇"
        },
        {
            "id": 3366,
            "name": "民众镇"
        },
        {
            "id": 3367,
            "name": "东凤镇"
        },
        {
            "id": 3368,
            "name": "板芙镇"
        },
        {
            "id": 3369,
            "name": "神湾镇"
        },
        {
            "id": 3370,
            "name": "横栏镇"
        },
        {
            "id": 3371,
            "name": "港口镇"
        },
        {
            "id": 3372,
            "name": "三角镇"
        },
        {
            "id": 3373,
            "name": "大涌镇"
        },
        {
            "id": 3374,
            "name": "南头镇"
        },
        {
            "id": 3375,
            "name": "沙溪镇"
        },
        {
            "id": 3376,
            "name": "坦洲镇"
        },
        {
            "id": 3377,
            "name": "黄圃镇"
        },
        {
            "id": 3378,
            "name": "五桂山镇"
        },
        {
            "id": 3379,
            "name": "南朗镇"
        },
        {
            "id": 3380,
            "name": "沙朗镇"
        },
        {
            "id": 3381,
            "name": "阜沙镇"
        },
        {
            "id": 3382,
            "name": "东升镇"
        }],
        "id": 3383,
        "name": "中山市"
    },
    {
        "child": [{
            "id": 3384,
            "name": "台山市"
        },
        {
            "id": 3385,
            "name": "新会区"
        },
        {
            "id": 3386,
            "name": "鹤山市"
        },
        {
            "id": 3387,
            "name": "江海区"
        },
        {
            "id": 3388,
            "name": "蓬江区"
        },
        {
            "id": 3389,
            "name": "开平市"
        },
        {
            "id": 3390,
            "name": "恩平市"
        }],
        "id": 3391,
        "name": "江门市"
    },
    {
        "child": [{
            "id": 3392,
            "name": "顺德区"
        },
        {
            "id": 3393,
            "name": "禅城区"
        },
        {
            "id": 3394,
            "name": "高明区"
        },
        {
            "id": 3395,
            "name": "三水区"
        },
        {
            "id": 3396,
            "name": "南海区"
        }],
        "id": 3397,
        "name": "佛山市"
    },
    {
        "child": [{
            "id": 3398,
            "name": "江城区"
        },
        {
            "id": 3399,
            "name": "阳东县"
        },
        {
            "id": 3400,
            "name": "阳春市"
        },
        {
            "id": 3401,
            "name": "阳西县"
        }],
        "id": 3402,
        "name": "阳江市"
    },
    {
        "child": [{
            "id": 3403,
            "name": "赤坎区"
        },
        {
            "id": 3404,
            "name": "霞山区"
        },
        {
            "id": 3405,
            "name": "经济技术开发区"
        },
        {
            "id": 3406,
            "name": "麻章区"
        },
        {
            "id": 3407,
            "name": "遂溪县"
        },
        {
            "id": 3408,
            "name": "廉江市"
        },
        {
            "id": 3409,
            "name": "坡头区"
        },
        {
            "id": 3410,
            "name": "雷州市"
        },
        {
            "id": 3411,
            "name": "吴川市"
        },
        {
            "id": 3412,
            "name": "徐闻县"
        }],
        "id": 3413,
        "name": "湛江市"
    },
    {
        "child": [{
            "id": 3414,
            "name": "茂南区"
        },
        {
            "id": 3415,
            "name": "电白县"
        },
        {
            "id": 3416,
            "name": "高州市"
        },
        {
            "id": 3417,
            "name": "化州市"
        },
        {
            "id": 3418,
            "name": "茂港区"
        },
        {
            "id": 3419,
            "name": "信宜市"
        }],
        "id": 3420,
        "name": "茂名市"
    },
    {
        "child": [{
            "id": 3421,
            "name": "端州区"
        },
        {
            "id": 3422,
            "name": "四会市"
        },
        {
            "id": 3423,
            "name": "高要市"
        },
        {
            "id": 3424,
            "name": "广宁县"
        },
        {
            "id": 3425,
            "name": "德庆县"
        },
        {
            "id": 3426,
            "name": "怀集县"
        },
        {
            "id": 3427,
            "name": "封开县"
        },
        {
            "id": 3428,
            "name": "鼎湖区"
        }],
        "id": 3429,
        "name": "肇庆市"
    },
    {
        "child": [{
            "id": 3430,
            "name": "云城区"
        },
        {
            "id": 3431,
            "name": "罗定市"
        },
        {
            "id": 3432,
            "name": "云安县"
        },
        {
            "id": 3433,
            "name": "新兴县"
        },
        {
            "id": 3434,
            "name": "郁南县"
        }],
        "id": 3435,
        "name": "云浮市"
    },
    {
        "child": [{
            "id": 3436,
            "name": "连州市"
        },
        {
            "id": 3437,
            "name": "佛冈县"
        },
        {
            "id": 3438,
            "name": "阳山县"
        },
        {
            "id": 3439,
            "name": "清新县"
        },
        {
            "id": 3440,
            "name": "连山县"
        },
        {
            "id": 3441,
            "name": "连南县"
        },
        {
            "id": 3442,
            "name": "清城区"
        },
        {
            "id": 3443,
            "name": "英德市"
        }],
        "id": 3444,
        "name": "清远市"
    },
    {
        "child": [{
            "id": 3445,
            "name": "湘桥区"
        },
        {
            "id": 3446,
            "name": "枫溪区"
        },
        {
            "id": 3447,
            "name": "潮安区"
        },
        {
            "id": 3448,
            "name": "饶平县"
        }],
        "id": 3449,
        "name": "潮州市"
    },
    {
        "child": [{
            "id": 3450,
            "name": "东山区"
        },
        {
            "id": 3451,
            "name": "普宁市"
        },
        {
            "id": 3452,
            "name": "榕城区"
        },
        {
            "id": 3453,
            "name": "揭东县"
        },
        {
            "id": 3454,
            "name": "揭西县"
        },
        {
            "id": 3455,
            "name": "惠来县"
        }],
        "id": 3456,
        "name": "揭阳市"
    }]
},
{
    "id": 3457,
    "name": "广西",
    "child": [{
        "child": [{
            "id": 3458,
            "name": "八步区"
        },
        {
            "id": 3459,
            "name": "钟山县"
        },
        {
            "id": 3460,
            "name": "昭平县"
        },
        {
            "id": 3461,
            "name": "富川县"
        },
        {
            "id": 3462,
            "name": "平桂管理区"
        }],
        "id": 3463,
        "name": "贺州市"
    },
    {
        "child": [{
            "id": 3464,
            "name": "右江区"
        },
        {
            "id": 3465,
            "name": "平果县"
        },
        {
            "id": 3466,
            "name": "乐业县"
        },
        {
            "id": 3467,
            "name": "田阳县"
        },
        {
            "id": 3468,
            "name": "西林县"
        },
        {
            "id": 3469,
            "name": "田林县"
        },
        {
            "id": 3470,
            "name": "德保县"
        },
        {
            "id": 3471,
            "name": "靖西县"
        },
        {
            "id": 3472,
            "name": "田东县"
        },
        {
            "id": 3473,
            "name": "那坡县"
        },
        {
            "id": 3474,
            "name": "隆林县"
        },
        {
            "id": 3475,
            "name": "凌云县"
        }],
        "id": 3476,
        "name": "百色市"
    },
    {
        "child": [{
            "id": 3477,
            "name": "宜州市"
        },
        {
            "id": 3478,
            "name": "天峨县"
        },
        {
            "id": 3479,
            "name": "凤山县"
        },
        {
            "id": 3480,
            "name": "南丹县"
        },
        {
            "id": 3481,
            "name": "东兰县"
        },
        {
            "id": 3482,
            "name": "巴马县"
        },
        {
            "id": 3483,
            "name": "环江县"
        },
        {
            "id": 3484,
            "name": "大化县"
        },
        {
            "id": 3485,
            "name": "都安县"
        },
        {
            "id": 3486,
            "name": "金城江区"
        },
        {
            "id": 3487,
            "name": "罗城县"
        }],
        "id": 3488,
        "name": "河池市"
    },
    {
        "child": [{
            "id": 3489,
            "name": "江州区"
        },
        {
            "id": 3490,
            "name": "凭祥市"
        },
        {
            "id": 3491,
            "name": "扶绥县"
        },
        {
            "id": 3492,
            "name": "大新县"
        },
        {
            "id": 3493,
            "name": "天等县"
        },
        {
            "id": 3494,
            "name": "宁明县"
        },
        {
            "id": 3495,
            "name": "龙州县"
        }],
        "id": 3496,
        "name": "崇左市"
    },
    {
        "child": [{
            "id": 3497,
            "name": "良庆区"
        },
        {
            "id": 3498,
            "name": "江南区"
        },
        {
            "id": 3499,
            "name": "兴宁区"
        },
        {
            "id": 3500,
            "name": "青秀区"
        },
        {
            "id": 3501,
            "name": "西乡塘区"
        },
        {
            "id": 3502,
            "name": "横县"
        },
        {
            "id": 3503,
            "name": "上林县"
        },
        {
            "id": 3504,
            "name": "隆安县"
        },
        {
            "id": 3505,
            "name": "马山县"
        },
        {
            "id": 3506,
            "name": "武鸣区"
        },
        {
            "id": 3507,
            "name": "邕宁区"
        },
        {
            "id": 3508,
            "name": "宾阳县"
        }],
        "id": 3509,
        "name": "南宁市"
    },
    {
        "child": [{
            "id": 3510,
            "name": "融安县"
        },
        {
            "id": 3511,
            "name": "三江县"
        },
        {
            "id": 3512,
            "name": "融水县"
        },
        {
            "id": 3513,
            "name": "鱼峰区"
        },
        {
            "id": 3514,
            "name": "城中区"
        },
        {
            "id": 3515,
            "name": "柳南区"
        },
        {
            "id": 3516,
            "name": "柳北区"
        },
        {
            "id": 3517,
            "name": "柳江县"
        },
        {
            "id": 3518,
            "name": "柳城县"
        },
        {
            "id": 3519,
            "name": "鹿寨县"
        }],
        "id": 3520,
        "name": "柳州市"
    },
    {
        "child": [{
            "id": 3521,
            "name": "象山区"
        },
        {
            "id": 3522,
            "name": "恭城县"
        },
        {
            "id": 3523,
            "name": "秀峰区"
        },
        {
            "id": 3524,
            "name": "叠彩区"
        },
        {
            "id": 3525,
            "name": "七星区"
        },
        {
            "id": 3526,
            "name": "雁山区"
        },
        {
            "id": 3527,
            "name": "阳朔县"
        },
        {
            "id": 3528,
            "name": "临桂县"
        },
        {
            "id": 3529,
            "name": "灵川县"
        },
        {
            "id": 3530,
            "name": "全州县"
        },
        {
            "id": 3531,
            "name": "平乐县"
        },
        {
            "id": 3532,
            "name": "兴安县"
        },
        {
            "id": 3533,
            "name": "灌阳县"
        },
        {
            "id": 3534,
            "name": "荔浦县"
        },
        {
            "id": 3535,
            "name": "资源县"
        },
        {
            "id": 3536,
            "name": "永福县"
        },
        {
            "id": 3537,
            "name": "龙胜县"
        }],
        "id": 3538,
        "name": "桂林市"
    },
    {
        "child": [{
            "id": 3539,
            "name": "岑溪市"
        },
        {
            "id": 3540,
            "name": "苍梧县"
        },
        {
            "id": 3541,
            "name": "藤县"
        },
        {
            "id": 3542,
            "name": "蒙山县"
        },
        {
            "id": 3543,
            "name": "万秀区"
        },
        {
            "id": 3544,
            "name": "蝶山区"
        },
        {
            "id": 3545,
            "name": "长洲区"
        }],
        "id": 3546,
        "name": "梧州市"
    },
    {
        "child": [{
            "id": 3547,
            "name": "海城区"
        },
        {
            "id": 3548,
            "name": "银海区"
        },
        {
            "id": 3549,
            "name": "合浦县"
        },
        {
            "id": 3550,
            "name": "铁山港区"
        }],
        "id": 3551,
        "name": "北海市"
    },
    {
        "child": [{
            "id": 3552,
            "name": "防城区"
        },
        {
            "id": 3553,
            "name": "港口区"
        },
        {
            "id": 3554,
            "name": "东兴市"
        },
        {
            "id": 3555,
            "name": "上思县"
        }],
        "id": 3556,
        "name": "防城港市"
    },
    {
        "child": [{
            "id": 3557,
            "name": "钦南区"
        },
        {
            "id": 3558,
            "name": "钦北区"
        },
        {
            "id": 3559,
            "name": "浦北县"
        },
        {
            "id": 3560,
            "name": "灵山县"
        }],
        "id": 3561,
        "name": "钦州市"
    },
    {
        "child": [{
            "id": 3562,
            "name": "港南区"
        },
        {
            "id": 3563,
            "name": "港北区"
        },
        {
            "id": 3564,
            "name": "桂平市"
        },
        {
            "id": 3565,
            "name": "平南县"
        },
        {
            "id": 3566,
            "name": "覃塘区"
        }],
        "id": 3567,
        "name": "贵港市"
    },
    {
        "child": [{
            "id": 3568,
            "name": "玉州区"
        },
        {
            "id": 3569,
            "name": "北流市"
        },
        {
            "id": 3570,
            "name": "容县"
        },
        {
            "id": 3571,
            "name": "博白县"
        },
        {
            "id": 3572,
            "name": "陆川县"
        },
        {
            "id": 3573,
            "name": "兴业县"
        }],
        "id": 3574,
        "name": "玉林市"
    },
    {
        "child": [{
            "id": 3575,
            "name": "兴宾区"
        },
        {
            "id": 3576,
            "name": "合山市"
        },
        {
            "id": 3577,
            "name": "忻城县"
        },
        {
            "id": 3578,
            "name": "武宣县"
        },
        {
            "id": 3579,
            "name": "象州县"
        },
        {
            "id": 3580,
            "name": "金秀县"
        }],
        "id": 3581,
        "name": "来宾市"
    }]
},
{
    "id": 3582,
    "name": "江西",
    "child": [{
        "child": [{
            "id": 3583,
            "name": "青云谱区"
        },
        {
            "id": 3584,
            "name": "西湖区"
        },
        {
            "id": 3585,
            "name": "东湖区"
        },
        {
            "id": 3586,
            "name": "昌北区"
        },
        {
            "id": 3587,
            "name": "南昌县"
        },
        {
            "id": 3588,
            "name": "进贤县"
        },
        {
            "id": 3589,
            "name": "安义县"
        },
        {
            "id": 3590,
            "name": "青山湖区"
        },
        {
            "id": 3591,
            "name": "红谷滩新区"
        },
        {
            "id": 3592,
            "name": "新建县"
        },
        {
            "id": 3593,
            "name": "湾里区"
        },
        {
            "id": 3594,
            "name": "高新区"
        }],
        "id": 3595,
        "name": "南昌市"
    },
    {
        "child": [{
            "id": 3596,
            "name": "珠山区"
        },
        {
            "id": 3597,
            "name": "乐平市"
        },
        {
            "id": 3598,
            "name": "浮梁县"
        },
        {
            "id": 3599,
            "name": "昌江区"
        }],
        "id": 3600,
        "name": "景德镇市"
    },
    {
        "child": [{
            "id": 3601,
            "name": "湘东区"
        },
        {
            "id": 3602,
            "name": "莲花县"
        },
        {
            "id": 3603,
            "name": "上栗县"
        },
        {
            "id": 3604,
            "name": "芦溪县"
        },
        {
            "id": 3605,
            "name": "安源区"
        }],
        "id": 3606,
        "name": "萍乡市"
    },
    {
        "child": [{
            "id": 3607,
            "name": "分宜县"
        },
        {
            "id": 3608,
            "name": "渝水区"
        }],
        "id": 3609,
        "name": "新余市"
    },
    {
        "child": [{
            "id": 3610,
            "name": "浔阳区"
        },
        {
            "id": 3611,
            "name": "八里湖新区"
        },
        {
            "id": 3612,
            "name": "经济技术开发区"
        },
        {
            "id": 3613,
            "name": "修水县"
        },
        {
            "id": 3614,
            "name": "瑞昌市"
        },
        {
            "id": 3615,
            "name": "彭泽县"
        },
        {
            "id": 3616,
            "name": "湖口县"
        },
        {
            "id": 3617,
            "name": "共青城市"
        },
        {
            "id": 3618,
            "name": "九江县"
        },
        {
            "id": 3619,
            "name": "庐山区"
        },
        {
            "id": 3620,
            "name": "德安县"
        },
        {
            "id": 3621,
            "name": "都昌县"
        },
        {
            "id": 3622,
            "name": "永修县"
        },
        {
            "id": 3623,
            "name": "武宁县"
        },
        {
            "id": 3624,
            "name": "星子县"
        },
        {
            "id": 3625,
            "name": "庐山风景名胜区"
        }],
        "id": 3626,
        "name": "九江市"
    },
    {
        "child": [{
            "id": 3627,
            "name": "龙虎山风景旅游区"
        },
        {
            "id": 3628,
            "name": "余江县"
        },
        {
            "id": 3629,
            "name": "贵溪市"
        },
        {
            "id": 3630,
            "name": "月湖区"
        }],
        "id": 3631,
        "name": "鹰潭市"
    },
    {
        "child": [{
            "id": 3632,
            "name": "德兴市"
        },
        {
            "id": 3633,
            "name": "广丰县"
        },
        {
            "id": 3634,
            "name": "鄱阳县"
        },
        {
            "id": 3635,
            "name": "婺源县"
        },
        {
            "id": 3636,
            "name": "余干县"
        },
        {
            "id": 3637,
            "name": "横峰县"
        },
        {
            "id": 3638,
            "name": "弋阳县"
        },
        {
            "id": 3639,
            "name": "铅山县"
        },
        {
            "id": 3640,
            "name": "玉山县"
        },
        {
            "id": 3641,
            "name": "万年县"
        },
        {
            "id": 3642,
            "name": "信州区"
        },
        {
            "id": 3643,
            "name": "上饶县"
        }],
        "id": 3644,
        "name": "上饶市"
    },
    {
        "child": [{
            "id": 3645,
            "name": "丰城市"
        },
        {
            "id": 3646,
            "name": "樟树市"
        },
        {
            "id": 3647,
            "name": "袁州区"
        },
        {
            "id": 3648,
            "name": "高安市"
        },
        {
            "id": 3649,
            "name": "铜鼓县"
        },
        {
            "id": 3650,
            "name": "靖安县"
        },
        {
            "id": 3651,
            "name": "宜丰县"
        },
        {
            "id": 3652,
            "name": "奉新县"
        },
        {
            "id": 3653,
            "name": "万载县"
        },
        {
            "id": 3654,
            "name": "上高县"
        }],
        "id": 3655,
        "name": "宜春市"
    },
    {
        "child": [{
            "id": 3656,
            "name": "南丰县"
        },
        {
            "id": 3657,
            "name": "乐安县"
        },
        {
            "id": 3658,
            "name": "金溪县"
        },
        {
            "id": 3659,
            "name": "南城县"
        },
        {
            "id": 3660,
            "name": "东乡县"
        },
        {
            "id": 3661,
            "name": "资溪县"
        },
        {
            "id": 3662,
            "name": "宜黄县"
        },
        {
            "id": 3663,
            "name": "崇仁县"
        },
        {
            "id": 3664,
            "name": "黎川县"
        },
        {
            "id": 3665,
            "name": "广昌县"
        },
        {
            "id": 3666,
            "name": "临川区"
        }],
        "id": 3667,
        "name": "抚州市"
    },
    {
        "child": [{
            "id": 3668,
            "name": "青原区"
        },
        {
            "id": 3669,
            "name": "吉州区"
        },
        {
            "id": 3670,
            "name": "井冈山市"
        },
        {
            "id": 3671,
            "name": "吉安县"
        },
        {
            "id": 3672,
            "name": "永丰县"
        },
        {
            "id": 3673,
            "name": "永新县"
        },
        {
            "id": 3674,
            "name": "新干县"
        },
        {
            "id": 3675,
            "name": "泰和县"
        },
        {
            "id": 3676,
            "name": "峡江县"
        },
        {
            "id": 3677,
            "name": "遂川县"
        },
        {
            "id": 3678,
            "name": "安福县"
        },
        {
            "id": 3679,
            "name": "吉水县"
        },
        {
            "id": 3680,
            "name": "万安县"
        }],
        "id": 3681,
        "name": "吉安市"
    },
    {
        "child": [{
            "id": 3682,
            "name": "章贡区"
        },
        {
            "id": 3683,
            "name": "南康市"
        },
        {
            "id": 3684,
            "name": "瑞金市"
        },
        {
            "id": 3685,
            "name": "石城县"
        },
        {
            "id": 3686,
            "name": "安远县"
        },
        {
            "id": 3687,
            "name": "赣县"
        },
        {
            "id": 3688,
            "name": "宁都县"
        },
        {
            "id": 3689,
            "name": "寻乌县"
        },
        {
            "id": 3690,
            "name": "兴国县"
        },
        {
            "id": 3691,
            "name": "定南县"
        },
        {
            "id": 3692,
            "name": "上犹县"
        },
        {
            "id": 3693,
            "name": "于都县"
        },
        {
            "id": 3694,
            "name": "龙南县"
        },
        {
            "id": 3695,
            "name": "崇义县"
        },
        {
            "id": 3696,
            "name": "大余县"
        },
        {
            "id": 3697,
            "name": "信丰县"
        },
        {
            "id": 3698,
            "name": "全南县"
        },
        {
            "id": 3699,
            "name": "会昌县"
        }],
        "id": 3700,
        "name": "赣州市"
    }]
},
{
    "id": 3701,
    "name": "四川",
    "child": [{
        "child": [{
            "id": 3702,
            "name": "仁寿县"
        },
        {
            "id": 3703,
            "name": "彭山区"
        },
        {
            "id": 3704,
            "name": "洪雅县"
        },
        {
            "id": 3705,
            "name": "丹棱县"
        },
        {
            "id": 3706,
            "name": "青神县"
        },
        {
            "id": 3707,
            "name": "东坡区"
        }],
        "id": 3708,
        "name": "眉山市"
    },
    {
        "child": [{
            "id": 3709,
            "name": "雁江区"
        },
        {
            "id": 3710,
            "name": "安岳县"
        },
        {
            "id": 3711,
            "name": "乐至县"
        },
        {
            "id": 3712,
            "name": "简阳市"
        }],
        "id": 3713,
        "name": "资阳市"
    },
    {
        "child": [{
            "id": 3714,
            "name": "马尔康县"
        },
        {
            "id": 3715,
            "name": "九寨沟县"
        },
        {
            "id": 3716,
            "name": "红原县"
        },
        {
            "id": 3717,
            "name": "阿坝县"
        },
        {
            "id": 3718,
            "name": "理县"
        },
        {
            "id": 3719,
            "name": "若尔盖县"
        },
        {
            "id": 3720,
            "name": "金川县"
        },
        {
            "id": 3721,
            "name": "小金县"
        },
        {
            "id": 3722,
            "name": "黑水县"
        },
        {
            "id": 3723,
            "name": "松潘县"
        },
        {
            "id": 3724,
            "name": "壤塘县"
        },
        {
            "id": 3725,
            "name": "茂县"
        },
        {
            "id": 3726,
            "name": "汶川县"
        }],
        "id": 3727,
        "name": "阿坝州"
    },
    {
        "child": [{
            "id": 3728,
            "name": "康定县"
        },
        {
            "id": 3729,
            "name": "泸定县"
        },
        {
            "id": 3730,
            "name": "九龙县"
        },
        {
            "id": 3731,
            "name": "丹巴县"
        },
        {
            "id": 3732,
            "name": "道孚县"
        },
        {
            "id": 3733,
            "name": "炉霍县"
        },
        {
            "id": 3734,
            "name": "色达县"
        },
        {
            "id": 3735,
            "name": "甘孜县"
        },
        {
            "id": 3736,
            "name": "新龙县"
        },
        {
            "id": 3737,
            "name": "白玉县"
        },
        {
            "id": 3738,
            "name": "德格县"
        },
        {
            "id": 3739,
            "name": "石渠县"
        },
        {
            "id": 3740,
            "name": "雅江县"
        },
        {
            "id": 3741,
            "name": "理塘县"
        },
        {
            "id": 3742,
            "name": "巴塘县"
        },
        {
            "id": 3743,
            "name": "稻城县"
        },
        {
            "id": 3744,
            "name": "乡城县"
        },
        {
            "id": 3745,
            "name": "得荣县"
        }],
        "id": 3746,
        "name": "甘孜州"
    },
    {
        "child": [{
            "id": 3747,
            "name": "美姑县"
        },
        {
            "id": 3748,
            "name": "昭觉县"
        },
        {
            "id": 3749,
            "name": "会理县"
        },
        {
            "id": 3750,
            "name": "会东县"
        },
        {
            "id": 3751,
            "name": "普格县"
        },
        {
            "id": 3752,
            "name": "宁南县"
        },
        {
            "id": 3753,
            "name": "德昌县"
        },
        {
            "id": 3754,
            "name": "冕宁县"
        },
        {
            "id": 3755,
            "name": "盐源县"
        },
        {
            "id": 3756,
            "name": "金阳县"
        },
        {
            "id": 3757,
            "name": "布拖县"
        },
        {
            "id": 3758,
            "name": "雷波县"
        },
        {
            "id": 3759,
            "name": "越西县"
        },
        {
            "id": 3760,
            "name": "喜德县"
        },
        {
            "id": 3761,
            "name": "甘洛县"
        },
        {
            "id": 3762,
            "name": "木里县"
        },
        {
            "id": 3763,
            "name": "西昌市"
        }],
        "id": 3764,
        "name": "凉山州"
    },
    {
        "child": [{
            "id": 3765,
            "name": "武侯区"
        },
        {
            "id": 3766,
            "name": "金牛区"
        },
        {
            "id": 3767,
            "name": "青羊区"
        },
        {
            "id": 3768,
            "name": "成华区"
        },
        {
            "id": 3769,
            "name": "高新区"
        },
        {
            "id": 3770,
            "name": "锦江区"
        },
        {
            "id": 3771,
            "name": "郫县"
        },
        {
            "id": 3772,
            "name": "双流县"
        },
        {
            "id": 3773,
            "name": "高新西区"
        },
        {
            "id": 3774,
            "name": "龙泉驿区"
        },
        {
            "id": 3775,
            "name": "新都区"
        },
        {
            "id": 3776,
            "name": "温江区"
        },
        {
            "id": 3777,
            "name": "都江堰市"
        },
        {
            "id": 3778,
            "name": "彭州市"
        },
        {
            "id": 3779,
            "name": "青白江区"
        },
        {
            "id": 3780,
            "name": "崇州市"
        },
        {
            "id": 3781,
            "name": "金堂县"
        },
        {
            "id": 3782,
            "name": "新津县"
        },
        {
            "id": 3783,
            "name": "邛崃市"
        },
        {
            "id": 3784,
            "name": "大邑县"
        },
        {
            "id": 3785,
            "name": "蒲江县"
        }],
        "id": 3786,
        "name": "成都市"
    },
    {
        "child": [{
            "id": 3787,
            "name": "自流井区"
        },
        {
            "id": 3788,
            "name": "沿滩区"
        },
        {
            "id": 3789,
            "name": "荣县"
        },
        {
            "id": 3790,
            "name": "富顺县"
        },
        {
            "id": 3791,
            "name": "大安区"
        },
        {
            "id": 3792,
            "name": "贡井区"
        }],
        "id": 3793,
        "name": "自贡市"
    },
    {
        "child": [{
            "id": 3794,
            "name": "仁和区"
        },
        {
            "id": 3795,
            "name": "西区"
        },
        {
            "id": 3796,
            "name": "东区"
        },
        {
            "id": 3797,
            "name": "米易县"
        },
        {
            "id": 3798,
            "name": "盐边县"
        }],
        "id": 3799,
        "name": "攀枝花市"
    },
    {
        "child": [{
            "id": 3800,
            "name": "纳溪区"
        },
        {
            "id": 3801,
            "name": "江阳区"
        },
        {
            "id": 3802,
            "name": "龙马潭区"
        },
        {
            "id": 3803,
            "name": "泸县"
        },
        {
            "id": 3804,
            "name": "合江县"
        },
        {
            "id": 3805,
            "name": "叙永县"
        },
        {
            "id": 3806,
            "name": "古蔺县"
        }],
        "id": 3807,
        "name": "泸州市"
    },
    {
        "child": [{
            "id": 3808,
            "name": "江油市"
        },
        {
            "id": 3809,
            "name": "涪城区"
        },
        {
            "id": 3810,
            "name": "游仙区"
        },
        {
            "id": 3811,
            "name": "高新区"
        },
        {
            "id": 3812,
            "name": "经开区"
        },
        {
            "id": 3813,
            "name": "盐亭县"
        },
        {
            "id": 3814,
            "name": "三台县"
        },
        {
            "id": 3815,
            "name": "平武县"
        },
        {
            "id": 3816,
            "name": "北川县"
        },
        {
            "id": 3817,
            "name": "安县"
        },
        {
            "id": 3818,
            "name": "梓潼县"
        }],
        "id": 3819,
        "name": "绵阳市"
    },
    {
        "child": [{
            "id": 3820,
            "name": "广汉市"
        },
        {
            "id": 3821,
            "name": "什邡市"
        },
        {
            "id": 3822,
            "name": "旌阳区"
        },
        {
            "id": 3823,
            "name": "绵竹市"
        },
        {
            "id": 3824,
            "name": "罗江县"
        },
        {
            "id": 3825,
            "name": "中江县"
        }],
        "id": 3826,
        "name": "德阳市"
    },
    {
        "child": [{
            "id": 3827,
            "name": "昭化区"
        },
        {
            "id": 3828,
            "name": "朝天区"
        },
        {
            "id": 3829,
            "name": "利州区"
        },
        {
            "id": 3830,
            "name": "青川县"
        },
        {
            "id": 3831,
            "name": "旺苍县"
        },
        {
            "id": 3832,
            "name": "剑阁县"
        },
        {
            "id": 3833,
            "name": "苍溪县"
        }],
        "id": 3834,
        "name": "广元市"
    },
    {
        "child": [{
            "id": 3835,
            "name": "船山区"
        },
        {
            "id": 3836,
            "name": "射洪县"
        },
        {
            "id": 3837,
            "name": "蓬溪县"
        },
        {
            "id": 3838,
            "name": "大英县"
        },
        {
            "id": 3839,
            "name": "安居区"
        }],
        "id": 3840,
        "name": "遂宁市"
    },
    {
        "child": [{
            "id": 3841,
            "name": "东兴区"
        },
        {
            "id": 3842,
            "name": "资中县"
        },
        {
            "id": 3843,
            "name": "隆昌县"
        },
        {
            "id": 3844,
            "name": "威远县"
        },
        {
            "id": 3845,
            "name": "市中区"
        }],
        "id": 3846,
        "name": "内江市"
    },
    {
        "child": [{
            "id": 3847,
            "name": "市中区"
        },
        {
            "id": 3848,
            "name": "峨眉山市"
        },
        {
            "id": 3849,
            "name": "五通桥区"
        },
        {
            "id": 3850,
            "name": "沙湾区"
        },
        {
            "id": 3851,
            "name": "金口河区"
        },
        {
            "id": 3852,
            "name": "夹江县"
        },
        {
            "id": 3853,
            "name": "井研县"
        },
        {
            "id": 3854,
            "name": "犍为县"
        },
        {
            "id": 3855,
            "name": "沐川县"
        },
        {
            "id": 3856,
            "name": "峨边县"
        },
        {
            "id": 3857,
            "name": "马边县"
        }],
        "id": 3858,
        "name": "乐山市"
    },
    {
        "child": [{
            "id": 3859,
            "name": "宜宾县"
        },
        {
            "id": 3860,
            "name": "南溪区"
        },
        {
            "id": 3861,
            "name": "江安县"
        },
        {
            "id": 3862,
            "name": "长宁县"
        },
        {
            "id": 3863,
            "name": "兴文县"
        },
        {
            "id": 3864,
            "name": "珙县"
        },
        {
            "id": 3865,
            "name": "翠屏区"
        },
        {
            "id": 3866,
            "name": "高县"
        },
        {
            "id": 3867,
            "name": "屏山县"
        },
        {
            "id": 3868,
            "name": "筠连县"
        }],
        "id": 3869,
        "name": "宜宾市"
    },
    {
        "child": [{
            "id": 3870,
            "name": "前锋区"
        },
        {
            "id": 3871,
            "name": "岳池县"
        },
        {
            "id": 3872,
            "name": "武胜县"
        },
        {
            "id": 3873,
            "name": "邻水县"
        },
        {
            "id": 3874,
            "name": "广安区"
        },
        {
            "id": 3875,
            "name": "华蓥市"
        }],
        "id": 3876,
        "name": "广安市"
    },
    {
        "child": [{
            "id": 3877,
            "name": "顺庆区"
        },
        {
            "id": 3878,
            "name": "高坪区"
        },
        {
            "id": 3879,
            "name": "嘉陵区"
        },
        {
            "id": 3880,
            "name": "西充县"
        },
        {
            "id": 3881,
            "name": "阆中市"
        },
        {
            "id": 3882,
            "name": "南部县"
        },
        {
            "id": 3883,
            "name": "仪陇县"
        },
        {
            "id": 3884,
            "name": "蓬安县"
        },
        {
            "id": 3885,
            "name": "营山县"
        }],
        "id": 3886,
        "name": "南充市"
    },
    {
        "child": [{
            "id": 3887,
            "name": "通川区"
        },
        {
            "id": 3888,
            "name": "达川区"
        },
        {
            "id": 3889,
            "name": "大竹县"
        },
        {
            "id": 3890,
            "name": "渠县"
        },
        {
            "id": 3891,
            "name": "万源市"
        },
        {
            "id": 3892,
            "name": "宣汉县"
        },
        {
            "id": 3893,
            "name": "开江县"
        }],
        "id": 3894,
        "name": "达州市"
    },
    {
        "child": [{
            "id": 3895,
            "name": "巴州区"
        },
        {
            "id": 3896,
            "name": "恩阳区"
        },
        {
            "id": 3897,
            "name": "南江县"
        },
        {
            "id": 3898,
            "name": "平昌县"
        },
        {
            "id": 3899,
            "name": "通江县"
        }],
        "id": 3900,
        "name": "巴中市"
    },
    {
        "child": [{
            "id": 3901,
            "name": "芦山县"
        },
        {
            "id": 3902,
            "name": "石棉县"
        },
        {
            "id": 3903,
            "name": "名山区"
        },
        {
            "id": 3904,
            "name": "天全县"
        },
        {
            "id": 3905,
            "name": "荥经县"
        },
        {
            "id": 3906,
            "name": "汉源县"
        },
        {
            "id": 3907,
            "name": "宝兴县"
        },
        {
            "id": 3908,
            "name": "雨城区"
        }],
        "id": 3909,
        "name": "雅安市"
    }]
},
{
    "id": 3910,
    "name": "海南",
    "child": [{
        "child": [{
            "id": 3911,
            "name": "嘉积镇"
        },
        {
            "id": 3912,
            "name": "万泉镇"
        },
        {
            "id": 3913,
            "name": "石壁镇"
        },
        {
            "id": 3914,
            "name": "中原镇"
        },
        {
            "id": 3915,
            "name": "博鳌镇"
        },
        {
            "id": 3916,
            "name": "阳江镇"
        },
        {
            "id": 3917,
            "name": "龙江镇"
        },
        {
            "id": 3918,
            "name": "潭门镇"
        },
        {
            "id": 3919,
            "name": "塔洋镇"
        },
        {
            "id": 3920,
            "name": "长坡镇"
        },
        {
            "id": 3921,
            "name": "大路镇"
        },
        {
            "id": 3922,
            "name": "会山镇"
        },
        {
            "id": 3923,
            "name": "彬村山华侨农场"
        },
        {
            "id": 3924,
            "name": "东太农场"
        },
        {
            "id": 3925,
            "name": "东红农场"
        },
        {
            "id": 3926,
            "name": "东升农场"
        },
        {
            "id": 3927,
            "name": "南俸农场"
        }],
        "id": 3928,
        "name": "琼海市"
    },
    {
        "child": [{
            "id": 3929,
            "name": "兴隆镇"
        },
        {
            "id": 3930,
            "name": "南林农场"
        },
        {
            "id": 3931,
            "name": "万城镇"
        },
        {
            "id": 3932,
            "name": "龙滚镇"
        },
        {
            "id": 3933,
            "name": "和乐镇"
        },
        {
            "id": 3934,
            "name": "后安镇"
        },
        {
            "id": 3935,
            "name": "大茂镇"
        },
        {
            "id": 3936,
            "name": "东澳镇"
        },
        {
            "id": 3937,
            "name": "礼纪镇"
        },
        {
            "id": 3938,
            "name": "长丰镇"
        },
        {
            "id": 3939,
            "name": "山根镇"
        },
        {
            "id": 3940,
            "name": "北大镇"
        },
        {
            "id": 3941,
            "name": "南桥镇"
        },
        {
            "id": 3942,
            "name": "三更罗镇"
        },
        {
            "id": 3943,
            "name": "六连林场"
        },
        {
            "id": 3944,
            "name": "东兴农场"
        },
        {
            "id": 3945,
            "name": "东和农场"
        },
        {
            "id": 3946,
            "name": "新中农场"
        },
        {
            "id": 3947,
            "name": "兴隆华侨农场"
        }],
        "id": 3948,
        "name": "万宁市"
    },
    {
        "child": [{
            "id": 3949,
            "name": "秀英区"
        },
        {
            "id": 3950,
            "name": "龙华区"
        },
        {
            "id": 3951,
            "name": "琼山区"
        },
        {
            "id": 3952,
            "name": "美兰区"
        }],
        "id": 3953,
        "name": "海口市"
    },
    {
        "child": [{
            "id": 3954,
            "name": "八所镇"
        },
        {
            "id": 3955,
            "name": "东河镇"
        },
        {
            "id": 3956,
            "name": "大田镇"
        },
        {
            "id": 3957,
            "name": "感城镇"
        },
        {
            "id": 3958,
            "name": "板桥镇"
        },
        {
            "id": 3959,
            "name": "三家镇"
        },
        {
            "id": 3960,
            "name": "四更镇"
        },
        {
            "id": 3961,
            "name": "新龙镇"
        },
        {
            "id": 3962,
            "name": "天安乡"
        },
        {
            "id": 3963,
            "name": "江边乡"
        },
        {
            "id": 3964,
            "name": "广坝农场"
        },
        {
            "id": 3965,
            "name": "东方华侨农场"
        }],
        "id": 3966,
        "name": "东方市"
    },
    {
        "child": [{
            "id": 3967,
            "name": "崖城镇"
        },
        {
            "id": 3968,
            "name": "海棠湾镇"
        },
        {
            "id": 3969,
            "name": "吉阳镇"
        },
        {
            "id": 3970,
            "name": "凤凰镇"
        },
        {
            "id": 3971,
            "name": "天涯镇"
        },
        {
            "id": 3972,
            "name": "育才镇"
        },
        {
            "id": 3973,
            "name": "河西区"
        },
        {
            "id": 3974,
            "name": "河东区"
        },
        {
            "id": 3975,
            "name": "南田农场"
        },
        {
            "id": 3976,
            "name": "南新农场"
        },
        {
            "id": 3977,
            "name": "南岛农场"
        },
        {
            "id": 3978,
            "name": "立才农场"
        },
        {
            "id": 3979,
            "name": "南滨农场"
        }],
        "id": 3980,
        "name": "三亚市"
    },
    {
        "child": [{
            "id": 3981,
            "name": "文城镇"
        },
        {
            "id": 3982,
            "name": "重兴镇"
        },
        {
            "id": 3983,
            "name": "蓬莱镇"
        },
        {
            "id": 3984,
            "name": "会文镇"
        },
        {
            "id": 3985,
            "name": "东路镇"
        },
        {
            "id": 3986,
            "name": "潭牛镇"
        },
        {
            "id": 3987,
            "name": "东阁镇"
        },
        {
            "id": 3988,
            "name": "文教镇"
        },
        {
            "id": 3989,
            "name": "东郊镇"
        },
        {
            "id": 3990,
            "name": "龙楼镇"
        },
        {
            "id": 3991,
            "name": "昌洒镇"
        },
        {
            "id": 3992,
            "name": "翁田镇"
        },
        {
            "id": 3993,
            "name": "抱罗镇"
        },
        {
            "id": 3994,
            "name": "冯坡镇"
        },
        {
            "id": 3995,
            "name": "锦山镇"
        },
        {
            "id": 3996,
            "name": "铺前镇"
        },
        {
            "id": 3997,
            "name": "公坡镇"
        },
        {
            "id": 3998,
            "name": "迈号镇"
        },
        {
            "id": 3999,
            "name": "清谰镇"
        },
        {
            "id": 4000,
            "name": "南阳镇"
        },
        {
            "id": 4001,
            "name": "新桥镇"
        },
        {
            "id": 4002,
            "name": "头苑镇"
        },
        {
            "id": 4003,
            "name": "宝芳乡"
        },
        {
            "id": 4004,
            "name": "龙马乡"
        },
        {
            "id": 4005,
            "name": "湖山乡"
        },
        {
            "id": 4006,
            "name": "东路农场"
        },
        {
            "id": 4007,
            "name": "南阳农场"
        },
        {
            "id": 4008,
            "name": "罗豆农场"
        },
        {
            "id": 4009,
            "name": "橡胶研究所"
        }],
        "id": 4010,
        "name": "文昌市"
    },
    {
        "child": [{
            "id": 4011,
            "name": "通什镇"
        },
        {
            "id": 4012,
            "name": "南圣镇"
        },
        {
            "id": 4013,
            "name": "毛阳镇"
        },
        {
            "id": 4014,
            "name": "番阳镇"
        },
        {
            "id": 4015,
            "name": "畅好乡"
        },
        {
            "id": 4016,
            "name": "毛道乡"
        },
        {
            "id": 4017,
            "name": "水满乡"
        },
        {
            "id": 4018,
            "name": "畅好农场"
        }],
        "id": 4019,
        "name": "五指山市"
    },
    {
        "child": [{
            "id": 4020,
            "name": "城区"
        },
        {
            "id": 4021,
            "name": "临城镇"
        },
        {
            "id": 4022,
            "name": "波莲镇"
        },
        {
            "id": 4023,
            "name": "东英镇"
        },
        {
            "id": 4024,
            "name": "博厚镇"
        },
        {
            "id": 4025,
            "name": "皇桐镇"
        },
        {
            "id": 4026,
            "name": "多文镇"
        },
        {
            "id": 4027,
            "name": "和舍镇"
        },
        {
            "id": 4028,
            "name": "南宝镇"
        },
        {
            "id": 4029,
            "name": "新盈镇"
        },
        {
            "id": 4030,
            "name": "调楼镇"
        },
        {
            "id": 4031,
            "name": "加来镇"
        },
        {
            "id": 4032,
            "name": "红华农场"
        },
        {
            "id": 4033,
            "name": "加来农场"
        }],
        "id": 4034,
        "name": "临高县"
    },
    {
        "child": [{
            "id": 4035,
            "name": "城区"
        },
        {
            "id": 4036,
            "name": "金江镇"
        },
        {
            "id": 4037,
            "name": "老城镇"
        },
        {
            "id": 4038,
            "name": "瑞溪镇"
        },
        {
            "id": 4039,
            "name": "永发镇"
        },
        {
            "id": 4040,
            "name": "加乐镇"
        },
        {
            "id": 4041,
            "name": "文儒镇"
        },
        {
            "id": 4042,
            "name": "中兴镇"
        },
        {
            "id": 4043,
            "name": "仁兴镇"
        },
        {
            "id": 4044,
            "name": "福山镇"
        },
        {
            "id": 4045,
            "name": "桥头镇"
        },
        {
            "id": 4046,
            "name": "大丰镇"
        },
        {
            "id": 4047,
            "name": "红光农场"
        },
        {
            "id": 4048,
            "name": "西达农场"
        },
        {
            "id": 4049,
            "name": "金安农场"
        }],
        "id": 4050,
        "name": "澄迈县"
    },
    {
        "child": [{
            "id": 4051,
            "name": "黄竹镇"
        },
        {
            "id": 4052,
            "name": "城区"
        },
        {
            "id": 4053,
            "name": "定城镇"
        },
        {
            "id": 4054,
            "name": "新竹镇"
        },
        {
            "id": 4055,
            "name": "龙湖镇"
        },
        {
            "id": 4056,
            "name": "雷鸣镇"
        },
        {
            "id": 4057,
            "name": "龙门镇"
        },
        {
            "id": 4058,
            "name": "龙河镇"
        },
        {
            "id": 4059,
            "name": "岭口镇"
        },
        {
            "id": 4060,
            "name": "翰林镇"
        },
        {
            "id": 4061,
            "name": "富文镇"
        },
        {
            "id": 4062,
            "name": "金鸡岭农场"
        },
        {
            "id": 4063,
            "name": "中瑞农场"
        },
        {
            "id": 4064,
            "name": "南海农场"
        }],
        "id": 4065,
        "name": "定安县"
    },
    {
        "child": [{
            "id": 4066,
            "name": "县城内"
        },
        {
            "id": 4067,
            "name": "屯城镇"
        },
        {
            "id": 4068,
            "name": "新兴镇"
        },
        {
            "id": 4069,
            "name": "枫木镇"
        },
        {
            "id": 4070,
            "name": "乌坡镇"
        },
        {
            "id": 4071,
            "name": "南吕镇"
        },
        {
            "id": 4072,
            "name": "南坤镇"
        },
        {
            "id": 4073,
            "name": "中建农场"
        },
        {
            "id": 4074,
            "name": "坡心镇"
        },
        {
            "id": 4075,
            "name": "中坤农场"
        },
        {
            "id": 4076,
            "name": "西昌镇"
        }],
        "id": 4077,
        "name": "屯昌县"
    },
    {
        "child": [{
            "id": 4078,
            "name": "红林农场"
        },
        {
            "id": 4079,
            "name": "城区"
        },
        {
            "id": 4080,
            "name": "石碌镇"
        },
        {
            "id": 4081,
            "name": "叉河镇"
        },
        {
            "id": 4082,
            "name": "十月田镇"
        },
        {
            "id": 4083,
            "name": "乌烈镇"
        },
        {
            "id": 4084,
            "name": "昌化镇"
        },
        {
            "id": 4085,
            "name": "海尾镇"
        },
        {
            "id": 4086,
            "name": "七叉镇"
        },
        {
            "id": 4087,
            "name": "王下乡"
        },
        {
            "id": 4088,
            "name": "海南矿业公司"
        },
        {
            "id": 4089,
            "name": "霸王岭林场"
        }],
        "id": 4090,
        "name": "昌江县"
    },
    {
        "child": [{
            "id": 4091,
            "name": "南开乡"
        },
        {
            "id": 4092,
            "name": "阜龙乡"
        },
        {
            "id": 4093,
            "name": "青松乡"
        },
        {
            "id": 4094,
            "name": "金波乡"
        },
        {
            "id": 4095,
            "name": "荣邦乡"
        },
        {
            "id": 4096,
            "name": "城区"
        },
        {
            "id": 4097,
            "name": "白沙农场"
        },
        {
            "id": 4098,
            "name": "牙叉镇"
        },
        {
            "id": 4099,
            "name": "龙江农场"
        },
        {
            "id": 4100,
            "name": "七坊镇"
        },
        {
            "id": 4101,
            "name": "邦溪农场"
        },
        {
            "id": 4102,
            "name": "邦溪镇"
        },
        {
            "id": 4103,
            "name": "打安镇"
        },
        {
            "id": 4104,
            "name": "细水乡"
        },
        {
            "id": 4105,
            "name": "元门乡"
        }],
        "id": 4106,
        "name": "白沙县"
    },
    {
        "child": [{
            "id": 4107,
            "name": "吊罗山乡"
        },
        {
            "id": 4108,
            "name": "黎母山林业公司"
        },
        {
            "id": 4109,
            "name": "阳江农场"
        },
        {
            "id": 4110,
            "name": "乌石农场"
        },
        {
            "id": 4111,
            "name": "加钗农场"
        },
        {
            "id": 4112,
            "name": "长征农场"
        },
        {
            "id": 4113,
            "name": "营根镇"
        },
        {
            "id": 4114,
            "name": "湾岭镇"
        },
        {
            "id": 4115,
            "name": "黎母山镇"
        },
        {
            "id": 4116,
            "name": "和平镇"
        },
        {
            "id": 4117,
            "name": "长征镇"
        },
        {
            "id": 4118,
            "name": "红毛镇"
        },
        {
            "id": 4119,
            "name": "中平镇"
        },
        {
            "id": 4120,
            "name": "上安乡"
        },
        {
            "id": 4121,
            "name": "什运乡"
        },
        {
            "id": 4122,
            "name": "城区"
        }],
        "id": 4123,
        "name": "琼中县"
    },
    {
        "child": [{
            "id": 4124,
            "name": "东华镇"
        },
        {
            "id": 4125,
            "name": "南平镇"
        },
        {
            "id": 4126,
            "name": "吊罗山林业公司"
        },
        {
            "id": 4127,
            "name": "岭门农场"
        },
        {
            "id": 4128,
            "name": "南平农场"
        },
        {
            "id": 4129,
            "name": "椰林镇"
        },
        {
            "id": 4130,
            "name": "光坡镇"
        },
        {
            "id": 4131,
            "name": "三才镇"
        },
        {
            "id": 4132,
            "name": "英州镇"
        },
        {
            "id": 4133,
            "name": "隆广镇"
        },
        {
            "id": 4134,
            "name": "文罗镇"
        },
        {
            "id": 4135,
            "name": "本号镇"
        },
        {
            "id": 4136,
            "name": "新村镇"
        },
        {
            "id": 4137,
            "name": "黎安镇"
        },
        {
            "id": 4138,
            "name": "提蒙乡"
        },
        {
            "id": 4139,
            "name": "群英乡"
        },
        {
            "id": 4140,
            "name": "城区"
        }],
        "id": 4141,
        "name": "陵水县"
    },
    {
        "child": [{
            "id": 4142,
            "name": "保亭研究所"
        },
        {
            "id": 4143,
            "name": "新星农场"
        },
        {
            "id": 4144,
            "name": "金江农场"
        },
        {
            "id": 4145,
            "name": "三道农场"
        },
        {
            "id": 4146,
            "name": "保城镇"
        },
        {
            "id": 4147,
            "name": "什玲镇"
        },
        {
            "id": 4148,
            "name": "加茂镇"
        },
        {
            "id": 4149,
            "name": "响水镇"
        },
        {
            "id": 4150,
            "name": "新政镇"
        },
        {
            "id": 4151,
            "name": "三道镇"
        },
        {
            "id": 4152,
            "name": "六弓乡"
        },
        {
            "id": 4153,
            "name": "南林乡"
        },
        {
            "id": 4154,
            "name": "毛感乡"
        }],
        "id": 4155,
        "name": "保亭县"
    },
    {
        "child": [{
            "id": 4156,
            "name": "尖峰岭林业公司"
        },
        {
            "id": 4157,
            "name": "莺歌海盐场"
        },
        {
            "id": 4158,
            "name": "山荣农场"
        },
        {
            "id": 4159,
            "name": "乐光农场"
        },
        {
            "id": 4160,
            "name": "抱由镇"
        },
        {
            "id": 4161,
            "name": "保国农场"
        },
        {
            "id": 4162,
            "name": "万冲镇"
        },
        {
            "id": 4163,
            "name": "大安镇"
        },
        {
            "id": 4164,
            "name": "志仲镇"
        },
        {
            "id": 4165,
            "name": "千家镇"
        },
        {
            "id": 4166,
            "name": "九所镇"
        },
        {
            "id": 4167,
            "name": "利国镇"
        },
        {
            "id": 4168,
            "name": "黄流镇"
        },
        {
            "id": 4169,
            "name": "佛罗镇"
        },
        {
            "id": 4170,
            "name": "尖峰镇"
        },
        {
            "id": 4171,
            "name": "莺歌海镇"
        },
        {
            "id": 4172,
            "name": "城区"
        }],
        "id": 4173,
        "name": "乐东县"
    },
    {
        "child": [{
            "id": 4174,
            "name": "中沙群岛"
        },
        {
            "id": 4175,
            "name": "西沙群岛"
        },
        {
            "id": 4176,
            "name": "南沙群岛"
        }],
        "id": 4177,
        "name": "三沙市"
    },
    {
        "child": [{
            "id": 4178,
            "name": "热作学院"
        },
        {
            "id": 4179,
            "name": "那大镇"
        },
        {
            "id": 4180,
            "name": "富克镇"
        },
        {
            "id": 4181,
            "name": "和庆镇"
        },
        {
            "id": 4182,
            "name": "南丰镇"
        },
        {
            "id": 4183,
            "name": "大成镇"
        },
        {
            "id": 4184,
            "name": "雅星镇"
        },
        {
            "id": 4185,
            "name": "兰洋镇"
        },
        {
            "id": 4186,
            "name": "光村镇"
        },
        {
            "id": 4187,
            "name": "木棠镇"
        },
        {
            "id": 4188,
            "name": "海头镇"
        },
        {
            "id": 4189,
            "name": "峨蔓镇"
        },
        {
            "id": 4190,
            "name": "三都镇"
        },
        {
            "id": 4191,
            "name": "王五镇"
        },
        {
            "id": 4192,
            "name": "白马井镇"
        },
        {
            "id": 4193,
            "name": "中和镇"
        },
        {
            "id": 4194,
            "name": "排浦镇"
        },
        {
            "id": 4195,
            "name": "东成镇"
        },
        {
            "id": 4196,
            "name": "新州镇"
        },
        {
            "id": 4197,
            "name": "洋浦经济开发区"
        },
        {
            "id": 4198,
            "name": "西培农场"
        },
        {
            "id": 4199,
            "name": "西联农场"
        },
        {
            "id": 4200,
            "name": "蓝洋农场"
        },
        {
            "id": 4201,
            "name": "八一农场"
        },
        {
            "id": 4202,
            "name": "西华农场"
        },
        {
            "id": 4203,
            "name": "西庆农场"
        },
        {
            "id": 4204,
            "name": "西流农场"
        },
        {
            "id": 4205,
            "name": "新盈农场"
        },
        {
            "id": 4206,
            "name": "龙山农场"
        },
        {
            "id": 4207,
            "name": "红岭农场"
        }],
        "id": 4208,
        "name": "儋州市"
    }]
},
{
    "id": 4209,
    "name": "贵州",
    "child": [{
        "child": [{
            "id": 4210,
            "name": "南明区"
        },
        {
            "id": 4211,
            "name": "云岩区"
        },
        {
            "id": 4212,
            "name": "花溪区"
        },
        {
            "id": 4213,
            "name": "小河区"
        },
        {
            "id": 4214,
            "name": "白云区"
        },
        {
            "id": 4215,
            "name": "清镇市"
        },
        {
            "id": 4216,
            "name": "开阳县"
        },
        {
            "id": 4217,
            "name": "修文县"
        },
        {
            "id": 4218,
            "name": "息烽县"
        },
        {
            "id": 4219,
            "name": "乌当区"
        },
        {
            "id": 4220,
            "name": "观山湖区"
        }],
        "id": 4221,
        "name": "贵阳市"
    },
    {
        "child": [{
            "id": 4222,
            "name": "盘县"
        },
        {
            "id": 4223,
            "name": "六枝特区"
        },
        {
            "id": 4224,
            "name": "水城县"
        },
        {
            "id": 4225,
            "name": "钟山区"
        }],
        "id": 4226,
        "name": "六盘水市"
    },
    {
        "child": [{
            "id": 4227,
            "name": "红花岗区"
        },
        {
            "id": 4228,
            "name": "汇川区"
        },
        {
            "id": 4229,
            "name": "赤水市"
        },
        {
            "id": 4230,
            "name": "仁怀市"
        },
        {
            "id": 4231,
            "name": "遵义县"
        },
        {
            "id": 4232,
            "name": "桐梓县"
        },
        {
            "id": 4233,
            "name": "绥阳县"
        },
        {
            "id": 4234,
            "name": "习水县"
        },
        {
            "id": 4235,
            "name": "凤冈县"
        },
        {
            "id": 4236,
            "name": "正安县"
        },
        {
            "id": 4237,
            "name": "湄潭县"
        },
        {
            "id": 4238,
            "name": "余庆县"
        },
        {
            "id": 4239,
            "name": "道真县"
        },
        {
            "id": 4240,
            "name": "务川县"
        }],
        "id": 4241,
        "name": "遵义市"
    },
    {
        "child": [{
            "id": 4242,
            "name": "碧江区"
        },
        {
            "id": 4243,
            "name": "德江县"
        },
        {
            "id": 4244,
            "name": "江口县"
        },
        {
            "id": 4245,
            "name": "思南县"
        },
        {
            "id": 4246,
            "name": "万山区"
        },
        {
            "id": 4247,
            "name": "石阡县"
        },
        {
            "id": 4248,
            "name": "玉屏侗族自治县"
        },
        {
            "id": 4249,
            "name": "松桃苗族自治县"
        },
        {
            "id": 4250,
            "name": "印江土家族苗族自治县"
        },
        {
            "id": 4251,
            "name": "沿河土家族自治县"
        }],
        "id": 4252,
        "name": "铜仁市"
    },
    {
        "child": [{
            "id": 4253,
            "name": "七星关区"
        },
        {
            "id": 4254,
            "name": "黔西县"
        },
        {
            "id": 4255,
            "name": "大方县"
        },
        {
            "id": 4256,
            "name": "织金县"
        },
        {
            "id": 4257,
            "name": "金沙县"
        },
        {
            "id": 4258,
            "name": "赫章县"
        },
        {
            "id": 4259,
            "name": "纳雍县"
        },
        {
            "id": 4260,
            "name": "威宁彝族回族苗族自治县"
        }],
        "id": 4261,
        "name": "毕节市"
    },
    {
        "child": [{
            "id": 4262,
            "name": "西秀区"
        },
        {
            "id": 4263,
            "name": "普定县"
        },
        {
            "id": 4264,
            "name": "平坝县"
        },
        {
            "id": 4265,
            "name": "镇宁布依族苗族自治县"
        },
        {
            "id": 4266,
            "name": "关岭布依族苗族自治县"
        },
        {
            "id": 4267,
            "name": "紫云苗族布依族自治县"
        }],
        "id": 4268,
        "name": "安顺市"
    },
    {
        "child": [{
            "id": 4269,
            "name": "兴义市"
        },
        {
            "id": 4270,
            "name": "望谟县"
        },
        {
            "id": 4271,
            "name": "兴仁县"
        },
        {
            "id": 4272,
            "name": "普安县"
        },
        {
            "id": 4273,
            "name": "册亨县"
        },
        {
            "id": 4274,
            "name": "晴隆县"
        },
        {
            "id": 4275,
            "name": "贞丰县"
        },
        {
            "id": 4276,
            "name": "安龙县"
        }],
        "id": 4277,
        "name": "黔西南州"
    },
    {
        "child": [{
            "id": 4278,
            "name": "凯里市"
        },
        {
            "id": 4279,
            "name": "施秉市"
        },
        {
            "id": 4280,
            "name": "从江县"
        },
        {
            "id": 4281,
            "name": "锦屏县"
        },
        {
            "id": 4282,
            "name": "镇远县"
        },
        {
            "id": 4283,
            "name": "麻江县"
        },
        {
            "id": 4284,
            "name": "台江县"
        },
        {
            "id": 4285,
            "name": "天柱县"
        },
        {
            "id": 4286,
            "name": "黄平县"
        },
        {
            "id": 4287,
            "name": "榕江县"
        },
        {
            "id": 4288,
            "name": "剑河县"
        },
        {
            "id": 4289,
            "name": "三穗县"
        },
        {
            "id": 4290,
            "name": "雷山县"
        },
        {
            "id": 4291,
            "name": "黎平县"
        },
        {
            "id": 4292,
            "name": "岑巩县"
        },
        {
            "id": 4293,
            "name": "丹寨县"
        }],
        "id": 4294,
        "name": "黔东南州"
    },
    {
        "child": [{
            "id": 4295,
            "name": "都匀市"
        },
        {
            "id": 4296,
            "name": "福泉市"
        },
        {
            "id": 4297,
            "name": "贵定县"
        },
        {
            "id": 4298,
            "name": "惠水县"
        },
        {
            "id": 4299,
            "name": "罗甸县"
        },
        {
            "id": 4300,
            "name": "瓮安县"
        },
        {
            "id": 4301,
            "name": "荔波县"
        },
        {
            "id": 4302,
            "name": "龙里县"
        },
        {
            "id": 4303,
            "name": "平塘县"
        },
        {
            "id": 4304,
            "name": "长顺县"
        },
        {
            "id": 4305,
            "name": "独山县"
        },
        {
            "id": 4306,
            "name": "三都县"
        }],
        "id": 4307,
        "name": "黔南州"
    }]
},
{
    "id": 4308,
    "name": "云南",
    "child": [{
        "child": [{
            "id": 4309,
            "name": "玉龙县"
        },
        {
            "id": 4310,
            "name": "华坪县"
        },
        {
            "id": 4311,
            "name": "永胜县"
        },
        {
            "id": 4312,
            "name": "宁蒗县"
        },
        {
            "id": 4313,
            "name": "古城区"
        }],
        "id": 4314,
        "name": "丽江市"
    },
    {
        "child": [{
            "id": 4315,
            "name": "文山市"
        },
        {
            "id": 4316,
            "name": "麻栗坡县"
        },
        {
            "id": 4317,
            "name": "砚山县"
        },
        {
            "id": 4318,
            "name": "广南县"
        },
        {
            "id": 4319,
            "name": "马关县"
        },
        {
            "id": 4320,
            "name": "富宁县"
        },
        {
            "id": 4321,
            "name": "西畴县"
        },
        {
            "id": 4322,
            "name": "丘北县"
        }],
        "id": 4323,
        "name": "文山州"
    },
    {
        "child": [{
            "id": 4324,
            "name": "香格里拉县"
        },
        {
            "id": 4325,
            "name": "德钦县"
        },
        {
            "id": 4326,
            "name": "维西县"
        }],
        "id": 4327,
        "name": "迪庆州"
    },
    {
        "child": [{
            "id": 4328,
            "name": "个旧市"
        },
        {
            "id": 4329,
            "name": "开远市"
        },
        {
            "id": 4330,
            "name": "弥勒县"
        },
        {
            "id": 4331,
            "name": "红河县"
        },
        {
            "id": 4332,
            "name": "绿春县"
        },
        {
            "id": 4333,
            "name": "蒙自市"
        },
        {
            "id": 4334,
            "name": "泸西县"
        },
        {
            "id": 4335,
            "name": "建水县"
        },
        {
            "id": 4336,
            "name": "元阳县"
        },
        {
            "id": 4337,
            "name": "石屏县"
        },
        {
            "id": 4338,
            "name": "金平县"
        },
        {
            "id": 4339,
            "name": "屏边县"
        },
        {
            "id": 4340,
            "name": "河口县"
        }],
        "id": 4341,
        "name": "红河州"
    },
    {
        "child": [{
            "id": 4342,
            "name": "景洪市"
        },
        {
            "id": 4343,
            "name": "勐海县"
        },
        {
            "id": 4344,
            "name": "勐腊县"
        }],
        "id": 4345,
        "name": "西双版纳州"
    },
    {
        "child": [{
            "id": 4346,
            "name": "元谋县"
        },
        {
            "id": 4347,
            "name": "南华县"
        },
        {
            "id": 4348,
            "name": "牟定县"
        },
        {
            "id": 4349,
            "name": "武定县"
        },
        {
            "id": 4350,
            "name": "大姚县"
        },
        {
            "id": 4351,
            "name": "双柏县"
        },
        {
            "id": 4352,
            "name": "禄丰县"
        },
        {
            "id": 4353,
            "name": "永仁县"
        },
        {
            "id": 4354,
            "name": "姚安县"
        },
        {
            "id": 4355,
            "name": "楚雄市"
        }],
        "id": 4356,
        "name": "楚雄州"
    },
    {
        "child": [{
            "id": 4357,
            "name": "剑川县"
        },
        {
            "id": 4358,
            "name": "弥渡县"
        },
        {
            "id": 4359,
            "name": "云龙县"
        },
        {
            "id": 4360,
            "name": "洱源县"
        },
        {
            "id": 4361,
            "name": "鹤庆县"
        },
        {
            "id": 4362,
            "name": "宾川县"
        },
        {
            "id": 4363,
            "name": "祥云县"
        },
        {
            "id": 4364,
            "name": "永平县"
        },
        {
            "id": 4365,
            "name": "巍山县"
        },
        {
            "id": 4366,
            "name": "漾濞县"
        },
        {
            "id": 4367,
            "name": "南涧县"
        },
        {
            "id": 4368,
            "name": "大理市"
        }],
        "id": 4369,
        "name": "大理州"
    },
    {
        "child": [{
            "id": 4370,
            "name": "芒市"
        },
        {
            "id": 4371,
            "name": "瑞丽市"
        },
        {
            "id": 4372,
            "name": "盈江县"
        },
        {
            "id": 4373,
            "name": "梁河县"
        },
        {
            "id": 4374,
            "name": "陇川县"
        }],
        "id": 4375,
        "name": "德宏州"
    },
    {
        "child": [{
            "id": 4376,
            "name": "泸水县"
        },
        {
            "id": 4377,
            "name": "福贡县"
        },
        {
            "id": 4378,
            "name": "兰坪县"
        },
        {
            "id": 4379,
            "name": "贡山县"
        }],
        "id": 4380,
        "name": "怒江州"
    },
    {
        "child": [{
            "id": 4381,
            "name": "盘龙区"
        },
        {
            "id": 4382,
            "name": "五华区"
        },
        {
            "id": 4383,
            "name": "西山区"
        },
        {
            "id": 4384,
            "name": "官渡区"
        },
        {
            "id": 4385,
            "name": "呈贡区"
        },
        {
            "id": 4386,
            "name": "东川区"
        },
        {
            "id": 4387,
            "name": "安宁市"
        },
        {
            "id": 4388,
            "name": "富民县"
        },
        {
            "id": 4389,
            "name": "嵩明县"
        },
        {
            "id": 4390,
            "name": "晋宁县"
        },
        {
            "id": 4391,
            "name": "宜良县"
        },
        {
            "id": 4392,
            "name": "禄劝县"
        },
        {
            "id": 4393,
            "name": "石林县"
        },
        {
            "id": 4394,
            "name": "寻甸县"
        }],
        "id": 4395,
        "name": "昆明市"
    },
    {
        "child": [{
            "id": 4396,
            "name": "麒麟区"
        },
        {
            "id": 4397,
            "name": "马龙县"
        },
        {
            "id": 4398,
            "name": "宣威市"
        },
        {
            "id": 4399,
            "name": "富源县"
        },
        {
            "id": 4400,
            "name": "会泽县"
        },
        {
            "id": 4401,
            "name": "陆良县"
        },
        {
            "id": 4402,
            "name": "师宗县"
        },
        {
            "id": 4403,
            "name": "罗平县"
        },
        {
            "id": 4404,
            "name": "沾益县"
        }],
        "id": 4405,
        "name": "曲靖市"
    },
    {
        "child": [{
            "id": 4406,
            "name": "红塔区"
        },
        {
            "id": 4407,
            "name": "华宁县"
        },
        {
            "id": 4408,
            "name": "澄江县"
        },
        {
            "id": 4409,
            "name": "易门县"
        },
        {
            "id": 4410,
            "name": "通海县"
        },
        {
            "id": 4411,
            "name": "江川县"
        },
        {
            "id": 4412,
            "name": "元江县"
        },
        {
            "id": 4413,
            "name": "新平县"
        },
        {
            "id": 4414,
            "name": "峨山县"
        }],
        "id": 4415,
        "name": "玉溪市"
    },
    {
        "child": [{
            "id": 4416,
            "name": "鲁甸县"
        },
        {
            "id": 4417,
            "name": "绥江县"
        },
        {
            "id": 4418,
            "name": "昭阳区"
        },
        {
            "id": 4419,
            "name": "镇雄县"
        },
        {
            "id": 4420,
            "name": "永善县"
        },
        {
            "id": 4421,
            "name": "大关县"
        },
        {
            "id": 4422,
            "name": "盐津县"
        },
        {
            "id": 4423,
            "name": "彝良县"
        },
        {
            "id": 4424,
            "name": "水富县"
        },
        {
            "id": 4425,
            "name": "巧家县"
        },
        {
            "id": 4426,
            "name": "威信县"
        }],
        "id": 4427,
        "name": "昭通市"
    },
    {
        "child": [{
            "id": 4428,
            "name": "孟连县"
        },
        {
            "id": 4429,
            "name": "思茅区"
        },
        {
            "id": 4430,
            "name": "宁洱县"
        },
        {
            "id": 4431,
            "name": "景东县"
        },
        {
            "id": 4432,
            "name": "镇沅县"
        },
        {
            "id": 4433,
            "name": "景谷县"
        },
        {
            "id": 4434,
            "name": "墨江县"
        },
        {
            "id": 4435,
            "name": "澜沧县"
        },
        {
            "id": 4436,
            "name": "西盟县"
        },
        {
            "id": 4437,
            "name": "江城县"
        }],
        "id": 4438,
        "name": "普洱市"
    },
    {
        "child": [{
            "id": 4439,
            "name": "双江县"
        },
        {
            "id": 4440,
            "name": "沧源县"
        },
        {
            "id": 4441,
            "name": "临翔区"
        },
        {
            "id": 4442,
            "name": "镇康县"
        },
        {
            "id": 4443,
            "name": "凤庆县"
        },
        {
            "id": 4444,
            "name": "云县"
        },
        {
            "id": 4445,
            "name": "永德县"
        },
        {
            "id": 4446,
            "name": "耿马县"
        }],
        "id": 4447,
        "name": "临沧市"
    },
    {
        "child": [{
            "id": 4448,
            "name": "隆阳区"
        },
        {
            "id": 4449,
            "name": "施甸县"
        },
        {
            "id": 4450,
            "name": "昌宁县"
        },
        {
            "id": 4451,
            "name": "龙陵县"
        },
        {
            "id": 4452,
            "name": "腾冲县"
        }],
        "id": 4453,
        "name": "保山市"
    }]
},
{
    "id": 4454,
    "name": "西藏",
    "child": [{
        "child": [{
            "id": 4455,
            "name": "双湖县"
        },
        {
            "id": 4456,
            "name": "索县"
        },
        {
            "id": 4457,
            "name": "那曲县"
        },
        {
            "id": 4458,
            "name": "嘉黎县"
        },
        {
            "id": 4459,
            "name": "比如县"
        },
        {
            "id": 4460,
            "name": "聂荣县"
        },
        {
            "id": 4461,
            "name": "安多县"
        },
        {
            "id": 4462,
            "name": "申扎县"
        },
        {
            "id": 4463,
            "name": "班戈县"
        },
        {
            "id": 4464,
            "name": "巴青县"
        },
        {
            "id": 4465,
            "name": "尼玛县"
        }],
        "id": 4466,
        "name": "那曲地区"
    },
    {
        "child": [{
            "id": 4467,
            "name": "贡嘎县"
        },
        {
            "id": 4468,
            "name": "扎囊县"
        },
        {
            "id": 4469,
            "name": "乃东县"
        },
        {
            "id": 4470,
            "name": "桑日县"
        },
        {
            "id": 4471,
            "name": "琼结县"
        },
        {
            "id": 4472,
            "name": "曲松县"
        },
        {
            "id": 4473,
            "name": "措美县"
        },
        {
            "id": 4474,
            "name": "洛扎县"
        },
        {
            "id": 4475,
            "name": "加查县"
        },
        {
            "id": 4476,
            "name": "隆子县"
        },
        {
            "id": 4477,
            "name": "错那县"
        },
        {
            "id": 4478,
            "name": "浪卡子县"
        }],
        "id": 4479,
        "name": "山南地区"
    },
    {
        "child": [{
            "id": 4480,
            "name": "昌都县"
        },
        {
            "id": 4481,
            "name": "江达县"
        },
        {
            "id": 4482,
            "name": "贡觉县"
        },
        {
            "id": 4483,
            "name": "类乌齐县"
        },
        {
            "id": 4484,
            "name": "丁青县"
        },
        {
            "id": 4485,
            "name": "察雅县"
        },
        {
            "id": 4486,
            "name": "八宿县"
        },
        {
            "id": 4487,
            "name": "左贡县"
        },
        {
            "id": 4488,
            "name": "芒康县"
        },
        {
            "id": 4489,
            "name": "洛隆县"
        },
        {
            "id": 4490,
            "name": "边坝县"
        }],
        "id": 4491,
        "name": "昌都地区"
    },
    {
        "child": [{
            "id": 4492,
            "name": "聂拉木县"
        },
        {
            "id": 4493,
            "name": "昂仁县"
        },
        {
            "id": 4494,
            "name": "日喀则市"
        },
        {
            "id": 4495,
            "name": "南木林县"
        },
        {
            "id": 4496,
            "name": "江孜县"
        },
        {
            "id": 4497,
            "name": "定日县"
        },
        {
            "id": 4498,
            "name": "萨迦县　"
        },
        {
            "id": 4499,
            "name": "拉孜县"
        },
        {
            "id": 4500,
            "name": "谢通门县"
        },
        {
            "id": 4501,
            "name": "白朗县"
        },
        {
            "id": 4502,
            "name": "仁布县"
        },
        {
            "id": 4503,
            "name": "康马县"
        },
        {
            "id": 4504,
            "name": "定结县"
        },
        {
            "id": 4505,
            "name": "仲巴县"
        },
        {
            "id": 4506,
            "name": "亚东县"
        },
        {
            "id": 4507,
            "name": "吉隆县"
        },
        {
            "id": 4508,
            "name": "萨嘎县"
        },
        {
            "id": 4509,
            "name": "岗巴县"
        }],
        "id": 4510,
        "name": "日喀则地区"
    },
    {
        "child": [{
            "id": 4511,
            "name": "噶尔县"
        },
        {
            "id": 4512,
            "name": "普兰县"
        },
        {
            "id": 4513,
            "name": "札达县　"
        },
        {
            "id": 4514,
            "name": "日土县"
        },
        {
            "id": 4515,
            "name": "革吉县"
        },
        {
            "id": 4516,
            "name": "改则县"
        },
        {
            "id": 4517,
            "name": "措勤县"
        }],
        "id": 4518,
        "name": "阿里地区"
    },
    {
        "child": [{
            "id": 4519,
            "name": "林芝县"
        },
        {
            "id": 4520,
            "name": "工布江达县"
        },
        {
            "id": 4521,
            "name": "米林县"
        },
        {
            "id": 4522,
            "name": "墨脱县"
        },
        {
            "id": 4523,
            "name": "波密县"
        },
        {
            "id": 4524,
            "name": "察隅县"
        },
        {
            "id": 4525,
            "name": "朗县"
        }],
        "id": 4526,
        "name": "林芝地区"
    },
    {
        "child": [{
            "id": 4527,
            "name": "城关区"
        },
        {
            "id": 4528,
            "name": "林周县"
        },
        {
            "id": 4529,
            "name": "当雄县"
        },
        {
            "id": 4530,
            "name": "尼木县"
        },
        {
            "id": 4531,
            "name": "曲水县"
        },
        {
            "id": 4532,
            "name": "堆龙德庆县"
        },
        {
            "id": 4533,
            "name": "达孜县"
        },
        {
            "id": 4534,
            "name": "墨竹工卡县"
        }],
        "id": 4535,
        "name": "拉萨市"
    }]
},
{
    "id": 4536,
    "name": "陕西",
    "child": [{
        "child": [{
            "id": 4537,
            "name": "新城区"
        },
        {
            "id": 4538,
            "name": "雁塔区"
        },
        {
            "id": 4539,
            "name": "未央区"
        },
        {
            "id": 4540,
            "name": "长安区"
        },
        {
            "id": 4541,
            "name": "灞桥区"
        },
        {
            "id": 4542,
            "name": "碑林区"
        },
        {
            "id": 4543,
            "name": "莲湖区"
        },
        {
            "id": 4544,
            "name": "临潼区"
        },
        {
            "id": 4545,
            "name": "阎良区"
        },
        {
            "id": 4546,
            "name": "西安武警工程学院"
        },
        {
            "id": 4547,
            "name": "高陵县"
        },
        {
            "id": 4548,
            "name": "蓝田县"
        },
        {
            "id": 4549,
            "name": "户县"
        },
        {
            "id": 4550,
            "name": "周至县"
        }],
        "id": 4551,
        "name": "西安市"
    },
    {
        "child": [{
            "id": 4552,
            "name": "印台区"
        },
        {
            "id": 4553,
            "name": "宜君县"
        },
        {
            "id": 4554,
            "name": "王益区"
        },
        {
            "id": 4555,
            "name": "耀州区"
        }],
        "id": 4556,
        "name": "铜川市"
    },
    {
        "child": [{
            "id": 4557,
            "name": "渭滨区"
        },
        {
            "id": 4558,
            "name": "金台区"
        },
        {
            "id": 4559,
            "name": "岐山县"
        },
        {
            "id": 4560,
            "name": "太白县"
        },
        {
            "id": 4561,
            "name": "凤翔县"
        },
        {
            "id": 4562,
            "name": "陇县"
        },
        {
            "id": 4563,
            "name": "麟游县"
        },
        {
            "id": 4564,
            "name": "千阳县"
        },
        {
            "id": 4565,
            "name": "扶风县"
        },
        {
            "id": 4566,
            "name": "凤县"
        },
        {
            "id": 4567,
            "name": "眉县"
        },
        {
            "id": 4568,
            "name": "陈仓区"
        }],
        "id": 4569,
        "name": "宝鸡市"
    },
    {
        "child": [{
            "id": 4570,
            "name": "秦都区"
        },
        {
            "id": 4571,
            "name": "渭城区"
        },
        {
            "id": 4572,
            "name": "兴平市"
        },
        {
            "id": 4573,
            "name": "礼泉县"
        },
        {
            "id": 4574,
            "name": "泾阳县"
        },
        {
            "id": 4575,
            "name": "永寿县"
        },
        {
            "id": 4576,
            "name": "三原县"
        },
        {
            "id": 4577,
            "name": "彬县"
        },
        {
            "id": 4578,
            "name": "旬邑县"
        },
        {
            "id": 4579,
            "name": "长武县"
        },
        {
            "id": 4580,
            "name": "乾县"
        },
        {
            "id": 4581,
            "name": "武功县"
        },
        {
            "id": 4582,
            "name": "淳化县"
        },
        {
            "id": 4583,
            "name": "杨陵区"
        }],
        "id": 4584,
        "name": "咸阳市"
    },
    {
        "child": [{
            "id": 4585,
            "name": "韩城市"
        },
        {
            "id": 4586,
            "name": "华阴市"
        },
        {
            "id": 4587,
            "name": "蒲城县"
        },
        {
            "id": 4588,
            "name": "华县"
        },
        {
            "id": 4589,
            "name": "潼关县"
        },
        {
            "id": 4590,
            "name": "大荔县"
        },
        {
            "id": 4591,
            "name": "澄城县"
        },
        {
            "id": 4592,
            "name": "合阳县"
        },
        {
            "id": 4593,
            "name": "白水县"
        },
        {
            "id": 4594,
            "name": "富平县"
        },
        {
            "id": 4595,
            "name": "临渭区"
        }],
        "id": 4596,
        "name": "渭南市"
    },
    {
        "child": [{
            "id": 4597,
            "name": "宝塔区"
        },
        {
            "id": 4598,
            "name": "安塞县"
        },
        {
            "id": 4599,
            "name": "洛川县"
        },
        {
            "id": 4600,
            "name": "子长县"
        },
        {
            "id": 4601,
            "name": "黄陵县"
        },
        {
            "id": 4602,
            "name": "延长县"
        },
        {
            "id": 4603,
            "name": "宜川县"
        },
        {
            "id": 4604,
            "name": "延川县"
        },
        {
            "id": 4605,
            "name": "甘泉县"
        },
        {
            "id": 4606,
            "name": "富县"
        },
        {
            "id": 4607,
            "name": "志丹县"
        },
        {
            "id": 4608,
            "name": "黄龙县"
        },
        {
            "id": 4609,
            "name": "吴起县"
        }],
        "id": 4610,
        "name": "延安市"
    },
    {
        "child": [{
            "id": 4611,
            "name": "经济开发区南区"
        },
        {
            "id": 4612,
            "name": "汉台区"
        },
        {
            "id": 4613,
            "name": "南郑县"
        },
        {
            "id": 4614,
            "name": "城固县"
        },
        {
            "id": 4615,
            "name": "洋县"
        },
        {
            "id": 4616,
            "name": "佛坪县"
        },
        {
            "id": 4617,
            "name": "留坝县"
        },
        {
            "id": 4618,
            "name": "镇巴县"
        },
        {
            "id": 4619,
            "name": "西乡县"
        },
        {
            "id": 4620,
            "name": "勉县"
        },
        {
            "id": 4621,
            "name": "略阳县"
        },
        {
            "id": 4622,
            "name": "宁强县"
        }],
        "id": 4623,
        "name": "汉中市"
    },
    {
        "child": [{
            "id": 4624,
            "name": "清涧县"
        },
        {
            "id": 4625,
            "name": "绥德县"
        },
        {
            "id": 4626,
            "name": "佳县"
        },
        {
            "id": 4627,
            "name": "神木县"
        },
        {
            "id": 4628,
            "name": "府谷县"
        },
        {
            "id": 4629,
            "name": "子洲县"
        },
        {
            "id": 4630,
            "name": "横山县"
        },
        {
            "id": 4631,
            "name": "米脂县"
        },
        {
            "id": 4632,
            "name": "吴堡县"
        },
        {
            "id": 4633,
            "name": "定边县"
        },
        {
            "id": 4634,
            "name": "榆阳区"
        },
        {
            "id": 4635,
            "name": "靖边县"
        }],
        "id": 4636,
        "name": "榆林市"
    },
    {
        "child": [{
            "id": 4637,
            "name": "商州区"
        },
        {
            "id": 4638,
            "name": "镇安县"
        },
        {
            "id": 4639,
            "name": "山阳县"
        },
        {
            "id": 4640,
            "name": "洛南县"
        },
        {
            "id": 4641,
            "name": "商南县"
        },
        {
            "id": 4642,
            "name": "丹凤县"
        },
        {
            "id": 4643,
            "name": "柞水县"
        }],
        "id": 4644,
        "name": "商洛市"
    },
    {
        "child": [{
            "id": 4645,
            "name": "汉滨区"
        },
        {
            "id": 4646,
            "name": "紫阳县"
        },
        {
            "id": 4647,
            "name": "岚皋县"
        },
        {
            "id": 4648,
            "name": "旬阳县"
        },
        {
            "id": 4649,
            "name": "镇坪县"
        },
        {
            "id": 4650,
            "name": "平利县"
        },
        {
            "id": 4651,
            "name": "宁陕县"
        },
        {
            "id": 4652,
            "name": "汉阴县"
        },
        {
            "id": 4653,
            "name": "石泉县"
        },
        {
            "id": 4654,
            "name": "白河县"
        }],
        "id": 4655,
        "name": "安康市"
    }]
},
{
    "id": 4656,
    "name": "甘肃",
    "child": [{
        "child": [{
            "id": 4657,
            "name": "合作市"
        },
        {
            "id": 4658,
            "name": "夏河县"
        },
        {
            "id": 4659,
            "name": "碌曲县"
        },
        {
            "id": 4660,
            "name": "舟曲县"
        },
        {
            "id": 4661,
            "name": "玛曲县"
        },
        {
            "id": 4662,
            "name": "迭部县"
        },
        {
            "id": 4663,
            "name": "临潭县"
        },
        {
            "id": 4664,
            "name": "卓尼县"
        }],
        "id": 4665,
        "name": "甘南州"
    },
    {
        "child": [{
            "id": 4666,
            "name": "岷县"
        },
        {
            "id": 4667,
            "name": "安定区"
        },
        {
            "id": 4668,
            "name": "通渭县"
        },
        {
            "id": 4669,
            "name": "临洮县"
        },
        {
            "id": 4670,
            "name": "漳县"
        },
        {
            "id": 4671,
            "name": "渭源县"
        },
        {
            "id": 4672,
            "name": "陇西县"
        }],
        "id": 4673,
        "name": "定西市"
    },
    {
        "child": [{
            "id": 4674,
            "name": "临夏县"
        },
        {
            "id": 4675,
            "name": "康乐县"
        },
        {
            "id": 4676,
            "name": "永靖县"
        },
        {
            "id": 4677,
            "name": "和政县"
        },
        {
            "id": 4678,
            "name": "东乡族自治县"
        },
        {
            "id": 4679,
            "name": "积石山县"
        },
        {
            "id": 4680,
            "name": "临夏市"
        },
        {
            "id": 4681,
            "name": "广河县"
        }],
        "id": 4682,
        "name": "临夏州"
    },
    {
        "child": [{
            "id": 4683,
            "name": "七里河区"
        },
        {
            "id": 4684,
            "name": "安宁区"
        },
        {
            "id": 4685,
            "name": "城关区"
        },
        {
            "id": 4686,
            "name": "西固区"
        },
        {
            "id": 4687,
            "name": "红古区"
        },
        {
            "id": 4688,
            "name": "永登县"
        },
        {
            "id": 4689,
            "name": "榆中县"
        },
        {
            "id": 4690,
            "name": "皋兰县"
        }],
        "id": 4691,
        "name": "兰州市"
    },
    {
        "child": [{
            "id": 4692,
            "name": "永昌县"
        },
        {
            "id": 4693,
            "name": "金川区"
        }],
        "id": 4694,
        "name": "金昌市"
    },
    {
        "child": [{
            "id": 4695,
            "name": "白银区"
        },
        {
            "id": 4696,
            "name": "平川区"
        },
        {
            "id": 4697,
            "name": "靖远县"
        },
        {
            "id": 4698,
            "name": "景泰县"
        },
        {
            "id": 4699,
            "name": "会宁县"
        }],
        "id": 4700,
        "name": "白银市"
    },
    {
        "child": [{
            "id": 4701,
            "name": "麦积区"
        },
        {
            "id": 4702,
            "name": "秦州区"
        },
        {
            "id": 4703,
            "name": "甘谷县"
        },
        {
            "id": 4704,
            "name": "武山县"
        },
        {
            "id": 4705,
            "name": "清水县"
        },
        {
            "id": 4706,
            "name": "秦安县"
        },
        {
            "id": 4707,
            "name": "张家川县"
        }],
        "id": 4708,
        "name": "天水市"
    },
    {
        "child": [{
            "id": 4709,
            "name": "长城区"
        },
        {
            "id": 4710,
            "name": "镜铁区"
        },
        {
            "id": 4711,
            "name": "雄关区"
        }],
        "id": 4712,
        "name": "嘉峪关市"
    },
    {
        "child": [{
            "id": 4713,
            "name": "静宁县"
        },
        {
            "id": 4714,
            "name": "崆峒区"
        },
        {
            "id": 4715,
            "name": "华亭县"
        },
        {
            "id": 4716,
            "name": "崇信县"
        },
        {
            "id": 4717,
            "name": "泾川县"
        },
        {
            "id": 4718,
            "name": "灵台县"
        },
        {
            "id": 4719,
            "name": "庄浪县"
        }],
        "id": 4720,
        "name": "平凉市"
    },
    {
        "child": [{
            "id": 4721,
            "name": "庆城县"
        },
        {
            "id": 4722,
            "name": "西峰区"
        },
        {
            "id": 4723,
            "name": "镇原县"
        },
        {
            "id": 4724,
            "name": "合水县"
        },
        {
            "id": 4725,
            "name": "华池县"
        },
        {
            "id": 4726,
            "name": "环县"
        },
        {
            "id": 4727,
            "name": "宁县"
        },
        {
            "id": 4728,
            "name": "正宁县"
        }],
        "id": 4729,
        "name": "庆阳市"
    },
    {
        "child": [{
            "id": 4730,
            "name": "成县"
        },
        {
            "id": 4731,
            "name": "礼县"
        },
        {
            "id": 4732,
            "name": "康县"
        },
        {
            "id": 4733,
            "name": "武都区"
        },
        {
            "id": 4734,
            "name": "文县"
        },
        {
            "id": 4735,
            "name": "两当县"
        },
        {
            "id": 4736,
            "name": "徽县"
        },
        {
            "id": 4737,
            "name": "宕昌县"
        },
        {
            "id": 4738,
            "name": "西和县"
        }],
        "id": 4739,
        "name": "陇南市"
    },
    {
        "child": [{
            "id": 4740,
            "name": "凉州区"
        },
        {
            "id": 4741,
            "name": "古浪县"
        },
        {
            "id": 4742,
            "name": "天祝县"
        },
        {
            "id": 4743,
            "name": "民勤县"
        }],
        "id": 4744,
        "name": "武威市"
    },
    {
        "child": [{
            "id": 4745,
            "name": "甘州区"
        },
        {
            "id": 4746,
            "name": "山丹县"
        },
        {
            "id": 4747,
            "name": "临泽县"
        },
        {
            "id": 4748,
            "name": "高台县"
        },
        {
            "id": 4749,
            "name": "肃南县"
        },
        {
            "id": 4750,
            "name": "民乐县"
        }],
        "id": 4751,
        "name": "张掖市"
    },
    {
        "child": [{
            "id": 4752,
            "name": "金塔县"
        },
        {
            "id": 4753,
            "name": "阿克塞县"
        },
        {
            "id": 4754,
            "name": "肃北县"
        },
        {
            "id": 4755,
            "name": "瓜州县"
        },
        {
            "id": 4756,
            "name": "肃州区"
        },
        {
            "id": 4757,
            "name": "玉门市"
        },
        {
            "id": 4758,
            "name": "敦煌市"
        }],
        "id": 4759,
        "name": "酒泉市"
    }]
},
{
    "id": 4760,
    "name": "青海",
    "child": [{
        "child": [{
            "id": 4761,
            "name": "湟中县"
        },
        {
            "id": 4762,
            "name": "湟源县"
        },
        {
            "id": 4763,
            "name": "大通县"
        },
        {
            "id": 4764,
            "name": "城中区"
        },
        {
            "id": 4765,
            "name": "城东区"
        },
        {
            "id": 4766,
            "name": "城西区"
        },
        {
            "id": 4767,
            "name": "城北区"
        }],
        "id": 4768,
        "name": "西宁市"
    },
    {
        "child": [{
            "id": 4769,
            "name": "平安县"
        },
        {
            "id": 4770,
            "name": "乐都县"
        },
        {
            "id": 4771,
            "name": "民和县"
        },
        {
            "id": 4772,
            "name": "互助县"
        },
        {
            "id": 4773,
            "name": "化隆县"
        },
        {
            "id": 4774,
            "name": "循化县"
        }],
        "id": 4775,
        "name": "海东地区"
    },
    {
        "child": [{
            "id": 4776,
            "name": "海晏县"
        },
        {
            "id": 4777,
            "name": "祁连县"
        },
        {
            "id": 4778,
            "name": "刚察县"
        },
        {
            "id": 4779,
            "name": "门源县"
        }],
        "id": 4780,
        "name": "海北州"
    },
    {
        "child": [{
            "id": 4781,
            "name": "尖扎县"
        },
        {
            "id": 4782,
            "name": "同仁县"
        },
        {
            "id": 4783,
            "name": "泽库县"
        },
        {
            "id": 4784,
            "name": "河南县"
        }],
        "id": 4785,
        "name": "黄南州"
    },
    {
        "child": [{
            "id": 4786,
            "name": "共和县"
        },
        {
            "id": 4787,
            "name": "同德县"
        },
        {
            "id": 4788,
            "name": "贵德县"
        },
        {
            "id": 4789,
            "name": "兴海县"
        },
        {
            "id": 4790,
            "name": "贵南县"
        }],
        "id": 4791,
        "name": "海南州"
    },
    {
        "child": [{
            "id": 4792,
            "name": "玛沁县"
        },
        {
            "id": 4793,
            "name": "甘德县"
        },
        {
            "id": 4794,
            "name": "达日县"
        },
        {
            "id": 4795,
            "name": "班玛县"
        },
        {
            "id": 4796,
            "name": "久治县"
        },
        {
            "id": 4797,
            "name": "玛多县"
        }],
        "id": 4798,
        "name": "果洛州"
    },
    {
        "child": [{
            "id": 4799,
            "name": "玉树县"
        },
        {
            "id": 4800,
            "name": "称多县"
        },
        {
            "id": 4801,
            "name": "囊谦县"
        },
        {
            "id": 4802,
            "name": "杂多县"
        },
        {
            "id": 4803,
            "name": "治多县"
        },
        {
            "id": 4804,
            "name": "曲麻莱县"
        }],
        "id": 4805,
        "name": "玉树州"
    },
    {
        "child": [{
            "id": 4806,
            "name": "德令哈市"
        },
        {
            "id": 4807,
            "name": "乌兰县"
        },
        {
            "id": 4808,
            "name": "天峻县"
        },
        {
            "id": 4809,
            "name": "都兰县"
        },
        {
            "id": 4810,
            "name": "大柴旦行委"
        },
        {
            "id": 4811,
            "name": "冷湖行委"
        },
        {
            "id": 4812,
            "name": "茫崖行委"
        },
        {
            "id": 4813,
            "name": "格尔木市"
        }],
        "id": 4814,
        "name": "海西州"
    }]
},
{
    "id": 4815,
    "name": "宁夏",
    "child": [{
        "child": [{
            "id": 4816,
            "name": "灵武市"
        },
        {
            "id": 4817,
            "name": "永宁县"
        },
        {
            "id": 4818,
            "name": "贺兰县"
        },
        {
            "id": 4819,
            "name": "兴庆区"
        },
        {
            "id": 4820,
            "name": "金凤区"
        },
        {
            "id": 4821,
            "name": "西夏区"
        }],
        "id": 4822,
        "name": "银川市"
    },
    {
        "child": [{
            "id": 4823,
            "name": "平罗县"
        },
        {
            "id": 4824,
            "name": "惠农区"
        },
        {
            "id": 4825,
            "name": "大武口区"
        }],
        "id": 4826,
        "name": "石嘴山市"
    },
    {
        "child": [{
            "id": 4827,
            "name": "青铜峡市"
        },
        {
            "id": 4828,
            "name": "同心县"
        },
        {
            "id": 4829,
            "name": "盐池县"
        },
        {
            "id": 4830,
            "name": "红寺堡开发区"
        },
        {
            "id": 4831,
            "name": "利通区"
        }],
        "id": 4832,
        "name": "吴忠市"
    },
    {
        "child": [{
            "id": 4833,
            "name": "西吉县"
        },
        {
            "id": 4834,
            "name": "隆德县"
        },
        {
            "id": 4835,
            "name": "泾源县"
        },
        {
            "id": 4836,
            "name": "彭阳县"
        },
        {
            "id": 4837,
            "name": "原州区"
        }],
        "id": 4838,
        "name": "固原市"
    },
    {
        "child": [{
            "id": 4839,
            "name": "中宁县"
        },
        {
            "id": 4840,
            "name": "海原县"
        },
        {
            "id": 4841,
            "name": "沙坡头区"
        }],
        "id": 4842,
        "name": "中卫市"
    }]
},
{
    "id": 4843,
    "name": "新疆",
    "child": [{
        "child": [{
            "id": 4844,
            "name": "铁门关市"
        }],
        "id": 4845,
        "name": "铁门关市"
    },
    {
        "child": [{
            "id": 4846,
            "name": "五家渠市"
        }],
        "id": 4847,
        "name": "五家渠市"
    },
    {
        "child": [{
            "id": 4848,
            "name": "阿拉尔市"
        }],
        "id": 4849,
        "name": "阿拉尔市"
    },
    {
        "child": [{
            "id": 4850,
            "name": "图木舒克市"
        }],
        "id": 4851,
        "name": "图木舒克市"
    },
    {
        "child": [{
            "id": 4852,
            "name": "天山区"
        },
        {
            "id": 4853,
            "name": "头屯河区"
        },
        {
            "id": 4854,
            "name": "达坂城区"
        },
        {
            "id": 4855,
            "name": "米东区"
        },
        {
            "id": 4856,
            "name": "新市区"
        },
        {
            "id": 4857,
            "name": "沙依巴克区"
        },
        {
            "id": 4858,
            "name": "水磨沟区"
        },
        {
            "id": 4859,
            "name": "乌鲁木齐县"
        }],
        "id": 4860,
        "name": "乌鲁木齐市"
    },
    {
        "child": [{
            "id": 4861,
            "name": "克拉玛依区"
        },
        {
            "id": 4862,
            "name": "独山子区"
        },
        {
            "id": 4863,
            "name": "乌尔禾区"
        },
        {
            "id": 4864,
            "name": "白碱滩区"
        }],
        "id": 4865,
        "name": "克拉玛依市"
    },
    {
        "child": [{
            "id": 4866,
            "name": "石河子市"
        }],
        "id": 4867,
        "name": "石河子市"
    },
    {
        "child": [{
            "id": 4868,
            "name": "吐鲁番市"
        },
        {
            "id": 4869,
            "name": "托克逊县"
        },
        {
            "id": 4870,
            "name": "鄯善县"
        }],
        "id": 4871,
        "name": "吐鲁番地区"
    },
    {
        "child": [{
            "id": 4872,
            "name": "哈密市"
        },
        {
            "id": 4873,
            "name": "巴里坤县"
        },
        {
            "id": 4874,
            "name": "伊吾县"
        }],
        "id": 4875,
        "name": "哈密地区"
    },
    {
        "child": [{
            "id": 4876,
            "name": "和田县"
        },
        {
            "id": 4877,
            "name": "和田市"
        },
        {
            "id": 4878,
            "name": "墨玉县"
        },
        {
            "id": 4879,
            "name": "洛浦县"
        },
        {
            "id": 4880,
            "name": "策勒县"
        },
        {
            "id": 4881,
            "name": "于田县"
        },
        {
            "id": 4882,
            "name": "民丰县"
        },
        {
            "id": 4883,
            "name": "皮山县"
        }],
        "id": 4884,
        "name": "和田地区"
    },
    {
        "child": [{
            "id": 4885,
            "name": "阿克苏市"
        },
        {
            "id": 4886,
            "name": "温宿县"
        },
        {
            "id": 4887,
            "name": "沙雅县"
        },
        {
            "id": 4888,
            "name": "拜城县"
        },
        {
            "id": 4889,
            "name": "阿瓦提县"
        },
        {
            "id": 4890,
            "name": "库车县"
        },
        {
            "id": 4891,
            "name": "柯坪县"
        },
        {
            "id": 4892,
            "name": "新和县"
        },
        {
            "id": 4893,
            "name": "乌什县"
        }],
        "id": 4894,
        "name": "阿克苏地区"
    },
    {
        "child": [{
            "id": 4895,
            "name": "喀什市"
        },
        {
            "id": 4896,
            "name": "巴楚县"
        },
        {
            "id": 4897,
            "name": "泽普县"
        },
        {
            "id": 4898,
            "name": "伽师县"
        },
        {
            "id": 4899,
            "name": "叶城县"
        },
        {
            "id": 4900,
            "name": "岳普湖县"
        },
        {
            "id": 4901,
            "name": "疏附县"
        },
        {
            "id": 4902,
            "name": "疏勒县"
        },
        {
            "id": 4903,
            "name": "英吉沙县"
        },
        {
            "id": 4904,
            "name": "麦盖提县"
        },
        {
            "id": 4905,
            "name": "莎车县"
        },
        {
            "id": 4906,
            "name": "塔什库尔干县"
        }],
        "id": 4907,
        "name": "喀什地区"
    },
    {
        "child": [{
            "id": 4908,
            "name": "阿图什市"
        },
        {
            "id": 4909,
            "name": "阿合奇县"
        },
        {
            "id": 4910,
            "name": "乌恰县"
        },
        {
            "id": 4911,
            "name": "阿克陶县"
        }],
        "id": 4912,
        "name": "克孜勒苏州"
    },
    {
        "child": [{
            "id": 4913,
            "name": "库尔勒市"
        },
        {
            "id": 4914,
            "name": "尉犁县"
        },
        {
            "id": 4915,
            "name": "和静县"
        },
        {
            "id": 4916,
            "name": "博湖县"
        },
        {
            "id": 4917,
            "name": "和硕县"
        },
        {
            "id": 4918,
            "name": "轮台县"
        },
        {
            "id": 4919,
            "name": "若羌县"
        },
        {
            "id": 4920,
            "name": "且末县"
        },
        {
            "id": 4921,
            "name": "焉耆县"
        }],
        "id": 4922,
        "name": "巴音郭楞州"
    },
    {
        "child": [{
            "id": 4923,
            "name": "昌吉市"
        },
        {
            "id": 4924,
            "name": "阜康市"
        },
        {
            "id": 4925,
            "name": "奇台县"
        },
        {
            "id": 4926,
            "name": "玛纳斯县"
        },
        {
            "id": 4927,
            "name": "吉木萨尔县"
        },
        {
            "id": 4928,
            "name": "呼图壁县"
        },
        {
            "id": 4929,
            "name": "木垒县"
        }],
        "id": 4930,
        "name": "昌吉州"
    },
    {
        "child": [{
            "id": 4931,
            "name": "阿拉山口市"
        },
        {
            "id": 4932,
            "name": "博乐市"
        },
        {
            "id": 4933,
            "name": "精河县"
        },
        {
            "id": 4934,
            "name": "温泉县"
        }],
        "id": 4935,
        "name": "博尔塔拉州"
    },
    {
        "child": [{
            "id": 4936,
            "name": "伊宁县"
        },
        {
            "id": 4937,
            "name": "伊宁市"
        },
        {
            "id": 4938,
            "name": "特克斯县"
        },
        {
            "id": 4939,
            "name": "尼勒克县"
        },
        {
            "id": 4940,
            "name": "昭苏县"
        },
        {
            "id": 4941,
            "name": "新源县"
        },
        {
            "id": 4942,
            "name": "霍城县"
        },
        {
            "id": 4943,
            "name": "察布查尔县"
        },
        {
            "id": 4944,
            "name": "巩留县"
        },
        {
            "id": 4945,
            "name": "奎屯市"
        }],
        "id": 4946,
        "name": "伊犁州"
    },
    {
        "child": [{
            "id": 4947,
            "name": "塔城市"
        },
        {
            "id": 4948,
            "name": "乌苏市"
        },
        {
            "id": 4949,
            "name": "额敏县"
        },
        {
            "id": 4950,
            "name": "裕民县"
        },
        {
            "id": 4951,
            "name": "沙湾县"
        },
        {
            "id": 4952,
            "name": "托里县"
        },
        {
            "id": 4953,
            "name": "和布克赛尔县"
        }],
        "id": 4954,
        "name": "塔城地区"
    },
    {
        "child": [{
            "id": 4955,
            "name": "北屯市"
        },
        {
            "id": 4956,
            "name": "阿勒泰市"
        },
        {
            "id": 4957,
            "name": "富蕴县"
        },
        {
            "id": 4958,
            "name": "青河县"
        },
        {
            "id": 4959,
            "name": "吉木乃县"
        },
        {
            "id": 4960,
            "name": "布尔津县"
        },
        {
            "id": 4961,
            "name": "福海县"
        },
        {
            "id": 4962,
            "name": "哈巴河县"
        }],
        "id": 4963,
        "name": "阿勒泰地区"
    }]
},
{
    "id": 4964,
    "name": "台湾",
    "child": [{
        "child": [{
            "id": 4965,
            "name": "台湾市区内"
        }],
        "id": 4966,
        "name": "台湾"
    }]
},
{
    "id": 4967,
    "name": "钓鱼岛",
    "child": [{
        "child": [],
        "id": 4968,
        "name": "钓鱼岛"
    }]
},
{
    "id": 4969,
    "name": "港澳",
    "child": [{
        "child": [{
            "id": 4970,
            "name": "中西区"
        },
        {
            "id": 4971,
            "name": "东区"
        },
        {
            "id": 4972,
            "name": "九龙城区"
        },
        {
            "id": 4973,
            "name": "观塘区"
        },
        {
            "id": 4974,
            "name": "深水埗区"
        },
        {
            "id": 4975,
            "name": "湾仔区"
        },
        {
            "id": 4976,
            "name": "黄大仙区"
        },
        {
            "id": 4977,
            "name": "油尖旺区"
        },
        {
            "id": 4978,
            "name": "离岛区"
        },
        {
            "id": 4979,
            "name": "葵青区"
        },
        {
            "id": 4980,
            "name": "北区"
        },
        {
            "id": 4981,
            "name": "西贡区"
        },
        {
            "id": 4982,
            "name": "沙田区"
        },
        {
            "id": 4983,
            "name": "屯门区"
        },
        {
            "id": 4984,
            "name": "大埔区"
        },
        {
            "id": 4985,
            "name": "荃湾区"
        },
        {
            "id": 4986,
            "name": "元朗区"
        },
        {
            "id": 4987,
            "name": "香港"
        },
        {
            "id": 4988,
            "name": "九龙"
        },
        {
            "id": 4989,
            "name": "新界"
        }],
        "id": 4990,
        "name": "香港特别行政区"
    },
    {
        "child": [{
            "id": 4991,
            "name": "澳门特别行政区"
        },
        {
            "id": 4992,
            "name": "澳门半岛"
        },
        {
            "id": 4993,
            "name": "凼仔"
        },
        {
            "id": 4994,
            "name": "路凼城"
        },
        {
            "id": 4995,
            "name": "路环"
        }],
        "id": 4996,
        "name": "澳门特别行政区"
    }]
}]

    return citys
})